{
  "case_title": "ABDUL KARIM vs THE RETURNING OFFICER/AC, HUB",
  "reference_no_or_id": "C.P. No. 116/1999",
  "case_number": "C.P. No. 116/1999",
  "judgment_date": "1999-03-08",
  "first_hearing_date": "1999-02-22",
  "court": "Balochistan High Court",
  "court_name": "Balochistan High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Javaid Iqbal",
    "Amir-ul-Mulk Mengal"
  ],
  "appellant": [
    {
      "name": "Abdul Karim",
      "designation": "Candidate for Councillor"
    }
  ],
  "respondant": [
    {
      "name": "Returning Officer/AC, Hub",
      "designation": "Election Authority"
    }
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Ashraf Khan Tanoli"
    ],
    "defense": [
      "Attorney General (A.G.)"
    ]
  },
  "complaint_summary": "Petitioner Abdul Karim challenged the rejection of his nomination papers for the position of Councillor from Ward No. 10, Town Committee Hub, citing the absence of his seconder during scrutiny as the reason for rejection.",
  "investigation_summary": "The Returning Officer rejected the nomination papers due to the absence of the seconder during scrutiny. The Appellate Authority upheld this decision. The petitioner argued that the absence of the seconder was not mandatory under the relevant rules.",
  "judgment_summary": {
    "decision": "Petition accepted.",
    "orders": [
      "Set aside the orders of Returning Officer dated 22.2.1999 and Appellate Authority dated 1.3.1999.",
      "Declare Abdul Karim as a validly nominated candidate from Ward No. 10 Town Committee Hub.",
      "Direct Returning Officer to include Abdul Karim's name in the list of validly nominated candidates."
    ],
    "costs": "No order as to costs."
  },
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal accepted; petitioner declared as validly nominated candidate.",
  "result": "Appeal ordered",
  "legal_arguments": [
    "Rule 17 of the Balochistan Local Government (Election) Rules, 1983 does not mandate the presence of the seconder during scrutiny.",
    "The word 'may' in Rule 17 is discretionary and does not imply 'shall'.",
    "Absence of seconder cannot be a valid ground for rejection of nomination papers.",
    "No objections raised by other candidates during scrutiny.",
    "Nomination papers fulfilled all qualifications under Section 20 of the Ordinance."
  ],
  "assets": [],
  "statutes": [
    "Article 199 of the Constitution of Islamic Republic of Pakistan, 1973",
    "Balochistan Local Government Ordinance, 1980",
    "Balochistan Local Government (Election) Rules, 1983"
  ],
  "sections": [
    "Section 17(3)(b) of Balochistan Local Government (Election) Rules, 1983",
    "Section 20 of Balochistan Local Government Ordinance, 1980"
  ],
  "citations": [
    "PLD 1984 150",
    "C.P. No. 1/97 (Judgment dated 7.1.97)",
    "K.L.R. 1999 Civil Cases 601"
  ],
  "reported_as": "K.L.R. 1999 Civil Cases 601",
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Election Law",
    "Constitutional Law"
  ],
  "key_issues": [
    "Whether the absence of the seconder during scrutiny invalidates nomination papers.",
    "Interpretation of the word 'may' in Rule 17 of the Balochistan Local Government (Election) Rules, 1983."
  ],
  "key_points": {
    "issue": "Rejection of nomination papers due to absence of seconder during scrutiny.",
    "appellant_arguments": [
      "Presence of seconder not mandatory under Section 17(3)(b) of the Rules.",
      "No objections raised by other candidates during scrutiny.",
      "Nomination papers fulfilled all qualifications under Section 20 of the Ordinance."
    ],
    "respondent_arguments": [
      "Presence of seconder necessary to verify authenticity of signatures.",
      "Returning Officer acted in accordance with the rules."
    ],
    "court_findings": [
      "Rule 17 does not mandate presence of seconder during scrutiny.",
      "Returning Officer's rejection of nomination papers was arbitrary and unsupported by legal provisions.",
      "Appellate Authority endorsed the decision without proper consideration of relevant laws."
    ]
  },
  "maxims": {
    "Interpretation of 'may' as discretionary": "The word 'may' in statutory language is permissive unless the context indicates otherwise."
  },
  "legal_terms": {
    "Returning Officer": "An official responsible for overseeing election processes.",
    "Seconder": "A person who endorses a candidate's nomination."
  },
  "words_and_phrases": {
    "Scrutiny": "Examination of nomination papers to ensure compliance with legal requirements.",
    "Nomination Papers": "Documents submitted by a candidate to contest an election."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the rejection of nomination papers due to the absence of the seconder during scrutiny. The court ruled that such absence is not mandatory under the relevant election rules, and the petitioner was declared a validly nominated candidate."
}