{
  "case_title": "ASMAT ULLAH vs REGISTRAR TRADE UNION BALOCHISTAN, QUETTA and 2 others",
  "reference_no_or_id": "Labour Appeal No. 18 of 2014",
  "judgment_date": "2014-09-02",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Abdul Ghias Nousherwani"
  ],
  "appellant": [
    "Asmat Ullah"
  ],
  "respondant": [
    "Registrar Trade Union Balochistan, Quetta",
    "Muhammad Zahid",
    "Others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The appellant challenged the order dated 28-4-2014, which allowed the petition of respondent No. 3 for reelection in ten polling stations due to alleged irregularities and rigging during union elections.",
  "investigation_summary": "The elections were conducted on 12-2-2014 under the supervision of the Registrar Trade Union. Allegations of rigging and voter suppression were raised, with claims of polling booths being changed without notice and votes being cast fraudulently.",
  "judgment_summary": "The court remanded the case to the Presiding Officer of the 1st Labour Court Balochistan for framing issues and recording evidence. It was directed that the matter be resolved expeditiously through day-to-day hearings. The High Court also ordered a fresh election schedule with extended nomination submission time.",
  "punishment": "N/A",
  "Decision_or_verdict": "Case remanded to the Labour Court for further proceedings.",
  "legal_arguments": [
    "Appellant argued that elections were conducted with mutual consent and no objections were raised during polling.",
    "Respondent No. 3 alleged rigging and voter suppression, claiming that polling booths were changed and votes were fraudulently cast.",
    "Registrar Trade Union's letter dated 19-1-2014 was cited as a clerical error, with the actual date being 19-2-2014."
  ],
  "assets": [],
  "statutes": [
    "Balochistan Industrial Relations Act, 2010"
  ],
  "sections": [],
  "citations": [
    "2015 P L C 119"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Labour Law",
    "Election Dispute"
  ],
  "key_issues": [
    "Allegations of rigging during union elections.",
    "Validity of election results.",
    "Clerical error in official documents.",
    "Election dispute between two panels of Livestock Peoples Workers Union.",
    "Unfair polling practices."
  ],
  "maxims": {},
  "legal_terms": {},
  "words_and_phrases": {},
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves a dispute over union elections conducted under the supervision of the Registrar Trade Union, Balochistan. Allegations of rigging and voter suppression led to the Labour Court ordering reelections in ten polling stations. The appellant challenged this decision, arguing procedural fairness and mutual consent during the elections. The High Court remanded the case for further evidence and issue framing. A fresh election schedule was also ordered with extended nomination submission time.",
  "directions": {
    "remand_order": "Matter remanded to Presiding Officer 1st Labour Court Balochistan for framing issues and recording evidence.",
    "timeline": "Proceedings to be conducted on a day-to-day basis for timely resolution."
  },
  "polling_stations_involved": [
    "Kohlu",
    "Pishin",
    "Loralai",
    "Zhob",
    "Dukki",
    "Kalat",
    "Khuzdar",
    "Turbat",
    "Musakhail",
    "Dera Bughti"
  ],
  "legal_provisions": "Balochistan Industrial Relations Act, 2010",
  "remarks": "Parties to bear their own costs. Original record to be sent to trial court."
}