{
  "case_title": "AYYAZ ANJUM vs GOVERNMENT OF PUNJAB, HOUSING AND PHYSICAL PLANNING DEPARTMENT through Secretary and others",
  "reference_no_or_id": "Civil Petition for Leave to Appeal No. 1232-L of 1996; Writ Petition No. 3617 of 1996",
  "judgment_date": "1997-04-24",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Coram 3",
  "judges": [
    "Fazal Karim",
    "Muhammad Ilyas",
    "Saad Saood Jan"
  ],
  "appellant": [
    "Ayyaz Anjum"
  ],
  "respondant": [
    "Government of Punjab, Housing and Physical Planning Department through Secretary",
    "Muhammad Younis Chohan"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Younis Chohan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Civil Servant in Public Health Engineering Department",
      "allegation": [
        "Invoking political influence for favorable posting"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Dispute over inter se transfers between two civil servants alleging political influence for postings.",
  "investigation_summary": "High Court called for departmental records and suspended the impugned transfer order dated 13-3-1996.",
  "judgment_summary": "Supreme Court ruled that disputes regarding civil servant postings fall under the exclusive jurisdiction of the Service Tribunal as per Article 212(2) of the Constitution. Interim order by High Court was set aside, and the case was remanded for jurisdiction determination.",
  "judgment_excerpt": "The petitioner and Muhammad Younis Chohan, respondent No. 3, are serving in the Public Health Engineering Department. There have been a number of orders relating to their inter se transfers. Both accused the other of invoking political influence in getting posting of his own choice at the cost of the other. Respondent No. 3 filed a Constitutional petition in the High Court to call in question the legality of the order dated 13-3-1996 which was the latest in the series. The High Court called for the record from the department and in the meanwhile suspended the impugned order. The petitioner seeks leave to appeal from this Court. Clearly, the matters relating to the posting and transfer of a civil servant relate to the terms and conditions of his service. Disputes about these matters fall within the exclusive jurisdiction of the appropriate Service Tribunal. The jurisdiction of High Court is barred in these matters by the express provisions of Article 212(2) of the Constitution. Accordingly, we convert this petition into appeal and set aside the said order. The High Court should first determine the question of its jurisdiction before making any interim order in this case. This appeal is disposed of accordingly.",
  "punishment": "N/A",
  "Decision_or_verdict": "Case remanded; High Court's interim order set aside.",
  "legal_arguments": [
    "Jurisdiction of High Court barred under Article 212(2) of the Constitution.",
    "Matters of civil servant postings fall within Service Tribunal's exclusive jurisdiction."
  ],
  "assets": [],
  "statutes": [
    "Article 212(2) of the Constitution"
  ],
  "sections": [],
  "citations": [
    "1997 P L C (C.S.) 123"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Service Law",
    "Jurisdiction"
  ],
  "key_issues": [
    "Jurisdiction of High Court in civil servant transfer disputes",
    "Exclusive jurisdiction of Service Tribunal"
  ],
  "maxims": {},
  "legal_terms": {
    "Service Tribunal": "A specialized tribunal for resolving disputes related to civil servant service matters."
  },
  "words_and_phrases": {
    "Inter se transfers": "Transfers between two individuals within the same department."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Supreme Court clarified jurisdictional boundaries under Article 212(2) of the Constitution, emphasizing Service Tribunal's role in civil servant disputes."
}