{
  "case_title": "Ch. NASEER-UD-DIN vs GOVERNMENT OF WEST PAKISTAN THROUGH CHIEF SECRETARY, CIVIL SECRETARIAT, LAHORE AND 2 OTHERS",
  "reference_no_or_id": "Writ Petition No. 976-S of 1969/(LHR.)",
  "judgment_date": "1971-04-28",
  "first_hearing_date": "N/A",
  "court": "Baghdad-ul-Jadid",
  "bench_type": "Division Bench",
  "judges": [
    "M. S. H. Qureshi",
    "Anwar-ul-Haq"
  ],
  "appellant": [
    "Ch. Naseer-ud-Din"
  ],
  "respondant": [
    "Government of West Pakistan through Chief Secretary, Civil Secretariat, Lahore",
    "2 Others"
  ],
  "accussed_details": [
    {
      "name": "Ch. Naseer-ud-Din",
      "age": "N/A",
      "gender": "Male",
      "designation": "Tehsildar",
      "allegation": [
        "Inefficiency in attesting mutation corrections",
        "Irregular disposal of rent suits"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Assistant Advocate-General"
    ],
    "defense": [
      "Mr. A. S. Salam"
    ]
  },
  "complaint_summary": "Petitioner challenged disciplinary action reducing him from Tehsildar to Naib-Tehsildar for two years due to inefficiency proven in inquiry.",
  "investigation_summary": "Inquiry conducted by Special Judge (Anti-Corruption)-cum-Enquiry Officer found inefficiency in mutation corrections and rent suit disposal but exonerated petitioner of corruption charges.",
  "judgment_summary": "The court dismissed the petition, holding that the amendment exempting consultation with the Public Service Commission was valid and inefficiency charges were substantiated by evidence.",
  "punishment": "Demotion from Tehsildar to Naib-Tehsildar for two years.",
  "Decision_or_verdict": "Petition dismissed.",
  "legal_arguments": [
    "Consultation with Public Service Commission was obligatory under Article 186 of the 1962 Constitution.",
    "Amendment exempting consultation was ultra vires.",
    "Inefficiency finding was unwarranted based on evidence."
  ],
  "assets": [],
  "statutes": [
    "Article 98 of the Constitution",
    "Article 186 of the 1962 Constitution",
    "Article 234 of the Constitution"
  ],
  "sections": [],
  "citations": [
    "P L D 1966 Lah. 825",
    "P L D 1968 Lah. 1093",
    "P L D 1966 S C 253",
    "P L D 1960 S C 45",
    "P L D 1960 S C 105",
    "P L D 1962 S C 428",
    "P D 1964 S C 17",
    "P L D 1970 Lah, 518",
    "P L P 1970 S C 146",
    "P L D 1971 Baghdad-ul-Jadid 45"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Writ Petition No, 1879 of 1967",
  "legal_categories": [
    "Administrative Law",
    "Constitutional Law",
    "Service Law"
  ],
  "key_issues": [
    "Validity of amendment exempting consultation with Public Service Commission",
    "Substantiation of inefficiency charges",
    "Protection of pre-Constitution service rights under Article 234"
  ],
  "facts": [
    "Petitioner joined service as Field Qanungo in 1947, promoted to Naib-Tehsildar in 1954, and later appointed Tehsildar in 1959.",
    "Charge-sheet served in 1962 regarding mutation correction and another in 1964 for irregular disposal of rent suits.",
    "Inquiry held by Special Judge (Anti-Corruption)-cum-Enquiry Officer in 1965 found petitioner guilty of inefficiency but exonerated him of corruption.",
    "Punishment finalized in 1967, reducing petitioner to Naib-Tehsildar for two years."
  ],
  "legal_analysis": [
    {
      "article": "Article 186 of the 1962 Constitution",
      "interpretation": "Consultation with the Public Service Commission is mandatory unless the Governor provides otherwise by an order."
    },
    {
      "article": "Article 234 of the 1962 Constitution",
      "interpretation": "Terms and conditions of service for pre-Constitution employees are protected, but procedural changes like consultation requirements are not substantive rights."
    }
  ],
  "conclusion": "The petition was dismissed as the amendment exempting consultation with the Public Service Commission was valid, and the findings of inefficiency were supported by evidence.",
  "maxims": {},
  "legal_terms": {
    "Mutation": "A change or correction in land revenue records.",
    "Tehsildar": "Revenue officer in charge of a tehsil."
  },
  "words_and_phrases": {
    "Inefficiency": "Failure to perform duties as per prescribed standards."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Petitioner challenged disciplinary action reducing him in rank due to inefficiency proven in inquiry. Court upheld amendment exempting consultation with Public Service Commission and found charges substantiated."
}