{
  "case_title": "CHHOTEY LAL KISHAN LAL vs COMMISSIONER OF INCOME TAX, U. P.",
  "reference_no_or_id": "Case No. 222 of 1952",
  "judgment_date": "1961-03-01",
  "first_hearing_date": "1951-03-12",
  "court": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "R. N. Gurtu",
    "B. Upadhya"
  ],
  "appellant": [
    "CHHOTEY LAL KISHAN LAL"
  ],
  "respondant": [
    "COMMISSIONER OF INCOME TAX, U. P."
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Departmental Representative"
    ],
    "defense": [
      "Learned Counsel for the Assessee"
    ]
  },
  "complaint_summary": "The appellant filed an appeal before the Income Tax Appellate Tribunal, but the memorandum of appeal incorrectly listed the Appellate Assistant Commissioner as the respondent instead of the Income Tax Officer, violating Rule 14 of the Tribunal Rules.",
  "investigation_summary": "The Income Tax Appellate Tribunal dismissed the appeal due to procedural non-compliance, specifically the incorrect naming of the respondent in the memorandum of appeal.",
  "judgment_summary": "The Allahabad High Court held that the procedural error in naming the respondent did not invalidate the appeal. The court emphasized that procedural rules should not obstruct justice and ruled that the appeal should have been decided on merits.",
  "punishment": "N/A",
  "Decision_or_verdict": "Question answered in the negative; the memorandum of appeal was deemed valid despite the procedural error.",
  "legal_arguments": [
    "Rule 14 of the Income Tax Appellate Tribunal Rules requires the Income Tax Officer to be named as the respondent.",
    "Section 33 of the Income Tax Act, 1922, confers the right to file an appeal without specifying the respondent.",
    "Procedural errors should not defeat substantive rights."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Act, 1922",
    "Rule 14 of the Income Tax Appellate Tribunal Rules"
  ],
  "sections": [
    "Section 33",
    "Section 66(1)",
    "Section 59"
  ],
  "citations": [
    "(1953) 23 ITR 371",
    "(1958) 33 ITR 591",
    "(1959) 37 ITR 220",
    "(1960) 39 ITR 649",
    "(1879) 4 AC 504",
    "(1884) 26 Ch. D 700"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Income Tax Law",
    "Procedural Law"
  ],
  "key_issues": [
    "Validity of appeal despite procedural error in naming respondent.",
    "Applicability of Rule 14 of the Tribunal Rules."
  ],
  "maxims": {
    "Procedural rules should subserve justice, not obstruct it.": "Lord Penzance in Kendall v. Hamilton"
  },
  "legal_terms": {
    "Procedural irregularity": "An error in following prescribed legal procedures that does not affect substantive rights."
  },
  "words_and_phrases": {
    "Respondent": "The party against whom an appeal is filed.",
    "Memorandum of Appeal": "A formal document outlining the grounds of appeal."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk",
    "reported_as": "1963 P T D 970"
  },
  "summary_vector_notes": "The case revolves around procedural compliance in filing an appeal under the Income Tax Act, 1922. The Allahabad High Court ruled that procedural errors in naming the respondent should not invalidate the appeal, emphasizing the importance of substantive justice over procedural technicalities.",
  "legal_provisions": {
    "income_tax_act_section": "66(1)",
    "rule": "Rule 14 of Income Tax Appellate Tribunal Rules"
  },
  "decision_summary": "The court held that the procedural error in naming the respondent in the memorandum of appeal was not an illegality and did not render the appeal invalid. The appeal should have been decided on merits.",
  "costs_awarded": {
    "assessee": "Rs. 250",
    "department_counsel_fee": "Rs. 250"
  }
}