{
  "case_title": "COMMISSIONER OF INCOME-TAX vs SHERVANI SUGAR SYNDICATE LTD.",
  "reference_no_or_id": "Income Tax Application No. 55 of 1991",
  "case_number": "Income Tax Application No. 55 of 1991",
  "judgment_date": "1992-03-31",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "court_name": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "R. K. Gulati",
    "Anshuman Singh"
  ],
  "appellant": [
    "COMMISSIONER OF INCOME-TAX"
  ],
  "respondant": [
    "SHERVANI SUGAR SYNDICATE LTD."
  ],
  "respondent": "SHERVANI SUGAR SYNDICATE LTD.",
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The case involves questions of law arising from the Income-tax Appellate Tribunal's decision regarding valuation of closing stock of free sugar and its jurisdiction in admitting and allowing a miscellaneous application.",
  "investigation_summary": "N/A",
  "judgment_summary": "The court directed the Tribunal to draw up a statement of the case and refer the specified questions of law to the High Court for its opinion. No order was made as to costs.",
  "directions": "Tribunal to draw up a statement of the case and refer the aforesaid questions to this Court for its opinion.",
  "punishment": "N/A",
  "Decision_or_verdict": "Order accordingly",
  "result": "Order accordingly",
  "legal_arguments": [
    "Whether the Tribunal exceeded its jurisdiction by revising its own order under section 256(2).",
    "Whether the Tribunal correctly valued the closing stock of free sugar at two different rates, adopting a principle not recognized in law or accountancy."
  ],
  "questions_of_law": [
    {
      "question": "Whether in law and on the facts of the case, the Income-tax Appellate Tribunal has not exceeded its jurisdiction by admitting and allowing the miscellaneous application of the assessee when it amounted to revision of its own order which is not permissible in law and which cannot be covered as a mistake apparent from record which only can be rectified under section 256(2)?"
    },
    {
      "question": "Whether in law and on the facts the Income-tax Appellate Tribunal was correct in holding that the closing stock of free sugar as on August 30, 1978, should be valued at two different rates, i.e., 42,704 quintals should be valued at Rs. 85,58,293 being the amount realised on sale up to November 30, 1978, which is after the closing of the previous year and the balance sugar of 28,789 quintals should be valued at Rs. 207.86 per quintal which was the cost price as on June 30, 1978, and thus adopting an altogether new principle which has got no sanctity in law and in accountancy?"
    }
  ],
  "costs_order": "No order as to costs",
  "assets": [],
  "statutes": [
    "Income-tax Act"
  ],
  "sections": [
    "Section 256(2)"
  ],
  "citations": [
    "1993 P T D 1511"
  ],
  "reported_as": "1993 P T D 1511",
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Tax Law",
    "Appellate Jurisdiction"
  ],
  "key_issues": [
    "Jurisdiction of Income-tax Appellate Tribunal",
    "Valuation principles for closing stock"
  ],
  "maxims": {},
  "legal_terms": {
    "closing stock": "Inventory held by a business at the end of a financial period.",
    "miscellaneous application": "A procedural request made to a tribunal or court."
  },
  "words_and_phrases": {
    "revision of its own order": "The act of altering a previously issued decision by the same authority."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the jurisdiction of the Income-tax Appellate Tribunal and its valuation methodology for closing stock of free sugar. The High Court directed the Tribunal to submit a statement of the case for further review."
}