{
  "case_title": "COMMISSIONER OF WEALTH TAX vs SUNEHARI LAL GARG",
  "reference_no_or_id": "Wealth Tax Reference No. 213 of 1980",
  "case_number": "Wealth Tax Reference No. 213 of 1980",
  "judgment_date": "1996-12-12",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "court_name": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Om Prakash",
    "Bhagwan Din"
  ],
  "appellant": [
    "Commissioner of Wealth Tax"
  ],
  "respondant": [
    "Sunehari Lal Garg"
  ],
  "respondent": "Sunehari Lal Garg",
  "accussed_details": [
    {
      "name": "Sunehari Lal Garg",
      "age": "N/A",
      "gender": "Male",
      "designation": "Individual Assessee",
      "allegation": [
        "Failure to include Rs. 43,100 (gift to minor children) in net wealth for assessment years 1972-73 to 1975-76."
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Standing Counsel for Revenue"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The Revenue challenged the exclusion of Rs. 43,100 (gift to minor children) from the assessee's net wealth for assessment years 1972-73 to 1975-76 under section 4(1)(a) of the Wealth Tax Act, 1957.",
  "investigation_summary": "The Wealth Tax Officer included Rs. 43,100 in the assessee's net wealth for assessment years 1972-73 to 1975-76. The Appellate Assistant Commissioner and Income-tax Appellate Tribunal disagreed, citing the proviso to section 4(1)(a) of the Wealth Tax Act, 1957.",
  "judgment_summary": "The Allahabad High Court upheld the Appellate Tribunal's decision, agreeing that the amount of Rs. 43,100, chargeable to gift-tax during the period March 31, 1964, to April 1, 1972, should not be included in the assessee's net wealth for assessment years 1972-73 to 1975-76.",
  "punishment": "N/A",
  "Decision_or_verdict": "In favor of the assessee and against the Revenue.",
  "result": "Question answered",
  "reported_as": "1998 P T D 2309",
  "legal_arguments": [
    "Prosecution argued that section 4(1)(a) of the Wealth Tax Act, 1957, became operative from assessment year 1972-73 onwards.",
    "Defense relied on precedents from G.A. Parashuram v. CWT (1988) 171 ITR 41 (AP) and CWT v. H.H. Bhawanisingh (1990) 181 ITR 458 (MP), which held that assets chargeable to gift-tax during March 31, 1964, to April 1, 1972, are excluded from net wealth."
  ],
  "assets": [
    "Rs. 43,100 (gift to minor children)"
  ],
  "statutes": [
    "Wealth Tax Act, 1957",
    "Gift-tax Act, 1958"
  ],
  "sections": [
    "Section 4(1)(a) of Wealth Tax Act, 1957",
    "Section 5 of Gift-tax Act, 1958"
  ],
  "citations": [
    "G.A. Parashuram v. CWT (1988) 171 ITR 41 (AP)",
    "CWT v. H.H. Bhawanisingh (1990) 181 ITR 458 (MP)"
  ],
  "precedents": [
    {
      "case_name": "G.A. Parashuram v. CWT",
      "citation": "(1988) 171 ITR 41 (AP)",
      "decision": "Amount chargeable to gift-tax during the specified period will not be included in net wealth."
    },
    {
      "case_name": "CWT v. H.H. Bhawanisingh",
      "citation": "(1990) 181 ITR 458 (MP)",
      "decision": "Similar view as G.A. Parashuram case."
    }
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law",
    "Wealth Tax"
  ],
  "key_issues": [
    "Whether Rs. 43,100 (gift to minor children) should be included in the assessee's net wealth for assessment year 1972-73.",
    "Applicability of section 4(1)(a) of the Wealth Tax Act, 1957, post-assessment year 1971-72."
  ],
  "questions_referred": [
    {
      "question": "Whether, on the facts and in the circumstances of the case, the Income-tax Appellate Tribunal was correct in law in holding that the amount of Rs. 43,100 which represented the amount of gift made by the assessee to his minor children could not be included in his net wealth for the assessment year 1972-73?"
    },
    {
      "question": "Whether, on the facts and in the circumstances of the case, the contention of the Department before the Income-tax Appellate Tribunal that the proviso to section 4(1)(a) of the Wealth Tax Act, 1957, made section 4(1)(a) of the Wealth Tax Act, 1957, inoperative only for a period of assessment years 1964-65 to 1971-72 in respect of the transferred assets chargeable or exempted under section 5 of the Gift-tax Act, 1958, and that from the assessment year 1972-73 and onwards such assets were to be included in the net wealth of the assessee irrespective of its chargeability or exemption under the Gift-tax Act is legally correct and whether the Income-tax Appellate Tribunal erred in law in not accepting the same?"
    },
    {
      "question": "Whether, on the facts and in the circumstances of the case, the Income-tax Appellate Tribunal was correct in law in upholding the Appellate Assistant Commissioner's action in deleting an addition of Rs. 43,100 made by the Wealth-tax Officer to the assessee's wealth under section 4(1)(a) of the Wealth Tax Act, 1957?"
    }
  ],
  "facts": {
    "assessee": "Individual",
    "assessment_years": "1972-73 to 1975-76",
    "disclosed_amount": "Rs. 43,100",
    "nature_of_amount": "Gifts made by the assessee to his minor children"
  },
  "legal_issue": "Whether the disclosed amount of Rs. 43,100 is includible in the net wealth of the assessee.",
  "tribunal_decision": "The amount chargeable to gift-tax during the period from March 31, 1964, to April 1, 1972, will not be included in the net wealth of the assessee.",
  "court_decision": "In agreement with the Andhra Pradesh and Madhya Pradesh High Courts, the question is answered in favor of the assessee and against the Revenue.",
  "maxims": {},
  "legal_terms": {
    "Net Wealth": "Total wealth of an individual subject to taxation under the Wealth Tax Act.",
    "Gift-tax": "Tax levied on gifts exceeding a certain monetary threshold."
  },
  "words_and_phrases": {
    "Chargeable to gift-tax": "Subject to taxation under the Gift-tax Act.",
    "Proviso": "A clause in a statute that qualifies or modifies its main provisions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the inclusion of Rs. 43,100 (gift to minor children) in the assessee's net wealth for assessment years 1972-73 to 1975-76. The Allahabad High Court upheld the Appellate Tribunal's decision, relying on precedents from Andhra Pradesh and Madhya Pradesh High Courts, which excluded such assets from net wealth if chargeable to gift-tax during March 31, 1964, to April 1, 1972."
}