{
  "case_title": "FAZAL-E-HADI vs NATIONAL ACCOUNTABILITY BUREAU, SINDH through Director-General, Sindh and another",
  "reference_no_or_id": "C.P. No,D-2088 of 2007",
  "judgment_date": "2007-11-02",
  "first_hearing_date": "N/A",
  "court": "Sindh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Rehmat Hussain Jaffery",
    "Syed Mehmood Alam Rizvi"
  ],
  "appellant": [
    "Fazal-e-Hadi"
  ],
  "respondant": [
    "National Accountability Bureau, Sindh through Director-General, Sindh",
    "Another (unnamed)"
  ],
  "accussed_details": [
    {
      "name": "Fazal-e-Hadi",
      "age": "N/A",
      "gender": "Male",
      "designation": "Assistant Director (Investigation), NAB Sindh",
      "allegation": [
        "Demanding illegal gratification of Rs. 1 million or Toyota Corolla GLI car",
        "Possession of tainted money (Rs. 200,000)",
        "Corruption and corrupt practices under Section 9(a)(i) and punishable under Section 10 of NAB Ordinance, 1999"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Ainuddin Khan (A.D.P.G.A., NAB)"
    ],
    "defense": [
      "Mr. Shaukat Hussain Zubaidi"
    ]
  },
  "complaint_summary": "The complainant, Zafar Baloch, alleged that Fazal-e-Hadi demanded Rs. 1 million or a Toyota Corolla GLI car to exclude his name from an inquiry and soften the role of his colleague Shahid Raza.",
  "investigation_summary": "A trap team supervised by Judicial Magistrate Asim Lodhi recovered Rs. 200,000 of tainted money from Fazal-e-Hadi's possession during a raid. Recovery memo was prepared, and the accused was taken into custody. Fazal-e-Hadi admitted to receiving illegal gratification and offered plea bargaining of Rs. 745,700, including Rs. 650,000 as illegal gratification and 15% NAB accidental charges.",
  "judgment_summary": "The court found prima facie evidence against Fazal-e-Hadi, including possession of tainted money, plea bargaining affidavit, and handwritten admission of guilt. Minor contradictions in the prosecution's case were deemed insufficient to discredit the evidence. Bail was refused as corruption by NAB officials undermines the institution's credibility.",
  "punishment": "N/A (Pending trial)",
  "Decision_or_verdict": "Bail refused",
  "legal_arguments": {
    "defense": [
      "Contradictions in prosecution's case, including delayed statement of complainant (8 days) and lack of expert verification of telephonic transcripts.",
      "No mention of illegal demand in complainant's initial application for pardon.",
      "Discrepancies in raiding report and reference.",
      "Stereo-type warrant of arrest and procedural flaws, including the return of the seized car to the applicant's wife after 36 days."
    ],
    "prosecution": [
      "Corroborated evidence, including recovery of tainted money and independent witness testimony from Judicial Magistrate.",
      "Affidavit of plea bargain dated 14th July, 2007.",
      "Handwritten letter by the applicant admitting mistakes and requesting pardon.",
      "Letter dated 21st May, 2007 showing applicant authorized as Investigating Officer."
    ]
  },
  "assets": [
    "Toyota Corolla GLI car (returned to wife of accused after 36 days)"
  ],
  "statutes": [
    "National Accountability Bureau Ordinance, 1999"
  ],
  "sections": [
    "Section 9(a)(i)",
    "Section 10"
  ],
  "citations": [
    "2008 P Cr. L J 171"
  ],
  "witnesses": [
    "Zafar Baloch (complainant)",
    "Mr. Asim Lodhi (Judicial Magistrate)"
  ],
  "witness_statement": {
    "Zafar Baloch": "Alleged demand of Rs. 1 million or Toyota Corolla GLI car by Fazal-e-Hadi.",
    "Mr. Asim Lodhi": "Supervised raid and recovery of Rs. 200,000 from accused."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Corruption",
    "Bail Application"
  ],
  "key_issues": [
    "Demand for illegal gratification",
    "Recovery of tainted money",
    "Plea bargaining admission"
  ],
  "maxims": {
    "N/A": "N/A"
  },
  "legal_terms": {
    "Plea Bargaining": "An agreement in a criminal case where the defendant admits guilt in exchange for a lesser punishment."
  },
  "words_and_phrases": {
    "Tainted Money": "Money obtained through illegal means and used as evidence in corruption cases."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves allegations of corruption against Fazal-e-Hadi, an Assistant Director at NAB Sindh. Evidence includes recovery of tainted money, plea bargaining admission, and corroborated witness testimony. Bail was refused due to prima facie evidence of guilt and the undermining of NAB's credibility by its officials."
}