{
  "case_title": "GHAUS KHAN vs NAZIR KHAN",
  "reference_no_or_id": "R.O.R. No. 1835 of 1988",
  "judgment_date": "1994-05-29",
  "first_hearing_date": "1988-09-21",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Imtiaz Masrur"
  ],
  "appellant": [
    "Ghaus Khan"
  ],
  "respondant": [
    "Nazir Khan"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner, Ghaus Khan, filed a revision petition against the order of the Additional Commissioner (Revenue), Gujranwala Division, which dismissed his appeal regarding the modification of land ownership in village Bara Manga.",
  "investigation_summary": "The disputed land measuring 4 marlas in Khasra No. 3879 was withdrawn from Ghaus Khan and given to Nazir Khan, while Khasra No. 2328 measuring 4 marlas was withdrawn from Nazir Khan and given to Ghaus Khan. This modification was approved by the Collector on 6.7.1983 during settlement operations conducted in 1977-78 in village Bara Manga, Tehsil Shikargah, District Sialkot.",
  "judgment_summary": "The court set aside the order of the Additional Commissioner (Revenue) dated 21.9.1988, citing technical grounds for rejection rather than merit. The case was remanded to the Collector for a decision based on merit and law.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision petition accepted; case remanded to the Collector for decision on merit.",
  "legal_arguments": [
    "Petitioner argued that the land was unlawfully taken away, citing Jamabandi records from 1980-81 and Misl-e-Haqiat records from 1987-88. He also mentioned planting fruit trees as evidence of ownership.",
    "Respondent argued that the Collector's order was not challenged and possession was already with the respondent, supported by mutation register entries, making the appeal time-barred."
  ],
  "assets": [
    {
      "type": "Land",
      "details": {
        "khasra_no": "3879",
        "area": "4 marlas",
        "ownership": "Disputed"
      }
    },
    {
      "type": "Land",
      "details": {
        "khasra_no": "2328",
        "area": "4 marlas",
        "ownership": "Disputed"
      }
    }
  ],
  "statutes": [
    "K.L.R. 1995 Revenue Cases 136"
  ],
  "sections": [
    "N/A"
  ],
  "citations": [
    "N/A"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Dispute",
    "Revenue Law"
  ],
  "key_issues": [
    "Whether the modification of land ownership was lawful.",
    "Whether the appeal was time-barred."
  ],
  "maxims": {},
  "legal_terms": {
    "Jamabandi": "Land record showing ownership details.",
    "Misl-e-Haqiat Ishtimal": "Consolidation record of land ownership."
  },
  "words_and_phrases": {
    "Time-barred": "Legal action not taken within the prescribed time limit."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk",
    "printed_on": "2025-07-15",
    "printed_by": "Areesha Kaleem"
  },
  "summary_vector_notes": "The case revolves around a land dispute in village Bara Manga, where ownership modifications were challenged by the petitioner. The court emphasized merit-based decision-making over technicalities and remanded the case for reconsideration."
}