{
  "case_title": "GHULAM MUHAMMAD vs THE STATE",
  "reference_no_or_id": "ROR No. 1032 of 1988",
  "judgment_date": "1991-02-12",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Single Bench",
  "judges": [
    "Asad Ali Shah"
  ],
  "appellant": [
    "Ghulam Muhammad"
  ],
  "respondant": [
    "The State"
  ],
  "accussed_details": [
    {
      "name": "Ghulam Muhammad",
      "age": "N/A",
      "gender": "Male",
      "designation": "Landless Tenant",
      "allegation": [
        "Irregular land allotment under Temporary Cultivation Scheme"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Petitioner Ghulam Muhammad applied for land under the 15 Years Lease Scheme after the deadline of 31-5-1971 and was granted lease based on being recorded as a landless tenant during Kharif 1969-1970. Complaints of irregular allotments led to an inquiry, which found the petitioner ineligible.",
  "investigation_summary": "Assistant Commissioner/Collector conducted an inquiry and concluded that the petitioner was not cultivating land during the crucial period. Subsequent appeals and revisions upheld the findings, with portions of the land allotted to other individuals under the Atomic Energy Complex Oustees Scheme.",
  "judgment_summary": "The court held that the petitioner was eligible for the lease but failed to apply for proprietary rights under the notification dated 3-9-1979. The original lease expired in 1986, and the land was validly allotted to respondents under a permanent scheme. Petitioner can retain remaining land as a fresh lessee.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petitioner’s claim to the land was denied; respondents’ allotments upheld.",
  "legal_arguments": [
    "Concurrent jurisdiction of Assistant Commissioner and District Collector.",
    "Eligibility criteria under Temporary Cultivation Scheme and Atomic Energy Complex Oustees Scheme.",
    "Failure to apply for proprietary rights under notification dated 3-9-1979."
  ],
  "assets": [
    "99 Kanals, 15 Marlas of State Land in Chak No. 4/DB, Tehsil and District Mianwali"
  ],
  "statutes": [
    "Atomic Energy Complex Oustees Scheme",
    "Temporary Cultivation Scheme"
  ],
  "sections": [
    "N/A"
  ],
  "citations": [
    "K.L.R. 1996 Revenue Cases 109"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "R.O.R. No. 1463 of 1978-79",
  "legal_categories": [
    "Land Revenue",
    "Lease Agreements"
  ],
  "key_issues": [
    "Eligibility for land under Temporary Cultivation Scheme.",
    "Validity of allotments under Atomic Energy Complex Oustees Scheme.",
    "Failure to apply for proprietary rights."
  ],
  "key_points": {
    "land_details": "99 Kanals, 15 Marlas in Chak No. 4/DB, Tehsil and District Mianwali",
    "schemes_involved": [
      "15 Years Lease Scheme",
      "Temporary Cultivation Scheme",
      "Atomic Energy Complex Oustees Scheme"
    ],
    "notifications": "Notification dated 3-9-1979 granting proprietary rights to eligible lessees."
  },
  "maxims": {},
  "legal_terms": {
    "Concurrent Jurisdiction": "Authority shared by multiple judicial officers to hear and decide cases.",
    "Proprietary Rights": "Legal rights to own property."
  },
  "words_and_phrases": {
    "Landless Tenant": "An individual recorded as cultivating land without ownership.",
    "Temporary Cultivation Scheme": "A government scheme for leasing state land for cultivation."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Petitioner Ghulam Muhammad challenged the denial of land under the Temporary Cultivation Scheme. The court upheld the respondents’ allotments under the Atomic Energy Complex Oustees Scheme due to petitioner’s failure to apply for proprietary rights. Petitioner retains remaining land as a fresh lessee.",
  "summary": {
    "issue": "Revision petition against refusal to grant State land under the Temporary Cultivation Scheme.",
    "facts": [
      "Petitioner applied for land under the 15 Years Lease Scheme in 1971 after the deadline of 31-5-1971.",
      "Petitioner was granted lease based on being a landless tenant during Kharif, 1969 to Kharif, 1970.",
      "Complaints of irregular allotments led to an inquiry, which found the petitioner was not cultivating during the crucial period.",
      "Possession of land continued with the petitioner despite findings."
    ],
    "procedural_history": [
      "Additional Commissioner (Consolidation) accepted appeal in 1977, stating District Collector lacked authority to review orders.",
      "Case remanded in 1983 with instructions to cancel irregular allotments.",
      "Assistant Commissioner/Collector found petitioner eligible but noted part of the land was granted under the Atomic Energy Complex Oustees Scheme."
    ],
    "judgment": [
      "Petitioner was eligible under the 15 Years Lease Scheme.",
      "Land was included in the Atomic Energy Complex Scheme in 1980.",
      "Notification dated 3-9-1979 required lessees to apply for proprietary rights, which petitioner failed to do.",
      "Original lease expired in 1986; petitioner now occupies land without authority.",
      "Allotments to respondents upheld as valid; petitioner allowed to retain remaining land as a fresh lessee."
    ]
  }
}