{
  "case_title": "In Re: REQUEST OF MR. RIAZ AHMED SIPRA, SECRETARY/ MEMBER, FEDERAL ANTI CORRUPTION COMMITTEE FOR SUPPLY OF COPY OF STATEMENT OF ASSETS AND LIABILITIES OF MIAN MUHAMMAD NAWAZ SHARIF, M.NA.",
  "reference_no_or_id": "Federal Government Notification No. 1/8/86",
  "case_number": "Federal Government Notification No. 1/8/86",
  "judgment_date": "1994-07-12",
  "first_hearing_date": "1994-06-26",
  "court": "Chief Election Commissioner",
  "court_name": "Chief Election Commissioner",
  "bench_type": "Single Bench",
  "judges": [
    "Naimuddin"
  ],
  "appellant": [
    "Mr. Riaz Ahmed Sipra, Secretary/Member, Federal Anti-Corruption Committee"
  ],
  "respondant": [
    "Mian Muhammad Nawaz Sharif, MNA"
  ],
  "respondent": "Mian Muhammad Nawaz Sharif, M.N.A.",
  "accussed_details": [
    {
      "name": "Mian Muhammad Nawaz Sharif",
      "age": "N/A",
      "gender": "Male",
      "designation": "Member of National Assembly",
      "allegation": [
        "Filing false statement of assets and liabilities",
        "Corrupt practices under Section 78 of the Representation of the People Act, 1976"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Bashir Zafar"
    ],
    "defense": [
      "Mr. Muhammad Akram Sheikh",
      "Mr. Bilal"
    ]
  },
  "complaint_summary": "Application filed by Mr. Riaz Ahmed Sipra requesting a copy of the statement of assets and liabilities of Mian Muhammad Nawaz Sharif under subsection (3A) of Section 42 of the Representation of the People Act, 1976. Allegation of false statement constituting corrupt practices and disqualification under Article 63(2) of the Constitution.",
  "investigation_summary": "Federal Anti-Corruption Committee sought the document to move a reference to the Speaker under Article 63(2) of the Constitution, alleging false statements in the respondent's assets declaration.",
  "judgment_summary": "The application was dismissed on the grounds that the Federal Anti-Corruption Committee lacked locus standi to request the document. The court held that the committee was not authorized by the Prime Minister's Order of 1987 to investigate members of Parliament or refer matters to the Speaker under Article 63(2). The court emphasized that statements of assets and liabilities are public documents but cannot be accessed by entities without legal standing.",
  "court_findings": [
    "The Federal Anti-Corruption Committee's functions, as outlined in the Prime Minister's Order dated 11-1-1987, do not include dealing with or investigating members of Parliament or referring matters to the Speaker under Article 63(2) of the Constitution.",
    "The statement of assets and liabilities is a public document but cannot be accessed by any person without locus standi.",
    "The Representation of the People Act, 1976 does not explicitly authorize the Chief Election Commissioner to grant copies of such statements to any person or body without a legitimate purpose."
  ],
  "punishment": "N/A",
  "Decision_or_verdict": "Application dismissed",
  "result": "Application dismissed",
  "legal_arguments": [
    "Applicant argued that any person could request a copy of public documents under Article 87 of Qanun-e-Shahadat.",
    "Defense argued that the Federal Anti-Corruption Committee lacked authority under the Prime Minister's Order of 1987 to request such documents.",
    "Defense cited Articles 4 and 25 of the Constitution, emphasizing the respondent's right to equal protection under the law."
  ],
  "arguments": {
    "applicant": {
      "counsel": "Mr. Bashir Zafar",
      "submission": "The copy is required to move the Speaker for making a reference under Article 63(2) of the Constitution, alleging false statements constituting corrupt practices under section 78 of the Representation of the People Act, 1976."
    },
    "respondent": {
      "counsel": "Mr. Muhammad Akram Sheikh",
      "objections": [
        "The application lacked purpose or grounds initially.",
        "The Federal Anti-Corruption Committee is not authorized to request such documents under its mandate.",
        "The request was made in bad faith and was belated."
      ]
    }
  },
  "assets": [
    "Statement of assets and liabilities of Mian Muhammad Nawaz Sharif"
  ],
  "statutes": [
    "Representation of the People Act, 1976",
    "Qanun-e-Shahadat Order, 1984",
    "Constitution of Pakistan, Articles 4, 25, 63(2), 218, 219"
  ],
  "sections": [
    "Section 42(3A) of the Representation of the People Act, 1976",
    "Section 78 of the Representation of the People Act, 1976"
  ],
  "legal_references": [
    "Representation of the People Act, 1976, Section 42(3A), Section 78",
    "Article 63(2) of the Constitution of Pakistan",
    "Article 4 and Article 25(1) of the Constitution of Pakistan",
    "Qanun-e-Shahadat, Article 87"
  ],
  "citations": [
    "1994 C L C 2088",
    "PLD 1969 Lahore 602"
  ],
  "precedents_cited": [
    {
      "case_name": "Sultan Ali Lakhani v. Nasreen Jalil",
      "reference": "Judgment on granting copies of assets and liabilities to rival candidates."
    },
    {
      "case_name": "Ghulam Mustafa Khar v. Chief Election Commissioner of Pakistan",
      "reference": "PLD 1969 Lahore 602"
    }
  ],
  "court_order": [
    "The application for a copy of the statement of assets and liabilities of Mian Muhammad Nawaz Sharif is dismissed.",
    "Similar applications for Mian Abbas Sharif and Mian Shahbaz Sharif are also dismissed."
  ],
  "recommendation": "The court suggested that the government may amend the Representation of the People Act, 1976 to include provisions for granting public access to statements of assets and liabilities if deemed appropriate.",
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Election Law",
    "Anti-Corruption",
    "Constitutional Law"
  ],
  "key_issues": [
    "Locus standi of the Federal Anti-Corruption Committee",
    "Access to public documents under Qanun-e-Shahadat",
    "Authority of the Chief Election Commissioner to grant access to statements of assets and liabilities",
    "Assessment of whether the Federal Anti-Corruption Committee's request aligns with its authorized functions."
  ],
  "maxims": {
    "Nemo dat quod non habet": "No one can give what they do not have."
  },
  "legal_terms": {
    "Locus Standi": "The right or capacity to bring an action or to appear in a court."
  },
  "words_and_phrases": {
    "Corrupt Practices": "Actions defined under Section 78 of the Representation of the People Act, 1976."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk",
    "reported_as": "1994 C L C 2088"
  },
  "summary_vector_notes": "Application dismissed due to lack of locus standi of the Federal Anti-Corruption Committee. Court emphasized that public documents like statements of assets and liabilities cannot be accessed without legal authority."
}