{
  "case_title": "KHALIDA SAIFI vs FAREED AHMED ANSARI AND ANOTHERs",
  "reference_no_or_id": "Case Rs, SROA-171 of 1975-76",
  "case_number": "SROA-171 of 1975-76",
  "judgment_date": "1978-07-13",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Single Bench",
  "judges": [
    "Abdullah D. Baloch"
  ],
  "appellant": [
    "Khalida Saifi"
  ],
  "respondant": [
    "Fareed Ahmed Ansari",
    "Zohra Naveed Ansari"
  ],
  "accussed_details": [
    {
      "name": "Fareed Ahmed Ansari",
      "age": "N/A",
      "gender": "Male",
      "designation": "Previous Lessee",
      "allegation": [
        "Subletting leased land",
        "Violation of Land Grant Policy"
      ]
    },
    {
      "name": "Zohra Naveed Ansari",
      "age": "N/A",
      "gender": "Female",
      "designation": "Current Lessee",
      "allegation": [
        "Improper lease acquisition",
        "Lack of required rights under Land Grant Policy"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The appellant challenged the lease granted to Mrs. Zohra Naveed Ansari, alleging violations of Land Grant Policy and improper alienation of leased land by Mr. Fareed Ahmed Ansari.",
  "investigation_summary": "The Commissioner, Karachi dismissed the appellant's review petition as time-barred. Subsequent examination revealed violations of lease terms and policy instructions in the grant of land.",
  "judgment_summary": {
    "lease_details": {
      "original_lessee": "Usman Ali Ansari",
      "renewed_lessee": "Fareed Ahmed Ansari (1970-71)",
      "surrendered_area": "41.0 Acres",
      "final_lessee": "Zohra Naveed Ansari",
      "total_area": "47.20 Acres"
    },
    "policy_violations": [
      "Subletting of land by Fareed Ahmed Ansari to appellant",
      "Improper grant of lease to Zohra Naveed Ansari without required rights (Harap, Khasmokal, Mohag, Hak-Kabza)",
      "Irregular surrender statement used to transfer lease rights"
    ],
    "key_findings": [
      "Power-of-attorney executed by Fareed Ahmed Ansari was irrevocable and likely intended to circumvent restrictions.",
      "Zohra Naveed Ansari lacked eligibility for lease under Land Grant Policy.",
      "Commissioner, Karachi failed to consider policy violations in granting lease."
    ],
    "orders": [
      "Lease granted to Zohra Naveed Ansari on 13-05-1975 vacated.",
      "Land to be disposed of afresh as per Land Grant Policy.",
      "Re-examination of other leased lands held by Fareed Ahmed Ansari directed."
    ]
  },
  "punishment": "Lease granted to Mrs. Zohra Naveed Ansari vacated; Commissioner directed to re-examine other land grants held by Mr. Fareed Ahmed Ansari.",
  "Decision_or_verdict": "Revision accepted; lease order vacated.",
  "legal_arguments": [
    "Appellant argued that Mr. Fareed Ahmed Ansari alienated leased land and executed irrevocable power-of-attorney in her favor.",
    "Respondent contended that the power-of-attorney was bona fide and unrelated to alienation of leased land."
  ],
  "assets": [
    "47-20 Acres of land in Deh Khar Kharo"
  ],
  "statutes": [
    "Land Revenue Act, 1967",
    "Notification Rs, KB-1/30/72/1413/3239, dated 27-03-1973"
  ],
  "sections": [
    "Section 163(4)",
    "Section 164(4)"
  ],
  "citations": [
    "P L D 1985 Rev. 199 [Sind]"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Lease Disputes",
    "Policy Violations"
  ],
  "key_issues": [
    "Improper lease grant to Mrs. Zohra Naveed Ansari",
    "Subletting of leased land by Mr. Fareed Ahmed Ansari",
    "Violation of Land Grant Policy",
    "Grant of lease of land in Deh Khar Kharo, Taluka Karachi",
    "Time-barred review petition rejected by Commissioner, Karachi"
  ],
  "maxims": {},
  "legal_terms": {
    "Lease": "A contractual agreement where one party grants another party the right to use property for a specified period.",
    "Power-of-Attorney": "A legal document authorizing one person to act on behalf of another."
  },
  "words_and_phrases": {
    "Suo Motu": "Action taken by a court on its own initiative.",
    "Alienation": "Transfer of property rights to another party."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around improper lease grant and subletting of land in violation of policy. The court vacated the lease and directed re-examination of other land grants held by the respondent."
}