{
  "case_title": "Khawaja GHULAM MUHAMMAD vs AZAD GOVERNMENT OF THE STATE OF JAMMU AND KASHMIR and others",
  "reference_no_or_id": "File No. 580/Service Tribunal of 7-11-1991",
  "judgment_date": "1994-06-01",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Raja Bashir Ahmad Khan",
    "Zaidullah Khan"
  ],
  "appellant": [
    "Khawaja GHULAM MUHAMMAD"
  ],
  "respondant": [
    "AZAD GOVERNMENT OF THE STATE OF JAMMU AND KASHMIR",
    "Raja Muhammad Hayat Khan"
  ],
  "accussed_details": [
    {
      "name": "Raja Muhammad Hayat Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Assistant Engineer",
      "allegation": [
        "Absence from duty for more than five years",
        "Violation of Leave Rules"
      ],
      "initial_appointment_date": "1973-06-27",
      "absence_period": "1978-03-23 to 1988-01-25",
      "absence_treatment": "Leave without pay",
      "notification_number": "SLG/DS/1903-1897/91",
      "notification_date": "1991-05-14"
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "The appellant challenged the Government's decision to treat the respondent's eight-year absence as leave without pay, alleging it violated Leave Rules and affected his seniority rights.",
  "investigation_summary": "The respondent claimed medical grounds for his absence and submitted medical certificates. The Government issued a notification treating the absence as leave without pay, citing extraordinary powers to relax service rules.",
  "judgment_summary": "The Tribunal upheld the Government's decision to treat the respondent's absence as leave without pay, citing its authority to relax service rules. The appeal was dismissed. The Tribunal also found that the respondent was never dismissed from service and the notification was validly issued.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "Appellant argued that absence exceeding five years violates Article 113 of KSR and Leave Rules.",
    "Respondent argued that the Government has the authority to relax service rules and his absence was justified on medical grounds."
  ],
  "assets": [],
  "statutes": [
    "Leave Rules of 1983",
    "Article 113 of KSR"
  ],
  "sections": [],
  "citations": [
    "1977 PLC (C.S.T.) page 190",
    "1995 P L C (C.S.) 699"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Service Law",
    "Leave Rules"
  ],
  "key_issues": [
    "Whether the absence of more than five years can be treated as leave without pay.",
    "Whether the Government's relaxation of service rules was lawful."
  ],
  "maxims": {},
  "legal_terms": {
    "Leave without pay": "A period of absence from duty without salary, subject to approval."
  },
  "words_and_phrases": {
    "Relaxation of rules": "The act of modifying or easing regulations under extraordinary circumstances."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the Government's decision to treat an eight-year absence of a civil servant as leave without pay, citing extraordinary powers to relax service rules. The appellant challenged this decision, claiming it violated Leave Rules and affected his seniority. The Tribunal dismissed the appeal, affirming the Government's authority to relax rules in equitable circumstances. The Tribunal also noted that the respondent was never dismissed from service and the notification was issued in accordance with the rules.",
  "key_points": {
    "respondent_service_details": {
      "name": "Raja Muhammad Hayat Khan",
      "initial_appointment_date": "1973-06-27",
      "absence_period": "1978-03-23 to 1988-01-25",
      "absence_treatment": "Leave without pay",
      "notification_number": "SLG/DS/1903-1897/91",
      "notification_date": "1991-05-14"
    },
    "appellant_claims": {
      "leave_rules_violation": "Absence period exceeds allowable leave without pay duration under Leave Rules.",
      "seniority_impact": "Appellant's seniority rights affected by respondent's reinstatement."
    },
    "respondent_defense": {
      "medical_leave": "Absence due to illness supported by medical certificates.",
      "government_relaxation": "Government exercised extraordinary powers to relax service rules."
    },
    "tribunal_findings": {
      "dismissal_status": "Respondent was never dismissed from service.",
      "government_authority": "Government had authority to relax service rules.",
      "notification_validity": "Notification issued in accordance with rules."
    }
  },
  "additional_notes": {
    "seniority_challenge": "Appellant may challenge seniority in a separate appeal.",
    "costs": "No order as to costs."
  }
}