{
  "case_title": "LIAQAT ALI vs ARSHAD MEHMOOD LODHI, ADVOCATE",
  "reference_no_or_id": "Complaint No,T/9 of 1994",
  "judgment_date": "1996-01-18",
  "first_hearing_date": "1994-09-20",
  "court": "Bar Council Tribunal",
  "bench_type": "Disciplinary Tribunal",
  "judges": [
    "Muhammad Alam"
  ],
  "appellant": [
    "Liaqat Ali"
  ],
  "respondant": [
    "Arshad Mehmood Lodhi, Advocate"
  ],
  "accussed_details": [
    {
      "name": "Arshad Mehmood Lodhi",
      "age": "N/A",
      "gender": "Male",
      "designation": "Advocate",
      "allegation": [
        "Professional misconduct",
        "Gross negligence in performance of duties"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Tahir Hussain Lughmani, Assistant Advocate-General"
    ],
    "defense": []
  },
  "complaint_summary": "Liaqat Ali alleged that Arshad Mehmood Lodhi, Advocate, failed to file complaints despite receiving Rs.10,300 as professional fees, returning only Rs.5,000 and withholding Rs.5,300. The complainant accused the respondent of professional misconduct under the Legal Practitioners and Bar Councils Act, 1973.",
  "investigation_summary": "The Disciplinary Committee of the N.-W.F.P. Bar Council recorded evidence and forwarded the case to the Tribunal. The respondent denied allegations, claiming he performed duties including drafting a divorce deed, visiting Rawalpindi, and sending registered post to the complainant's third wife. The complainant admitted to concealing facts about his third marriage.",
  "judgment_summary": "The Tribunal found no evidence of professional misconduct against the respondent but noted his actions were inconsistent with professional norms. The complaint was dismissed, and the respondent was warned to uphold professional ethics in the future.",
  "punishment": "Warning issued to the respondent to maintain professional ethics.",
  "Decision_or_verdict": "Complaint dismissed. Parties to bear their own costs.",
  "legal_arguments": [
    "Respondent argued he performed professional duties including drafting a divorce deed, visiting Rawalpindi, and sending registered post to complainant's third wife.",
    "Complainant alleged professional misconduct and negligence in filing complaints."
  ],
  "assets": [],
  "statutes": [
    "Legal Practitioners and Bar Councils Act, 1973"
  ],
  "sections": [
    "Code of Conduct for Advocates"
  ],
  "citations": [
    "1996 C L C 1562"
  ],
  "witnesses": [
    "Liaqat Ali (complainant)",
    "Arshad Mehmood Lodhi (respondent)"
  ],
  "witness_statement": {
    "Liaqat Ali": "Admitted to having three wives and strained relations. Alleged professional misconduct by respondent.",
    "Arshad Mehmood Lodhi": "Denied allegations, claimed duties were performed including drafting divorce deed, visiting Rawalpindi, and sending registered post."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Professional Misconduct",
    "Legal Ethics"
  ],
  "key_issues": [
    "Whether the respondent committed professional misconduct.",
    "Whether the complainant concealed material facts."
  ],
  "maxims": {
    "Nemo debet esse judex in propria causa": "No one should be a judge in their own cause."
  },
  "legal_terms": {
    "Professional Misconduct": "Violation of ethical standards by a legal practitioner.",
    "Code of Conduct": "Set of rules governing the behavior of advocates."
  },
  "words_and_phrases": {
    "Professional Fee": "Payment for legal services rendered.",
    "Registered A.D.": "Registered acknowledgment due, a postal service."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Complaint dismissed due to lack of evidence of professional misconduct. Respondent warned to uphold professional ethics. Parties bear their own costs.",
  "summary": {
    "complaint_details": {
      "filed_by": "Liaqat Ali",
      "allegations": "Professional misconduct and gross negligence under Legal Practitioners and Bar Councils Act, 1973.",
      "fee_paid": "Rs. 10,300",
      "fee_returned": "Rs. 5,000",
      "fee_withheld": "Rs. 5,300"
    },
    "respondent_defense": {
      "denial_of_allegations": "Respondent denied allegations and claimed professional duties were performed.",
      "actions_taken": "Visited Rawalpindi, drafted divorce deed, sent registered post to complainant's third wife."
    },
    "tribunal_findings": {
      "complainant_statement": "Admitted having three wives; dispute was matrimonial.",
      "respondent_conduct": "Not guilty of professional misconduct but warned to maintain professional ethics."
    }
  },
  "costs": "Parties to bear their own costs",
  "warnings": "Respondent warned to uphold dignity and ethics of legal profession."
}