{
  "case_title": "M/s. STANDARD CHARTERED BANK LIMITED vs MOHAMMAD ALTAF MADRASWALA and another",
  "reference_no_or_id": "Suit No. 163 of 2012",
  "judgment_date": "2019-04-29",
  "first_hearing_date": "2015-06-24",
  "court": "Banking Court",
  "bench_type": "Single Bench",
  "judges": [
    "Ms. Munawar Sultana"
  ],
  "appellant": [
    "M/s. STANDARD CHARTERED BANK LIMITED"
  ],
  "respondant": [
    "MOHAMMAD ALTAF MADRASWALA",
    "Another"
  ],
  "accussed_details": [
    {
      "name": "MOHAMMAD ALTAF MADRASWALA",
      "age": "N/A",
      "gender": "Male",
      "designation": "Customer",
      "allegation": [
        "Default in repayment of house finance loan",
        "Dispute over KIBOR-linked markup"
      ]
    },
    {
      "name": "Another",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Customer",
      "allegation": [
        "Default in repayment of house finance loan",
        "Dispute over KIBOR-linked markup"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The plaintiff filed a suit under Section 9 of the Financial Institutions (Recovery of Finances) Ordinance 2001 for recovery of Rs. 5,691,759.62 from the defendants, alleging default in repayment of house finance loan under Diminishing Musharaka agreement.",
  "investigation_summary": "Defendants contested the suit, raising legal and factual issues, including unauthorized filing of the plaint, dispute over KIBOR-linked markup, and alleged economic duress in agreement execution.",
  "judgment_summary": "The court allowed the application for leave to defend the suit unconditionally, framing issues for determination, including the applicability of KIBOR-linked markup under Islamic finance and the validity of the suit filed by an unauthorized person.",
  "punishment": "N/A",
  "Decision_or_verdict": "Application for leave to defend allowed unconditionally; issues framed for further determination.",
  "legal_arguments": [
    "Defendants argued that the suit was filed by an unauthorized person without proper authorization documents.",
    "Defendants contested the applicability of KIBOR-linked markup under Diminishing Musharaka agreement, citing State Bank of Pakistan Circular No. 01 of 2004.",
    "Defendants claimed economic duress in agreement execution, rendering it void under Section 83 of the Contract Act, 1872.",
    "Plaintiff argued that the defendants agreed to all terms and conditions, including KIBOR-linked markup, and defaulted on repayment obligations."
  ],
  "assets": [
    "Property financed under Diminishing Musharaka agreement"
  ],
  "statutes": [
    "Financial Institutions (Recovery of Finances) Ordinance 2001",
    "Contract Act, 1872",
    "State Bank of Pakistan Circular No. 01 of 2004"
  ],
  "sections": [
    "Section 9",
    "Section 10",
    "Section 83"
  ],
  "citations": [
    "1985 CLC 973",
    "PLD 1997 Karachi 62",
    "2015 CLD 845",
    "PLD Supreme Court 760",
    "PLD 2015 CLD 845",
    "PLD 1997 Supreme Court 315",
    "PLD 1999 Supreme Court 1026",
    "2001 YLR 1549",
    "PLD 1998 Supreme Court 1445",
    "PLD 2012 Supreme Court 553",
    "PLD 2000 Supreme Court 760",
    "2015 CLD 848",
    "2012 CLD 337"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "First Appeal No. 68 of 2015",
  "legal_categories": [
    "Banking Law",
    "Islamic Finance",
    "Contract Law"
  ],
  "key_issues": [
    "Validity of suit filed by unauthorized person",
    "Applicability of KIBOR-linked markup under Islamic finance",
    "Economic duress in agreement execution",
    "Default in repayment of house finance loan",
    "Defendants' rental payments and default status",
    "Liquidated damages dispute over 20% per annum claim"
  ],
  "maxims": {
    "Economic Duress": "An agreement executed under economic duress is void under Section 83 of the Contract Act, 1872."
  },
  "legal_terms": {
    "Diminishing Musharaka": "An Islamic finance agreement involving gradual reduction of ownership units.",
    "KIBOR": "Karachi Inter Bank Offered Rate, a benchmark interest rate."
  },
  "words_and_phrases": {
    "Economic Coercion": "Unlawful pressure exerted to compel agreement execution.",
    "Rental Sharing": "Distribution of rental value between parties based on ownership shares."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around a dispute over house finance loan repayment under Diminishing Musharaka agreement. Key issues include the validity of the suit filed by an unauthorized person, applicability of KIBOR-linked markup under Islamic finance, alleged economic duress in agreement execution, and rental payments made by defendants. The court allowed the application for leave to defend unconditionally, framing issues for further determination."
}