{
  "case_title": "Major MUHAMMAD ARIF through Abdur Rehman, Special Attorney vs Sardar BAHADUR KHAN and another",
  "reference_no_or_id": "Appeal No,T-21 of 1997",
  "judgment_date": "1998-04-24",
  "first_hearing_date": "1996-08-08",
  "court": "Bar Council Tribunal",
  "bench_type": "Disciplinary Committee",
  "judges": [
    "Mian Muhammad Ajmal",
    "Muhammad Alam Khan",
    "Muhammad Younus Tanoli"
  ],
  "appellant": [
    "Major Muhammad Arif through Abdur Rehman, Special Attorney"
  ],
  "respondant": [
    "Sardar Bahadur Khan",
    "Another (unspecified)"
  ],
  "accussed_details": [
    {
      "name": "Sardar Bahadur Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Advocate",
      "allegation": [
        "Professional misconduct",
        "Violation of Soldiers Litigation Act, 1925",
        "Violation of Legal Practitioners and Bar Councils Act, 1973"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Abdur Rehman (Special Attorney)"
    ],
    "defense": [
      "Sardar Bahadur Khan"
    ]
  },
  "complaint_summary": "Major Muhammad Arif alleged that Sardar Bahadur Khan, Advocate, violated provisions of Soldiers Litigation Act, 1925 and Legal Practitioners and Bar Councils Act, 1973 by directly corresponding with Army personnel without authorization.",
  "investigation_summary": "The Disciplinary Committee of the N.-W.F.P. Bar Council initiated proceedings. Evidence was presented by both parties, and the complaint was dismissed by majority view, with one dissenting opinion.",
  "judgment_summary": "The Tribunal found no professional misconduct by the respondent. It held that the respondent disclosed his identity as an advocate, acted on behalf of his client, and complied with Rule 173 of Legal Practitioners and Bar Councils Rules, 1976. No jural relationship existed between the complainant and respondent. The appeal was dismissed, and parties were to bear their own costs.",
  "punishment": "None",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "Appellant argued that respondent violated Soldiers Litigation Act, 1925 and Legal Practitioners and Bar Councils Act, 1973 by unauthorized correspondence. Only the Judge Family Court could verify the contents of the letter dated 16-5-1996.",
    "Respondent argued that his actions were authorized by his client, disclosed his identity as an advocate, and the letter became a public document. He acted diligently and committed no professional misconduct."
  ],
  "assets": [],
  "statutes": [
    "Soldiers Litigation Act, 1925",
    "Legal Practitioners and Bar Councils Act, 1973",
    "Legal Practitioners and Bar Councils Rules, 1976"
  ],
  "sections": [
    "Sections 6 and 7 of Soldiers Litigation Act, 1925",
    "Rule 173 of Legal Practitioners and Bar Councils Rules, 1976"
  ],
  "citations": [
    "1998 C L C 1875"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {
    "N/A": "N/A"
  },
  "appeal_number": "Appeal No,T-21 of 1997",
  "legal_categories": [
    "Professional misconduct",
    "Family law",
    "Advocacy ethics"
  ],
  "key_issues": [
    "Whether the respondent committed professional misconduct.",
    "Whether the respondent violated Soldiers Litigation Act, 1925 and Legal Practitioners and Bar Councils Act, 1973."
  ],
  "maxims": {
    "N/A": "N/A"
  },
  "legal_terms": {
    "Professional misconduct": "Violation of ethical standards by a legal professional.",
    "Public document": "A document that becomes accessible to the public once filed in court."
  },
  "words_and_phrases": {
    "Bereaved lady": "A woman suffering loss or hardship, in this case due to custody and maintenance issues."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around allegations of professional misconduct against Advocate Sardar Bahadur Khan for unauthorized correspondence with Army personnel. The Tribunal dismissed the appeal, finding no violation of ethical or legal provisions. The respondent acted diligently on behalf of his client, disclosed his identity as an advocate, and complied with Rule 173 of Legal Practitioners and Bar Councils Rules, 1976."
}