{
  "case_title": "Messrs Pakistan Gum and Chemicals Limited vs Additional Commissioner, ENF-III, PRA, Lahore",
  "reference_no_or_id": "Appeal No.38 of 2021",
  "judgment_date": "2022-11-24",
  "first_hearing_date": "N/A",
  "court": "Appellate Tribunal Punjab Revenue Authority",
  "bench_type": "Appellate",
  "judges": [
    "Ch. Muhammad Tariq Javed",
    "Ch. Javed Anwar"
  ],
  "appellant": [
    "Messrs Pakistan Gum and Chemicals Limited"
  ],
  "respondant": [
    "Additional Commissioner, ENF-III, PRA, Lahore"
  ],
  "accussed_details": [
    {
      "name": "Messrs Pakistan Gum and Chemicals Limited",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Manufacturing Company",
      "allegation": [
        "Failure to withhold and deposit due tax amounting to Rs.12,356,000/-",
        "Violation of Sections 14 and 19 of Punjab Sales Tax on Services Act, 2012",
        "Intent to evade tax"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Departmental Representative (D.R)"
    ],
    "defense": [
      "Authorized Representative (A.R)"
    ]
  },
  "complaint_summary": "The appellant was accused of failing to withhold and deposit sales tax on taxable services received during July 2017 to June 2018, amounting to Rs.12,356,000/-.",
  "investigation_summary": "The show-cause notice was issued based on audited financial statements. The appellant provided written replies and documents, but the Additional Commissioner partially accepted the stance and reduced the tax liability to Rs.403,595/- along with penalties.",
  "judgment_summary": "The Tribunal observed procedural lapses in the handling of the case by lower forums. The Commissioner (Appeals) failed to review relevant evidence provided by the appellant. The case was remanded to the Commissioner (Appeals) for a fresh decision with directions to ensure fairness and proper examination of all evidence.",
  "punishment": "N/A",
  "Decision_or_verdict": "Case remanded to Commissioner (Appeals) for fresh decision.",
  "legal_arguments": [
    "Appellant argued that the impugned order violated procedural rules and amounted to dual taxation.",
    "Respondent argued that sufficient opportunities were provided to the appellant to present evidence.",
    "Appellant contended that tax demand was raised on services beyond Punjab jurisdiction.",
    "Penalty under Section 48 was wrongly imposed.",
    "Violation of procedural rules under Punjab Sales Tax on Services (Adjudication and Appeals) Rules, 2012."
  ],
  "assets": [],
  "statutes": [
    "Punjab Sales Tax on Services Act, 2012",
    "Punjab Sales Tax on Services (Withholding) Rules, 2015",
    "Punjab Sales Tax on Services (Adjudication and Appeals) Rules, 2012",
    "Article 10-A of the Constitution of Pakistan"
  ],
  "sections": [
    "Section 14",
    "Section 19",
    "Section 52",
    "Section 70",
    "Section 48",
    "Section 49"
  ],
  "citations": [
    "2023 PTD (Trib.) 384"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Appeal No.38 of 2021",
  "legal_categories": [
    "Tax Law",
    "Procedural Fairness"
  ],
  "key_issues": [
    "Failure to withhold and deposit sales tax",
    "Procedural lapses in adjudication",
    "Dual taxation concerns",
    "Non-consideration of documentary evidence by Commissioner (Appeals)",
    "Assessment under Section 52 and recovery under Section 70",
    "Penalty under Section 48 and default surcharge under Section 49"
  ],
  "maxims": {
    "Article 10-A": "Right to fair trial and due process."
  },
  "legal_terms": {
    "Withholding Agent": "Entity responsible for deducting and depositing tax.",
    "Default Surcharge": "Penalty for late payment of tax."
  },
  "words_and_phrases": {
    "Trans provincial activities": "Operations extending beyond provincial boundaries.",
    "Speaking order": "A detailed and reasoned judicial decision."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Case involves procedural lapses in tax adjudication under Punjab Sales Tax on Services Act, 2012. Tribunal remanded the case for fresh decision ensuring fairness and proper evidence review.",
  "tribunal_observations": [
    "Fairness and ample opportunity are essential in litigation.",
    "Commissioner (Appeals) failed to consider relevant evidence.",
    "Tax assessment must be based on exactness, not presumptions.",
    "Show-cause notice included trans-provincial activities requiring further scrutiny."
  ],
  "directions": [
    "Case remanded to Commissioner (Appeals), PRA for fresh decision.",
    "Appellant to provide necessary documents/evidence.",
    "Authority to decide case based on available record if appellant fails to submit evidence.",
    "Registrar directed to communicate order to all concerned."
  ]
}