{
  "case_title": "Messrs AL-NOOR through Partner vs The PROVINCE OF SINDH through Chief Secretary Sindh and 8 others",
  "reference_no_or_id": "Suit No.1951 of 2018",
  "judgment_date": "2019-01-10",
  "first_hearing_date": "2018-09-17",
  "court": "Appellate Tribunal Sindh Revenue Board",
  "bench_type": "Single Bench",
  "judges": [
    "Muhammad Junaid Ghaffar"
  ],
  "appellant": [
    "Messrs AL-NOOR through Partner"
  ],
  "respondant": [
    "The PROVINCE OF SINDH through Chief Secretary Sindh",
    "Sindh Public Procurement Regulatory Authority (SPPRA)",
    "Karachi Development Authority (KDA)",
    "Defendants Nos.5 to 9 (Successful Bidders)"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": [
        "Favoritism in awarding tenders",
        "Violation of Sindh Public Procurement Act, 2009",
        "Manipulation of Engineer's Estimate",
        "Misinterpretation of Clause 11.3.4 of SPPRA Regulations",
        "Acceptance of bids in paisas instead of rupees"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Counsel for Plaintiff"
    ],
    "defense": [
      "Counsel for KDA",
      "Counsel for SPPRA",
      "Counsel for Successful Bidders"
    ]
  },
  "complaint_summary": "Plaintiff alleged favoritism and manipulation in awarding seven government tenders, claiming bids were fraudulently ignored despite compliance with submission requirements. They also argued that Clause 11.3.4 was misinterpreted and bids in paisas were improperly accepted.",
  "investigation_summary": "Plaintiff presented evidence of bid submission, including Pay Orders verified by the bank and attendance records. KDA failed to provide original minutes of proceedings and relied on an evaluation report prepared after the tenders were opened. The Engineer's Estimate appeared exaggerated, favoring specific bidders.",
  "judgment_summary": "The court found the tender process lacked transparency and was tainted with favoritism. It set aside the award of tenders, ordered re-advertisement with revised Engineer's Estimates, and ruled that bids quoted in paisas shall not be considered.",
  "punishment": "N/A",
  "Decision_or_verdict": "Application allowed; award of tenders set aside.",
  "legal_arguments": [
    "Plaintiff argued that bids were ignored despite compliance and presence during submission.",
    "Plaintiff's bids were equal to or less than 30% below the Engineer's Estimate.",
    "Defendants claimed Plaintiff did not submit bids and failed to approach the Grievance Redressal Committee.",
    "Court ruled that Plaintiff's evidence of Pay Orders and attendance sheet supported their claim of participation.",
    "Clause 11.3.4 was misapplied, and bids calculated up to 9 digits after decimal were deemed improper."
  ],
  "assets": [
    "Pay Orders submitted by Plaintiff"
  ],
  "statutes": [
    "Sindh Public Procurement Act, 2009",
    "Sindh Public Procurement Rules, 2010",
    "Clause 11.3.4 of SPPRA Regulations"
  ],
  "sections": [
    "Rule 2(d)",
    "Rule 2(f)",
    "Rule 41",
    "Rules 31 and 32"
  ],
  "citations": [
    "PLD 2006 Sindh 479",
    "2003 SCMR 370",
    "2007 SCMR 554",
    "2008 SCMR 1577",
    "2012 SCMR 1651",
    "PLD 2010 SC 731",
    "2012 SCMR 773",
    "Messrs Facto Belarus Tractors Limited Karachi v. Federation of Pakistan (PLD 2006 Sindh 479)",
    "Asaf Fasihuddin v. Government of Pakistan (2014 SCMR 676)",
    "GETZ Pharma (Pvt) Limited v. Province of Sindh (PLD 2016 Sindh 479)"
  ],
  "witnesses": [
    "Plaintiff's authorized representative"
  ],
  "witness_statement": {
    "Plaintiff's representative": "Confirmed presence during bid submission and recitation of Quran verses at the opening proceedings."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Public Procurement",
    "Administrative Law"
  ],
  "key_issues": [
    "Favoritism in tender awarding process",
    "Manipulation of Engineer's Estimate",
    "Violation of procurement rules",
    "Misinterpretation of Clause 11.3.4",
    "Acceptance of bids in paisas instead of rupees"
  ],
  "maxims": {
    "De minimis": "The law does not concern itself with trifles."
  },
  "legal_terms": {
    "Engineer’s Estimate": "A cost estimate prepared by the procuring agency for tender evaluation.",
    "Grievance Redressal Committee": "A body established under procurement rules to address complaints."
  },
  "words_and_phrases": {
    "Favoritism": "Unfair preference shown to certain bidders.",
    "Transparency": "Clear and open procedures in public procurement."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk",
    "reported_as": "PLD 2019 Sindh 400"
  },
  "summary_vector_notes": "The judgment highlights issues of favoritism, lack of transparency, and misinterpretation of procurement rules. It emphasizes the importance of realistic Engineer's Estimates, proper acknowledgment procedures, and rejecting bids quoted in paisas to ensure fairness."
}