{
  "case_title": "Mst. ZOHRA BEGUM vs MUHAMMAD NAWAZ SHAD, ADVOCATE, RAWALPINDI",
  "reference_no_or_id": "File No. 139 of 1998",
  "judgment_date": "1999-10-16",
  "first_hearing_date": "N/A",
  "court": "Bar Council Tribunal",
  "bench_type": "Coram 3",
  "judges": [
    "Tassaduq Hussain Jilani",
    "Mian Muhammad Ameen Kalanauri",
    "Rana Ikram Ullah Khan"
  ],
  "appellant": [
    "Mst. Zohra Begum"
  ],
  "respondant": [
    "Muhammad Nawaz Shad, Advocate, Rawalpindi"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Nawaz Shad",
      "age": "N/A",
      "gender": "Male",
      "designation": "Advocate",
      "allegation": [
        "Misconduct under Section 41 of the Legal Practitioners and Bar Council Act, 1973",
        "Violation of Rule 145 of the Legal Practitioners and Bar Council Rules, 1976",
        "Filed a civil suit challenging Mutation No. 6852 on behalf of third parties while complainant's suit was pending"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The complainant alleged that the respondent-Advocate filed a suit on her behalf regarding property evidenced in registered sale-deeds Nos. 2297 and 2296. However, instead of placing the mutation document provided by the complainant in the suit, he filed another suit challenging Mutation No. 6852 on behalf of third parties (Muhammad Pervaiz Khan and Rahim Dil Khan), thereby injuring her rights.",
  "investigation_summary": "The Tribunal reviewed the two civil suits, Mutation No. 6852, and submissions from both sides. It found that the respondent's defense of filing the second suit for unrelated property was unsubstantiated. Mutation No. 6852 was allowed by the Deputy Commissioner on 1997-05-23, substituting previous entries with the complainant's name.",
  "judgment_summary": "The Tribunal concluded that the respondent's conduct fell under the mischief of Section 41 of the Legal Practitioners and Bar Council Act, 1973, and Rule 145 of the Legal Practitioners and Bar Council Rules, 1976. Rule 156 cited by the respondent was deemed irrelevant. His license was suspended for six months, effective from 1999-10-16.",
  "punishment": "Suspension of license for six months",
  "Decision_or_verdict": "License suspended for six months",
  "legal_arguments": [
    "Respondent claimed the second suit pertained to different property.",
    "Tribunal found no evidence supporting this claim.",
    "Reference to Rule 156 was deemed irrelevant."
  ],
  "assets": [],
  "statutes": [
    "Legal Practitioners and Bar Council Act, 1973",
    "Legal Practitioners and Bar Council Rules, 1976"
  ],
  "sections": [
    "Section 41",
    "Rule 145"
  ],
  "citations": [
    "2000 M L D 744"
  ],
  "witnesses": [],
  "witness_statement": {
    "N/A": "N/A"
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Professional Misconduct"
  ],
  "key_issues": [
    "Misuse of client-provided documents",
    "Conflict of interest",
    "Violation of professional ethics"
  ],
  "maxims": {},
  "legal_terms": {
    "Mutation": "A change or transfer in property ownership recorded in revenue records."
  },
  "words_and_phrases": {
    "Vires": "Legal validity or authority."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves professional misconduct by an advocate who filed conflicting suits, injuring the complainant's rights. The Tribunal suspended his license for six months under Section 41 of the Legal Practitioners and Bar Council Act, 1973. Mutation No. 6852 was central to the dispute."
}