{
  "case_title": "Mst. SALLAN vs LAL AND Other",
  "reference_no_or_id": "Criminal Petition for Special Leave to Appeal No. 106-R of 1977 Cr. Misc No. 500-H of 1977",
  "judgment_date": "1978-11-12",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Two-Judge Bench",
  "judges": [
    "Muhammad Afzal Cheema",
    "Durab Patel"
  ],
  "author_judge": "Durab Patel",
  "appellant": [
    "Mst. SALLAN"
  ],
  "respondant": [
    "LAL",
    "Other"
  ],
  "detenu": "Mst. Manzooran Bibi",
  "accussed_details": [
    {
      "name": "Mst. SALLAN",
      "age": "N/A",
      "gender": "Female",
      "designation": "Paternal Aunt (claimed)",
      "allegation": [
        "Perjury",
        "Immoral use of detenu"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Saeedur Rehman"
    ],
    "defense": [
      "Mr. Wasim Sajjad"
    ]
  },
  "complaint_summary": "Petitioner filed a habeas corpus petition claiming to be the paternal aunt of the detenu, Mst. Manzooran Bibi, alleging her wrongful custody by respondents.",
  "investigation_summary": "The High Court dismissed the habeas corpus petition, citing perjury by the petitioner and allegations of immoral use of the detenu. The case lacked recorded evidence, including statements from the detenu.",
  "judgment_summary": "The Supreme Court allowed the appeal, remanded the case to the High Court for re-evaluation after recording evidence, and directed custody of the detenu to her father pending the High Court's decision.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal allowed; case remanded to High Court for fresh decision.",
  "key_points": {
    "petition_type": "Habeas corpus",
    "high_court_decision": "Dismissed habeas corpus petition, ordered prosecution of petitioner, and returned detenu to her father.",
    "supreme_court_decision": "Remanded the case to the High Court for evidence recording.",
    "custody_order": "Detenu to stay with her father pending High Court decision."
  },
  "legal_arguments": [
    "High Court erred in deciding habeas corpus petition without recording evidence.",
    "Reference to Muhammad Nazir v. The S.H.O., Police Station Shahpur and 3 others (1973 S C M R 351)."
  ],
  "assets": [],
  "statutes": [
    "1978 S C M R 83"
  ],
  "sections": [],
  "citations": [
    {
      "case_name": "Muhammad Nazir v. The S.H.O., Police Station Shahpur and 3 others",
      "citation": "1973 S C M R 351",
      "relevance": "High Court erred in deciding habeas corpus without recording detenu's evidence."
    }
  ],
  "witnesses": [],
  "witness_statement": {
    "detenu": "Not recorded during High Court proceedings."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Habeas Corpus",
    "Martial Law"
  ],
  "key_issues": [
    "Whether the petitioner is the paternal aunt of the detenu.",
    "Custody of the detenu.",
    "High Court's failure to record evidence."
  ],
  "facts": {
    "petitioner_claim": "Paternal aunt of detenu who brought her up after her marriage broke down.",
    "respondent_claim": "Petitioner filed habeas corpus for immoral purposes; detenu's father denies petitioner is her aunt.",
    "high_court_findings": "Petitioner committed perjury; relied on statements made in court without formal evidence.",
    "supreme_court_findings": "High Court erred by not recording evidence, including detenu's testimony."
  },
  "directions": {
    "remand_instructions": "High Court to decide after recording evidence on whether petitioner is detenu's aunt and other relevant questions.",
    "custody_directions": "Detenu to stay with her father pending High Court decision."
  },
  "maxims": {},
  "legal_terms": {
    "Habeas Corpus": "A legal action to determine the legality of someone's detention."
  },
  "words_and_phrases": {
    "Detenu": "A person detained or held in custody."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around a habeas corpus petition filed by Mst. Sallan claiming custody of Mst. Manzooran Bibi. The High Court dismissed the petition citing perjury and immoral intent, without recording evidence. The Supreme Court remanded the case for fresh evaluation, emphasizing the need for proper evidence recording and directed interim custody of the detenu to her father."
}