{
  "case_title": "MUHAMMAD ISMAIL GHORI vs MUHAMMAD ISMAIL",
  "reference_no_or_id": "Second Appeal No. 639 of 1967",
  "judgment_date": "1969-02-04",
  "first_hearing_date": "1966-12-02",
  "court": "Sindh High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Muhammad Afzal Cheema"
  ],
  "appellant": [
    "Muhammad Ismail Ghori"
  ],
  "respondant": [
    "Muhammad Ismail"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Ismail Ghori",
      "age": "N/A",
      "gender": "Male",
      "designation": "Tenant",
      "allegation": [
        "Default in payment of rent",
        "Bona fide personal requirement",
        "Impairing the value and utility of the building"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The respondent-landlord filed an application seeking the appellant's ejectment on grounds of rent default, bona fide personal requirement, and impairing the building's value and utility.",
  "investigation_summary": "Evidence established that the appellant constructed a residential building in Agra Taj Colony, Karachi, categorized as unauthorized but subject to potential regularization by Karachi Municipal Committee resolutions.",
  "judgment_summary": "The Sindh High Court set aside the Additional District Judge's order of eviction, ruling that the second proviso to section 13(3)(6) of the Rent Restriction Ordinance must be read subordinate to the main provisions of section 13(3)(a) and (b). The case was remanded to the Rent Controller for further proceedings.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal allowed; case remanded to Rent Controller for further proceedings.",
  "legal_arguments": [
    "Proviso must be subordinate to main provisions under section 13(3)(a) and (b).",
    "Ownership of unauthorized structure does not equate to ownership of residential building under the Ordinance.",
    "Tenant protection against arbitrary eviction must be upheld."
  ],
  "assets": [
    "Residential building No. A/viii-26-S-9 in Agra Taj Colony, Karachi"
  ],
  "statutes": [
    "West Pakistan Urban Rent Restriction Ordinance",
    "West Pakistan Urban Rent Restriction (Amendment) Act, 1963"
  ],
  "sections": [
    "Section 13(3)(6)",
    "Section 13(3)(a)",
    "Section 13(3)(b)"
  ],
  "citations": [
    "P L D 1969 Karachi 306",
    "P L D 1958 S C (Pak) 41"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Second Appeal No. 639 of 1967",
  "legal_categories": [
    "Landlord-Tenant Law",
    "Urban Rent Restriction"
  ],
  "key_issues": [
    "Interpretation of proviso under section 13(3)(6)",
    "Ownership definition of residential building",
    "Tenant protection against arbitrary eviction"
  ],
  "lower_court_decision": {
    "rent_controller": "Rejected application due to unauthorized construction not equating to ownership.",
    "additional_district_judge": "Reversed decision, deemed tenant as owner of residential building under the proviso."
  },
  "high_court_decision": {
    "interpretation": "Proviso must be read as subordinate to the main provision.",
    "requirement": "Bona fide personal requirement must be satisfied before determining ownership.",
    "outcome": "Appeal allowed, case remanded to Rent Controller for further proceedings."
  },
  "directions": {
    "remand_to": "Rent Controller",
    "instructions": "Proceed with the main application."
  },
  "costs": "No order as to costs",
  "maxims": {
    "Kent's Commentaries": "The sound interpretation and meaning of the statute must harmonize the enacting clause, saving clause, and proviso."
  },
  "legal_terms": {
    "Proviso": "A clause in a statute that creates an exception to the main provision.",
    "Summary Inquiry": "A legal process conducted without full procedural formalities."
  },
  "words_and_phrases": {
    "Unauthorized Construction": "A structure built without formal approval or compliance with regulations.",
    "Bona Fide Personal Requirement": "A genuine need for property use by the landlord."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around tenant eviction under the Urban Rent Restriction Ordinance. The Sindh High Court ruled that the second proviso to section 13(3)(6) must be subordinate to the main provisions, emphasizing tenant protection against arbitrary eviction. The case was remanded for further proceedings."
}