{
  "case_title": "MUHAMMAD IBRAHIM vs Mst. SURRAYA SULTANA",
  "reference_no_or_id": "Second Appeal from Order No. 589 of 1965",
  "judgment_date": "1966-02-07",
  "first_hearing_date": "N/A",
  "court": "West Pakistan",
  "bench_type": "Single Bench",
  "judges": [
    "Muhammad Afzal Cheema"
  ],
  "appellant": [
    "Muhammad Ibrahim"
  ],
  "respondant": [
    "Mst. Surraya Sultana"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "Mst. Surraya Sultana filed petitions under section 13 of the West Pakistan Urban Rent Restriction Ordinance of 1959 seeking ejectment of tenants occupying portions of her premises, citing intentions to demolish and reconstruct the building.",
  "investigation_summary": "The petitioner obtained necessary sanctions from the Municipal Corporation for reconstruction but failed to secure permission from the Rent Controller for converting the residential building into a non-residential one as required under section 11 of the Ordinance.",
  "judgment_summary": "The court dismissed the appeals, holding that contravention of section 11 of the Ordinance does not constitute a valid ground for resisting eviction under section 13. The court also found no merit in the appellants' arguments regarding discrepancies in site plans and allegations of default in rent payment.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "Contravention of section 11 does not invalidate eviction petitions under section 13.",
    "Site plan discrepancies were deemed inadmissible under section 63 of the Evidence Act.",
    "Default in rent payment was not sufficiently argued before the lower appellate authority."
  ],
  "assets": [],
  "statutes": [
    "West Pakistan Urban Rent Restriction Ordinance of 1959",
    "Section 11",
    "Section 13",
    "Section 19",
    "Evidence Act, Section 63"
  ],
  "sections": [
    "Section 11",
    "Section 13",
    "Section 19"
  ],
  "citations": [
    "P L D 1966 (W. P.) Lahore 406",
    "P L D 1960 Dacca 506",
    "P L D 1960 Dacca 535",
    "P L D 1965 Kar. 468",
    "P L D 1961 Dacca 34",
    "P L D 1957 Kar. 384",
    "P L D 1965 S C 690",
    "A I R 1946 P C 97"
  ],
  "witnesses": [
    {
      "name": "Inspector (summoned by appellants)",
      "role": "Witness for appellants"
    }
  ],
  "witness_statement": {
    "Inspector": "No objections were raised regarding the mode of proof of the site plan (Exh. P. 1)."
  },
  "appeal_number": "Second Appeal from Order No. 589 of 1965",
  "legal_categories": [
    "Urban Rent Restriction",
    "Eviction Law",
    "Property Law"
  ],
  "key_issues": [
    "Whether contravention of section 11 invalidates eviction petitions under section 13.",
    "Admissibility of site plan discrepancies under section 63 of the Evidence Act.",
    "Default in rent payment allegations."
  ],
  "key_findings": {
    "conversion_issue": "The contravention of section 11 does not constitute a valid ground for resisting eviction under section 13 of the Ordinance.",
    "default_issue": "No arguments were raised before the lower appellate authority regarding default in payment of rent.",
    "site_plan_issue": "The site plan (Exh. P. 1) was deemed admissible as it was a mechanically prepared copy ensuring accuracy."
  },
  "maxims": {
    "Interpretation of statutes": "Entire statute must be considered to reconcile provisions and avoid rendering any part insignificant."
  },
  "legal_terms": {
    "Non-residential building": "Defined under section 2(d) of the Ordinance as a building used solely for business or trade purposes.",
    "Residential building": "Defined under section 2(g) of the Ordinance as a building not classified as non-residential."
  },
  "words_and_phrases": {
    "May": "Indicates discretion granted to the Controller under section 13(2).",
    "Shall": "Indicates mandatory provisions within the Ordinance."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around eviction petitions filed by Mst. Surraya Sultana under section 13 of the West Pakistan Urban Rent Restriction Ordinance of 1959. The appeals were dismissed as contravention of section 11 was not deemed a valid ground for resisting eviction. Arguments regarding site plan discrepancies and rent payment defaults were also rejected.",
  "summary": "The appeals were dismissed as the contravention of section 11 of the West Pakistan Urban Rent Restriction Ordinance of 1959 does not provide a valid ground for resisting eviction under section 13. The court found no merit in the arguments regarding default in payment of rent or the admissibility of the site plan. The parties were directed to bear their own costs."
}