{
  "case_title": "MUHAMMAD RAZAQ vs PROVINCE OF BALUCHISTAN THROUGH SECRETARY HEALTH, QUETTA AND 6 OTHERS",
  "reference_no_or_id": "Constitutional Petition Nos. 52, 53, 54 of 1976",
  "case_number": "Constitutional Petitions Nos. 52, 53, and 54 of 1976",
  "judgment_date": "1976-05-28",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "court_name": "Balochistan High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Zaffar Hussain Mirza",
    "I. Mehmood"
  ],
  "appellant": [
    "Muhammad Razzaq",
    "Muhammad Safdar",
    "Lal Chand"
  ],
  "respondant": [
    "Province of Baluchistan through Secretary Health, Quetta",
    "Mohammad Rafiq",
    "Mohammad Asif Durrani",
    "Shafiqur Rehman"
  ],
  "respondents": [
    "Province of Baluchistan Through Secretary Health, Quetta",
    "Mohammad Rafiq",
    "Mohammad Asif Durrani",
    "Shafiqur Rehman"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mohammad Ahmed Mirza (Advocate-General)",
      "Azizullah Memon",
      "Munawar Ahmed"
    ],
    "defense": [
      "Basharatullah"
    ]
  },
  "complaint_summary": "Petitioners challenged the reallocation of seats for admission to Bolan Medical College, Quetta, alleging that the reduction of seats for Sibi District and the admission of respondents were unlawful.",
  "investigation_summary": "The High Powered Appellate Committee reviewed appeals against the petitioners' admissions and reallocated seats based on population figures from the 1972 Census. Respondents were admitted based on domicile certificates and higher marks.",
  "judgment_summary": "The court upheld the reallocation of seats by the Governor of Baluchistan and the decisions of the High Powered Appellate Committee. The petitioners' claims of vested rights to admission were dismissed, and the respondents' admissions were validated.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petitions dismissed.",
  "result": "Petitions dismissed with no order as to costs.",
  "legal_arguments": [
    "Petitioners argued that the reallocation of seats violated their vested rights.",
    "Respondents contended that the Governor had the authority to alter the admission policy.",
    "Court held that petitioners had no vested right to admission and validated the Appellate Committee's decisions."
  ],
  "summary": {
    "issue": "Challenge to the reallocation of seats and admissions to Bolan Medical College, Quetta for the academic session 1976-77.",
    "facts": [
      "Petitioners were initially selected by the Selection Committee for admission to Bolan Medical College.",
      "Governor of Baluchistan directed reallocation of seats based on population figures from the 1972 Census, reducing seats for Sibi District from 8 to 6.",
      "High Powered Appellate Committee granted admissions to respondents who scored higher marks than petitioners."
    ],
    "arguments": {
      "petitioners": [
        "Reallocation of seats was illegal.",
        "Admissions granted to respondents were invalid due to domicile issues.",
        "Petitioners had vested rights to admission after initial selection."
      ],
      "respondents": [
        "Reallocation was valid under the Governor's authority.",
        "Respondents scored higher marks and met domicile requirements."
      ]
    },
    "court_findings": [
      "Governor had the authority to alter admission policy as per rules in the prospectus.",
      "Petitioners did not acquire vested rights to admission merely by initial selection.",
      "Respondents' admissions were valid as they scored higher marks and met domicile requirements."
    ],
    "decision": "Petitions dismissed with no order as to costs."
  },
  "assets": [],
  "statutes": [
    "Admission Policy of Bolan Medical College",
    "Rules of the Prospectus"
  ],
  "sections": [],
  "citations": [
    "P L D 1976 Quetta 64",
    "P L D 1973 Kar. 332",
    "P L D 1965 Pesh. 47",
    "P L D 1969 S C 407",
    "P L D 1971 S C 252",
    "P L D 1965 Lah. 229",
    "P L D 1971 Lah. 641"
  ],
  "reported_as": "P L D 1976 Quetta 64",
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Constitutional Law",
    "Administrative Law",
    "Education Law"
  ],
  "key_issues": [
    "Validity of seat reallocation based on population figures.",
    "Authority of the Governor to alter admission policies.",
    "Nature of rights acquired by applicants selected by the Selection Committee."
  ],
  "maxims": {
    "N/A": "N/A"
  },
  "legal_terms": {
    "Vested Right": "A right that has been granted and cannot be taken away retroactively.",
    "Domicile Certificate": "A document proving permanent residence in a specific area."
  },
  "words_and_phrases": {
    "Selection Committee": "Body responsible for initial selection of candidates.",
    "Appellate Committee": "Body responsible for reviewing appeals against the Selection Committee's decisions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Petitioners challenged the reduction of seats allocated to Sibi District and the admission of respondents to Bolan Medical College. The court upheld the Governor's authority to alter admission policies and validated the decisions of the High Powered Appellate Committee. Petitioners' claims of vested rights were dismissed."
}