{
  "case_title": "Muhammad Roshan Essani, J Mushtaq Ali vs Government of Sindh through Chief Secretary, Sindh, New Sindh Secretariat, Karachi and 11 others",
  "reference_no_or_id": "Constitutional Petition No,D-1778 of 1997",
  "judgment_date": "1998-02-02",
  "first_hearing_date": "1997-09-25",
  "court": "Sindh High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Wajihuddin Ahmed"
  ],
  "appellant": [
    "Muhammad Roshan Essani",
    "J Mushtaq Ali"
  ],
  "respondant": [
    "Government of Sindh through Chief Secretary, Sindh",
    "New Sindh Secretariat, Karachi",
    "11 others"
  ],
  "accussed_details": [
    {
      "name": "Bolan Enterprises",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Octroi Contractor",
      "allegation": [
        "Illegal collection of sea dues",
        "Manipulation of contracts",
        "Causing loss of public revenue"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Muhammad Yasin Kiyani"
    ],
    "defense": [
      "Jhamat Jethanand"
    ]
  },
  "complaint_summary": "The petitioner, a freelance journalist, alleged illegal collection of octroi and sea dues by Bolan Enterprises at Port Qasim Authority (PQA), causing significant loss of public revenue and potential bankruptcy of Karachi Metropolitan Corporation (KMC). He sought relief to safeguard public revenue and ensure transparency in contract awarding.",
  "investigation_summary": "The court verified allegations of manipulation in awarding octroi contracts, including favoritism towards Bolan Enterprises and its sister concern Ziarat Enterprises. Losses of approximately Rs. 400 million were conceded by the Local Government Secretary. The court appointed an Official Assignee (OA) to supervise collections and plug revenue loopholes.",
  "judgment_summary": "The court found the contract awarded to Bolan Enterprises to be avoidable due to fraudulent clauses and manipulation. It directed continuation of supervised collection mechanisms, ordered inquiries into responsible officials, and mandated the deposit of illegally collected dues with the Nazir of the court for transfer to KMC.",
  "punishment": "Costs of Rs. 1,00,000 each imposed on Bolan Enterprises and KMC. Inquiry ordered against relevant officers, with reports due within two months.",
  "Decision_or_verdict": "Petition allowed with directives to safeguard public revenue, ensure accountability, and maintain supervised collection mechanisms.",
  "legal_arguments": [
    "Violation of Articles 18 and 38 of the Constitution of Pakistan regarding discouragement of monopolies and promotion of free competition.",
    "Fraudulent clauses in contracts enabling illegal collection of octroi.",
    "Public interest litigation principles allowing broader locus standi."
  ],
  "assets": [],
  "statutes": [
    "Octroi Rules, 1964",
    "Constitution of Pakistan, Articles 18 and 38",
    "Article 199 of the Constitution of Pakistan"
  ],
  "sections": [
    "Rule 46 of Octroi Rules, 1964"
  ],
  "citations": [
    "PLD 1998 Karachi 416",
    "Zahid Hussain v. Government of Sindh 1992 CLC 2396",
    "Hameedullah Khan v. Director, Customs Intelligence 1992 CLC 57",
    "Fazal Din v. Lahore Improvement Trust PLD 1969 SC 223",
    "Multilines Associates v. Ardeshir Cowasjee 1995 SCMR 362"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Public Interest Litigation",
    "Constitutional Law",
    "Revenue Collection"
  ],
  "key_issues": [
    "Illegal collection of sea dues by Bolan Enterprises",
    "Manipulation in awarding octroi contracts",
    "Loss of public revenue and lack of accountability",
    "Failure to extend Karachi Metropolitan Corporation (KMC) limits to include PQA"
  ],
  "maxims": {
    "Legal Maxim": "Fraud vitiates everything."
  },
  "legal_terms": {
    "Octroi": "A local tax collected on goods entering a municipal area."
  },
  "words_and_phrases": {
    "Sea Dues": "Revenue collected on goods transported via sea ports."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case highlights systemic corruption in revenue collection contracts, with significant loss to public funds due to favoritism and manipulation. The court intervened to ensure accountability, transparency, and protection of public interest through supervised mechanisms and inquiries.",
  "key_points": {
    "petition_filed_date": "1997-09-25",
    "petitioner_role": "Freelance journalist",
    "main_issue": "Illegal collection of octroi and sea dues by Bolan Enterprises at Port Qasim Authority (PQA).",
    "loss_estimation": "Approximate loss of Rs. 400 million to public revenue.",
    "contract_dispute": "Contract awarded to Bolan Enterprises through negotiation without proper auction.",
    "municipal_limits": "Failure to extend Karachi Metropolitan Corporation (KMC) limits to include PQA.",
    "court_actions": [
      "Appointment of Official Assignee (OA) as Commissioner.",
      "Supervision of collections and auction processes.",
      "Directed Bolan Enterprises to deposit Rs. 3,48,01,452 with the Nazir of the Court."
    ],
    "relief_granted": "Mechanism for collection continued till fiscal year-end; collections passed to KMC."
  },
  "observations": {
    "administrative_failures": "Lack of protective mechanisms for revenue collection.",
    "collusion": "Possible collusion between contractor and administrative officials.",
    "contract_irregularities": "Manipulations in contract terms favoring Bolan Enterprises and its sister concern Ziarat Enterprises."
  },
  "directions": {
    "inquiry": "Inquiry against relevant officers ordered by the Chief Secretary of Sindh.",
    "reports_due": [
      "Inquiry report within two months.",
      "Monthly reports on collections and operations."
    ],
    "action_by": [
      "Chief Ehtesab Commissioner",
      "Provincial Ombudsman"
    ]
  },
  "costs_awarded": {
    "contractor": "Rs. 1,00,000",
    "KMC": "Rs. 1,00,000"
  }
}