{
  "case_title": "MUNAWAR LAL. MUHAMMAD YAQOOB vs ZAHIR ALAM AND 10 OTHERS",
  "reference_no_or_id": "Constitutional Petition Nos. 35 and 36 of 1976",
  "judgment_date": "1976-05-28",
  "first_hearing_date": "1976-05-19",
  "court": "Balochistan High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Zaffar Hussain Mirza",
    "I. Mehmood"
  ],
  "appellant": [
    "Munawar Lal",
    "Muhammad Yaqoob"
  ],
  "respondant": [
    "Zahir Alam",
    "Sajan Das",
    "Ahmed Khan",
    "Rati-un Shah",
    "Abdul Sattar",
    "Muhammad Fazal"
  ],
  "accussed_details": [
    {
      "name": "Zahir Alam",
      "age": "N/A",
      "gender": "Male",
      "designation": "Student",
      "allegation": [
        "Not a bona fide resident of Kachhi District"
      ]
    },
    {
      "name": "Sajan Das",
      "age": "N/A",
      "gender": "Male",
      "designation": "Student",
      "allegation": [
        "Not a bona fide resident of Kachhi District"
      ]
    },
    {
      "name": "Ahmed Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Student",
      "allegation": [
        "Not a bona fide resident of Kachhi District"
      ]
    },
    {
      "name": "Rati-un Shah",
      "age": "N/A",
      "gender": "Male",
      "designation": "Student",
      "allegation": []
    },
    {
      "name": "Abdul Sattar",
      "age": "N/A",
      "gender": "Male",
      "designation": "Student",
      "allegation": [
        "Not a bona fide resident of Kachhi District"
      ]
    },
    {
      "name": "Muhammad Fazal",
      "age": "N/A",
      "gender": "Male",
      "designation": "Student",
      "allegation": [
        "Not a bona fide resident of Kachhi District"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Khalid Malik"
    ],
    "defense": [
      "Munawar Ahmed",
      "Muhammad Anwar",
      "Advocate-General, Baluchistan"
    ]
  },
  "complaint_summary": "Petitioners challenged the admission of respondents to reserved seats for boys of Kachhi District in Bolan Medical College, alleging respondents were not bona fide residents of the district.",
  "investigation_summary": "The Selection Committee selected ten candidates based on merit for reserved seats. Petitioners alleged that respondents were not bona fide residents and presented evidence, including residence certificates and domicile records, to support their claims.",
  "judgment_summary": "The court dismissed both petitions, holding that the High Powered Committee acted within its administrative capacity and its decisions were final. The court found no jurisdictional defect or evidence of arbitrariness in the Committee's decision.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "Petitioners argued respondents were not bona fide residents of Kachhi District.",
    "Defense argued respondents had valid residence certificates and met merit criteria.",
    "Court held that administrative decisions of the High Powered Committee were final and not subject to judicial review unless jurisdictional defects were evident."
  ],
  "assets": [],
  "statutes": [
    "Article 199 of the Constitution of Pakistan"
  ],
  "sections": [],
  "citations": [
    "P L D 1976 Quetta 77",
    "P L D 1972 Kar. 563",
    "P L D 1959 S C (Pak.) 272",
    "P L D 1970 S C 173",
    "P L D 1971 S C 252",
    "P L D 1974 S C 139"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Constitutional Law",
    "Administrative Law",
    "Education Law"
  ],
  "key_issues": [
    "Validity of residence certificates for reserved seats",
    "Scope of judicial review in administrative decisions",
    "Merit-based selection criteria"
  ],
  "maxims": {
    "Quasi-judicial": "Administrative decisions involving application of law to facts without judicial procedures."
  },
  "legal_terms": {
    "Judicial Review": "Court's authority to review administrative decisions for jurisdictional defects."
  },
  "words_and_phrases": {
    "Bona fide resident": "A genuine resident of a specified district."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved constitutional petitions challenging admissions to reserved seats in Bolan Medical College. Petitioners alleged respondents were not bona fide residents of Kachhi District. The court upheld the administrative decisions of the High Powered Committee, emphasizing its finality and limited scope of judicial review.",
  "facts": {
    "issue": "Admission to the first year M.B.B.S. class in Bolan Medical College, Quetta, for reserved seats allocated for boys of Kachhi District for the academic session 1976-77.",
    "policy": "10 seats reserved for boys of Kachhi District as per admission policy announced by the Government of Baluchistan on 1976-02-05.",
    "selection_process": "Selection by the Selection Committee headed by the Secretary, Health Department, with appeals to the High Powered Committee headed by the Additional Chief Secretary."
  },
  "petitioners_arguments": {
    "main_contention": "Respondents were not bona fide residents of Kachhi District and thus ineligible for reserved seats.",
    "specific_allegations": {
      "respondent_1": "Residence certificate canceled by Deputy Commissioner, Kachhi.",
      "respondent_2": "No valid residence certificate issued; certified as non-resident by District Magistrate.",
      "respondent_3": "Permanent resident of Mastung Kalat District.",
      "respondent_4": "Conceded as bona fide resident of Kachhi District.",
      "respondent_5": "Receiving scholarship from District Kalat.",
      "respondent_6": "Receiving scholarship from District Quetta."
    },
    "procedural_flaw": "High Powered Committee did not provide reasons for rejecting the petitioner's evidence."
  },
  "respondents_arguments": {
    "respondent_1": "Produced valid residence certificate and secured highest marks among candidates.",
    "respondent_2": "Residence certificate issued by District Magistrate, Kachhi, was valid.",
    "respondent_3": "Produced revenue records and local certificate proving residence in Kachhi District.",
    "general_argument": "High Powered Committee considered all evidence and found respondents to be bona fide residents."
  },
  "court_findings": {
    "jurisdiction": "High Powered Committee acted in an administrative capacity, not judicial or quasi-judicial.",
    "merit": "Petitioner failed to qualify on merit as his marks were below the cutoff.",
    "residency": "Sufficient evidence supported respondents' residency claims.",
    "procedural_review": "Administrative orders are not required to be speaking orders like judicial decisions."
  },
  "legal_principles": {
    "judicial_review": "Court's power of judicial review does not extend to re-evaluating factual findings of administrative bodies unless findings are perverse or unsupported by evidence.",
    "administrative_orders": "Administrative decisions are not subject to the same requirements as judicial or quasi-judicial orders."
  },
  "decision": {
    "petition_35": "Dismissed.",
    "petition_36": "Dismissed.",
    "costs": "No orders as to costs."
  }
}