{
  "case_title": "NOOR MUHAMMAD vs MUHAMMAD ASHRAF And 7 OTHER",
  "reference_no_or_id": "Review No.36 of 1988",
  "judgment_date": "1990-03-21",
  "first_hearing_date": "1988-02-09",
  "court": "Board of Revenue",
  "bench_type": "Single Bench",
  "judges": [
    "Asad Ali Shah"
  ],
  "appellant": [
    "Noor Muhammad"
  ],
  "respondant": [
    "Muhammad Ashraf",
    "7 Others"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Ashraf",
      "age": "N/A",
      "gender": "Male",
      "designation": "Heir of Hafiz Muhammad Khan",
      "allegation": [
        "Unauthorized possession of Lambardari grant land"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Noor Muhammad contested the decision allowing Muhammad Ashraf and others to retain temporary possession of Lambardari grant land on lease, arguing they were not in occupation and already owned substantial land.",
  "investigation_summary": "The court reviewed prior orders and government policy, confirming that Muhammad Ashraf and others were allowed temporary possession on market rent with an undertaking to surrender the land if required for public purposes.",
  "judgment_summary": "The court clarified that Muhammad Ashraf and others were not granted lessee rights but were allowed temporary possession on a year-to-year basis. The arrangement would cease upon government policy changes regarding Lambardari grants.",
  "punishment": "N/A",
  "Decision_or_verdict": "Application disposed of with clarification that Muhammad Ashraf and others have no permanent rights to the land.",
  "legal_arguments": [
    "Noor Muhammad argued that Muhammad Ashraf and others were not in occupation of the land.",
    "The court emphasized that the arrangement was temporary and subject to government policy changes."
  ],
  "assets": [
    "400 Kanals of land owned by Muhammad Ashraf and others"
  ],
  "statutes": [
    "Government Policy on Lambardari grants"
  ],
  "sections": [
    "N/A"
  ],
  "citations": [
    "1990 C L C 1929"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "R.O.R. No.1277/1987",
  "legal_categories": [
    "Land Disputes",
    "Temporary Lease Agreements"
  ],
  "key_issues": [
    "Temporary possession of Lambardari grant land",
    "Government policy on Lambardari allotments"
  ],
  "maxims": {},
  "legal_terms": {
    "Lambardari": "A traditional system of land management in Pakistan involving village headmen."
  },
  "words_and_phrases": {
    "Temporary lease": "A short-term arrangement allowing possession of land on specific conditions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk",
    "printed_on": "2025-07-15",
    "printed_by": "Areesha Kaleem"
  },
  "summary_vector_notes": "The case revolves around the temporary possession of Lambardari grant land by Muhammad Ashraf and others, contested by Noor Muhammad. The court upheld the temporary arrangement under government policy, clarifying no permanent rights were granted.",
  "summary": {
    "application_type": "Review of orders",
    "previous_case_reference": "R.O.R. No.1277/1987 (Muhammad Ashraf etc. v. State etc.)",
    "key_decision": "Muhammad Ashraf etc., heirs of Hafiz Muhammad Khan, had no right to purchase Lambardari grant in Chak No.48/DNB. Noor Muhammad also could not be allotted the grant due to suspension of allotment scheme.",
    "temporary_arrangement": "Muhammad Ashraf etc. allowed temporary lease on year-to-year basis with market rent, subject to surrendering possession if required for public purposes.",
    "applicant_objection": "Noor Muhammad contested that Muhammad Ashraf etc. were not in occupation of the land and had been unfairly allowed lease despite owning other land.",
    "clarification": "Muhammad Ashraf etc. are neither regular lessees nor have rights under temporary cultivation schemes. Their occupation is temporary and subject to government policy changes."
  },
  "disposition": {
    "clarification": "If Muhammad Ashraf etc. are no longer in possession, the impugned order does not apply. If they are in possession, they must pay market rent and surrender possession upon government directive.",
    "final_order": "Application disposed of with clarification."
  }
}