{
  "case_title": "OMEGA SPORTS AND RADIO WORKS vs COMMISSIONER OF INCOME-TAX",
  "reference_no_or_id": "I. T. R. No. 54 of 1972, Income-tax Reference No. 119 of 1976",
  "judgment_date": "1981-11-18",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "C. S. P. Singh",
    "R. R. Rastogi"
  ],
  "appellant": [
    "OMEGA SPORTS AND RADIO WORKS"
  ],
  "respondant": [
    "COMMISSIONER OF INCOME-TAX"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The case concerns a dispute over the assessment of income tax for the financial year ending March 31, 1969, following a change in the constitution of the appellant firm on August 20, 1968.",
  "investigation_summary": "The Income Tax Officer (I.T.O.) made a single assessment for the entire financial year, allocating income between two periods based on the firm's constitution. The appellant sought separate assessments for the two periods under Section 154 of the Income Tax Act, claiming a mistake in the original assessment. The I.T.O. rejected the application on May 11, 1973, but the Appellate Assistant Commissioner (A.A.C.) directed separate assessments. The Appellate Tribunal later held that Section 154 could not be invoked due to the issue being debatable.",
  "judgment_summary": "The court held that the Appellate Tribunal erred in concluding that Section 154 could not be invoked due to the issue being debatable. It ruled in favor of the assessee, stating that the I.T. authorities in Uttar Pradesh are bound by the Allahabad High Court's decisions, even if other High Courts have differing views. Costs of Rs. 250 were awarded to the assessee.",
  "punishment": "N/A",
  "Decision_or_verdict": "Question answered in the negative; in favor of the assessee and against the department.",
  "legal_arguments": [
    "The assessee argued that a mistake apparent on the face of the record occurred due to the single assessment for two distinct periods.",
    "The department contended that the issue was debatable, citing differing views of other High Courts, and thus Section 154 could not be invoked."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Act, 1961"
  ],
  "sections": [
    "Section 154",
    "Section 184(7)",
    "Section 185(1)(a)",
    "Section 256(1)"
  ],
  "citations": [
    "Dahi Laxmi Dal Factory v. I.T.O. (1976) 103 ITR 517",
    "C.I.T. v. Vindeshwari Trading Corporation (1978) 113 ITR 791",
    "Addl. C.I.T. v. Visakha Flour Mills (1977) 108 ITR 166 (Andhra Pradesh)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Income Tax",
    "Taxation Law"
  ],
  "key_issues": [
    "Whether separate assessments should be framed for two periods following a change in the firm's constitution.",
    "Whether Section 154 of the Income Tax Act can be invoked for rectification of the assessment."
  ],
  "maxims": {},
  "legal_terms": {
    "Section 154": "Provision for rectification of mistakes apparent on the face of the record.",
    "Section 184(7)": "Renewal of registration for a firm.",
    "Section 185(1)(a)": "Fresh registration of a firm."
  },
  "words_and_phrases": {
    "Mistake apparent on the face of the record": "An error that is obvious and does not require elaborate argument or investigation to establish."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the rectification of income tax assessments for a firm following a change in its constitution. The Allahabad High Court ruled in favor of the assessee, emphasizing that decisions of the High Court are binding within its jurisdiction, even if other High Courts hold differing views.",
  "facts": {
    "assessee": "Messrs. Omega Sports and Radio Works, Gorakhpur",
    "firm_details": "Registered firm of three partners",
    "change_in_constitution": "Two partners retired on August 19, 1968; surviving partners formed a new partnership with another individual on August 20, 1968",
    "assessment_year": "1969",
    "previous_year_end": "1969-03-31",
    "returns_filed": "Two returns filed for two periods",
    "initial_assessment": "Single assessment made for the entire year",
    "registrations": {
      "first_period": "Renewal of registration under section 184(7)",
      "second_period": "Fresh registration under section 185(1)(a)"
    },
    "application_under_section_154": "Filed to request separate assessments for two periods",
    "I_T_O_decision": "Rejected application on May 11, 1973",
    "A_A_C_decision": "Directed separate assessments for two periods",
    "Appellate_Tribunal_decision": "Held section 154 could not be invoked due to debatable nature of the issue"
  },
  "precedents": {
    "binding_decision": "Dahi Laxmi Dal Factory v. I. T. O. (1976) 103 ITR 517",
    "contrary_decision": "Addl. C. I. T. v. Visakha Flour Mills (1977) 108 ITR 166 (Andhra Pradesh High Court)",
    "other_reference": "C. I. T. v. Vindeshwari Trading Corporation (1978) 113 ITR 791"
  },
  "costs_awarded": "Rs. 250",
  "reported_as": "1983 P T D 148"
}