{
  "case_title": "PULAVARTHI VISWANADHAM vs COMMISSIONER OF INCOME-TAX, ANDHRA PRADESH",
  "reference_no_or_id": "Case Referred Nos. 13 and 14 of 1961",
  "judgment_date": "1964-09-19",
  "first_hearing_date": "N/A",
  "court": "Andhra Pradesh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Chandrasekhara Sastry",
    "P. Chandra Reddy"
  ],
  "appellant": [
    "Pulavarthi Viswanadham"
  ],
  "respondant": [
    "Commissioner of Income-Tax, Andhra Pradesh"
  ],
  "accussed_details": [
    {
      "name": "Pulavarthi Viswanadham",
      "age": "N/A",
      "gender": "Male",
      "designation": "Individual Assessee",
      "allegation": [
        "Non-disclosure of income from money-lending and other business activities",
        "Failure to disclose one-fourth share of income from Messrs J. V. Subba Rao and B. Satyanarayana Murthy, Guntur"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Sri Rajeswara Rao"
    ],
    "defense": []
  },
  "complaint_summary": "The Income-tax Department alleged that Pulavarthi Viswanadham failed to disclose his one-fourth share of income from a partnership firm and indulged in undisclosed money-lending activities.",
  "investigation_summary": "The Income-tax Officer reopened the assessment under Section 34(1)(a) of the Indian Income-tax Act, 1922, after discovering non-disclosure of income. The reassessment included the previously excluded share income.",
  "judgment_summary": "The court ruled that once an assessment is reopened under Section 34(1)(a), the Income-tax Officer can reassess all items of income, including those not disclosed by the assessee. The court upheld the Department's action and dismissed the assessee's objections.",
  "punishment": "The assessee was ordered to pay the costs of the Department in R.C. No. 14 of 1961. Advocate's fee: Rs. 100.",
  "Decision_or_verdict": "In favor of the Department and against the assessee.",
  "legal_arguments": [
    "The assessee argued that Section 34(1)(b) barred reassessment of the income item as the notice was issued after the statutory period.",
    "The Department contended that Section 34(1)(a) allowed reassessment of all income items once reopened."
  ],
  "assets": [],
  "statutes": [
    "Indian Income-tax Act, 1922"
  ],
  "sections": [
    "Section 34(1)(a)",
    "Section 34(1)(b)",
    "Section 22(2)"
  ],
  "citations": [
    "1964 P T D 72",
    "Parimisetti Seetharamamma v. Commissioner of Income-tax ((1963) 50 I T R 450)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Tax Law",
    "Income Tax Assessment"
  ],
  "key_issues": [
    "Validity of reopening assessment under Section 34(1)(a)",
    "Scope of reassessment under Section 34(1)(a)"
  ],
  "maxims": {},
  "legal_terms": {
    "Reassessment": "The process of re-evaluating an individual's income for tax purposes.",
    "Non-disclosure": "Failure to reveal all relevant income or material facts."
  },
  "words_and_phrases": {
    "Escaped Assessment": "Income that was not assessed due to non-disclosure or omission.",
    "Revised Assessment": "An updated evaluation of taxable income after reopening the case."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves the reassessment of undisclosed income under Section 34(1)(a) of the Indian Income-tax Act, 1922. The court upheld the Department's authority to reassess all income items once the assessment is reopened, dismissing the assessee's objections.",
  "case_number": "Case Referred Nos. 13 and 14 of 1961",
  "court_name": "Andhra Pradesh High Court",
  "result": "In favor of the Department and against the assessee",
  "advocate_fee": "Rs. 100",
  "primary_question": "Whether on the facts and circumstances of the case the share income from the Guntur firm could be included in the assessment validly reopened under section 34(1)(a) of the Indian Income-tax Act, 1922?",
  "assessment_years": {
    "R.C. No. 14 of 1961": "1945-46",
    "R.C. No. 13 of 1961": "Year ended March 31, 1948"
  },
  "facts": {
    "assessee": "Individual claiming to be a partner in Messrs J. V. Subba Rao and B. Satyanarayana Murthy, Guntur",
    "income_exclusion": "One-fourth share of income excluded by Income-tax Officer under impression it belonged to estate of late J. V. Subba Rao",
    "tribunal_decision": "Income-tax Appellate Tribunal held share income belonged to assessee",
    "reopening_reason": "Non-disclosure of extensive money-lending and business activities"
  },
  "legal_findings": {
    "reopening_assessment": "Income-tax Officer entitled to issue notice under section 34(1)(a) for reassessment",
    "scope_of_reassessment": "Once reopened, assessment proceeds de novo under relevant sections of the Act",
    "total_income_disclosure": "Assessee is obligated to disclose total income under section 22(2)"
  },
  "costs": {
    "payable_by": "Assessee",
    "amount": "Rs. 100"
  }
}