{
  "case_title": "PWD Employees' Union, Balochistan through Vice-President and others vs Secretary, Communication and Works Department, Government of Balochistan Quetta and others",
  "reference_no_or_id": "Constitutional Petition No. 370 of 2010, Contempt Application No. 34 of 2010 in C.P. No. 370 of 2010, C.Ps. Nos. 357, 379, 402 of 2011, 117, 844, 912 of 2012, 448, 502, 662, 962 of 2013 and 89 of 2014",
  "judgment_date": "2014-11-10",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Two Judge Bench",
  "judges": [
    "Muhammad Hashim Khan Kakar",
    "Ghulam Mustafa Mengal"
  ],
  "appellant": [
    "PWD Employees' Union, Balochistan through Vice-President and others"
  ],
  "respondant": [
    "Secretary, Communication and Works Department, Government of Balochistan Quetta and others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Nazim-ud-Din, Advocate-General"
    ],
    "defense": [
      "Muhammad Riaz Ahmed",
      "Mujeeb Ahmed Hashmi",
      "Abdul Majeed Kakar",
      "Manzoor Ahmed Rehmani",
      "Bashir Ahmed Qazi",
      "Syed Zareef Shah",
      "Ali Hassan Bugti",
      "Saeed Ahmed Lango"
    ]
  },
  "complaint_summary": "The petitioners challenged the constitutionality of Rule 12 and 12-A of the Balochistan Civil Servants (Appointment, Promotion and Transfer) Rules, 2009, which provided preferential employment rights to widows and children of deceased or retired government servants.",
  "investigation_summary": "The court reviewed legislative history, including the Balochistan Civil Servants Act, 1974 and its subsequent amendments, and examined whether Rule 12 violated constitutional provisions such as Articles 25 and 27.",
  "judgment_summary": {
    "notification_examined": "Notification No. S.O.(R-I)5(13)S&GAD-2013/2057-2156 dated 31st July, 2013",
    "rule_12_analysis": "Rule 12 was found discriminatory and ultra vires to Articles 2A, 3, 4, 9, 18, 25, and 27 of the Constitution.",
    "constitutional_violation": "Rule 12 infringes fundamental rights and violates principles of merit and equality.",
    "judicial_review": "Court exercised judicial review under Article 199 of the Constitution to test the constitutionality of Rule 12.",
    "recommendation": "Provincial Government advised to eliminate discriminatory provisions and reservation of seats in government institutions."
  },
  "punishment": "N/A",
  "Decision_or_verdict": "Petitions dismissed; Rule 12 declared unconstitutional.",
  "legal_arguments": [
    "Petitioners argued Rule 12 was beneficial legislation and did not violate constitutional provisions.",
    "Respondents argued Rule 12 violated Articles 25 and 27 of the Constitution by creating a privileged class and undermining merit-based appointments."
  ],
  "assets": [],
  "statutes": [
    "Balochistan Civil Servants Act, 1974"
  ],
  "sections": [
    "Section 25 of the Balochistan Civil Servants Act, 1974"
  ],
  "citations": [
    "2015 P L C (C.S.) 1182",
    "PLD 1974 SC 31",
    "PLD 1997 SC 11",
    "PLD 2000 Lahore 509",
    "PLD 1990 Peshawar 51",
    "PLD 2010 SC 265"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Constitutional Law",
    "Employment Law"
  ],
  "key_issues": [
    "Whether Rule 12 of the Balochistan Civil Servants (Appointment, Promotion and Transfer) Rules, 2009 violates Articles 25 and 27 of the Constitution.",
    "Whether Rule 12 conflicts with the parent statute, the Balochistan Civil Servants Act, 1974.",
    "Whether Rule 12 is unreasonable or uncertain.",
    "Jurisdiction of the court to strike down Rule 12."
  ],
  "maxims": {
    "Equality before law": "All persons similarly situated must be treated alike."
  },
  "legal_terms": {
    "Judicial Review": "The power of courts to assess the constitutionality of legislative and executive actions."
  },
  "words_and_phrases": {
    "Intelligible differentia": "A logical and clear distinction that justifies classification."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The judgment examined the constitutionality of Rule 12 and 12-A of the Balochistan Civil Servants Rules, 2009, concluding that they violated fundamental rights under the Constitution by creating discriminatory classifications. The petitions were dismissed, and the rules were declared unconstitutional.",
  "dismissed_petitions": [
    "Constitutional Petitions Nos. 370 of 2010, 357 of 2011, 117, 844, and 912 of 2012, 448, 502, 662, and 962 of 2013, and (S) 89 of 2014",
    "Constitutional Petitions Nos. 379 and 402 of 2011 dismissed for non-prosecution",
    "Contempt Application No. 34 of 2010 dismissed as not pressed"
  ]
}