{
  "case_title": "RAJ MOHAN SAHA AND OTHERS vs COMMISSIONER OF INCOME-TAX, ASSAM",
  "reference_no_or_id": "Income-tax Reference No. 5 of 1961",
  "case_number": "Income-tax Reference No. 5 of 1961",
  "judgment_date": "1962-07-24",
  "first_hearing_date": "N/A",
  "court": "Assam High Court",
  "court_name": "Assam High Court",
  "bench_type": "Division Bench",
  "judges": [
    "S. K. Dutta",
    "M. P. Mehrotra"
  ],
  "appellant": [
    "Raj Mohan Saha and Others"
  ],
  "respondant": [
    "Commissioner of Income-Tax, Assam"
  ],
  "accussed_details": [
    {
      "name": "Raj Mohan Saha",
      "age": "N/A",
      "gender": "Male",
      "designation": "Managing Partner",
      "allegation": [
        "Undisclosed income of Rs. 20,000 for assessment years 1954-55 and 1955-56",
        "Carrying on undisclosed business with a turnover of Rs. 4 lakhs"
      ]
    }
  ],
  "firm_details": {
    "type": "Registered firm",
    "partners_count": 7,
    "major_partner": "Sri Raj Mohan Saha",
    "major_partner_share": "0-7-6 pies",
    "head_office": "Agartala",
    "purchase_centre": "26-A, Raja Rajendra Narain Street, Burrabazar, Calcutta",
    "business": "Seeds, oils, rice, dal, and miscellaneous goods"
  },
  "lawyers": {
    "prosecution": [
      "Mr. Choudhury"
    ],
    "defense": []
  },
  "complaint_summary": "The Income-tax Officer alleged that the assessee firm failed to account for remittances sent from Agartala to Calcutta, suggesting undisclosed income and business activities.",
  "investigation_summary": "The Income-tax Officer conducted investigations, examined witnesses under Section 37 of the Indian Income-tax Act, and relied on postal records. The explanation provided by the managing partner was rejected, and Rs. 20,000 was added to the firm's income for each assessment year. The Tribunal later remanded the case, but the Income-tax Officer maintained the earlier order.",
  "judgment_summary": {
    "key_findings": [
      "No material evidence to support Rs. 4 lakhs turnover or 5% profit estimation.",
      "Addition of Rs. 20,000 as undisclosed income not justified."
    ],
    "costs_awarded": "Rs. 100 to assessee"
  },
  "punishment": "N/A",
  "Decision_or_verdict": "Question answered in the negative; no material evidence to support the addition of Rs. 20,000 as undisclosed income.",
  "result": "Question answered in the negative",
  "reported_as": "1964 PTD 681",
  "legal_arguments": {
    "assessee_contentions": [
      "No material evidence for remittances from Agartala to Calcutta.",
      "No evidence of undisclosed business turnover of Rs. 4 lakhs.",
      "No evidence of 5% profit on turnover.",
      "Violation of natural justice as postal records were not shown."
    ],
    "department_contentions": [
      "No question of law arises from Tribunal's order.",
      "Findings based on materials and cannot be challenged."
    ]
  },
  "assets": [],
  "statutes": [
    "Indian Income-tax Act, Section 23(3)",
    "Indian Income-tax Act, Section 37"
  ],
  "sections": [
    "Section 23(3)",
    "Section 37"
  ],
  "citations": [
    "Dhakeswari Cotton Mills Ltd. v. Commissioner of Income-tax (1954) 26 ITR 775",
    "Sree Meenakshi Mills Ltd. v. Commissioner of Income-tax (1957) 31 ITR 28",
    "Oriental Investment Co. Ltd. v. Commissioner of Income-tax (1957) 32 ITR 664",
    "Narayandas Kedarnath v. Commissioner of Income-tax (1952) 22 ITR 18",
    "Commissioner of Income-tax v. Scindia Steam Navigation Co. Ltd. (AIR 1961 SC 1633)"
  ],
  "witnesses": [
    "Sukhan Lal Poddar",
    "Makhan Lal Saha",
    "Benode Behari Saha"
  ],
  "witness_statement": {
    "Sukhan Lal Poddar": "Employee at Agartala gaddi; alleged to have remitted money.",
    "Makhan Lal Saha": "Employee at Agartala gaddi; alleged to have remitted money.",
    "Benode Behari Saha": "Manager at Burrabazar, Calcutta; recipient of remittances."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Income Tax",
    "Undisclosed Income",
    "Natural Justice"
  ],
  "key_issues": [
    "Whether there was material evidence to support the addition of Rs. 20,000 as undisclosed income.",
    "Violation of principles of natural justice in investigation.",
    "Inference of Rs. 4 lakhs turnover and 5% profit without evidence."
  ],
  "key_question": "Whether, on the facts and in the circumstances of the case, there was any material before the Tribunal to hold that the sum of Rs. 20,000 represented the undisclosed income of the assessee firm for each of the assessment years 1954-55 and 1955-56?",
  "maxims": {
    "Natural Justice": "Audi alteram partem - No one should be condemned unheard."
  },
  "legal_terms": {
    "Undisclosed Income": "Income not reported in official accounts or tax filings.",
    "Turnover": "Total revenue generated by a business."
  },
  "legal_principles": {
    "assessment_standard": "Income-tax Officer cannot act on pure guess; must have evidence beyond suspicion.",
    "review_standard": [
      "Questions of law can be referred under section 66(1).",
      "Findings of fact can be challenged if unsupported by evidence or perverse."
    ]
  },
  "words_and_phrases": {
    "Remittances": "Transfers of money from one location to another.",
    "Undisclosed Business": "Business activities not reported or accounted for officially."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around allegations of undisclosed income and business activities by the assessee firm. The court found insufficient evidence to support the Income-tax Authorities' conclusions, emphasizing the importance of material evidence and adherence to principles of natural justice."
}