{
  "case_title": "SAEED MUHAMMAD KHAN vs UNIVERSITY OF BALUCHISTAN AND 4 OTHERS",
  "reference_no_or_id": "Appeal No, 20 of 1977",
  "judgment_date": "1978-02-05",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Tribunal",
  "judges": [
    "Fakhruddin H. Shaikh",
    "Malik Abdus Samad",
    "Malik Habibullah Khan"
  ],
  "appellant": [
    "Saeed Muhammad Khan"
  ],
  "respondant": [
    "University of Baluchistan",
    "4 Others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Jamil Khan Sherwani"
    ],
    "defense": [
      "Mohammad Raisani"
    ]
  },
  "complaint_summary": "The appellant challenged the preliminary objection that a University employee is not a civil servant, arguing that the appeal is maintainable under the Baluchistan Civil Services Tribunal Act.",
  "investigation_summary": "The Tribunal reviewed the Baluchistan University Ordinance, 1972 and relevant statutes, concluding that University employees fall under the definition of civil servants.",
  "judgment_summary": "The Tribunal ruled that University employees are civil servants as defined under section 2(a) of the Baluchistan Civil Services Tribunal Act. The preliminary objection was overruled, and the Tribunal asserted jurisdiction to entertain the appeal.",
  "judgment_excerpt": "Heard Mr. Jamil Khan Sherwani for the appellant and Mohammad Raisani, for the respondents on the preliminary objection that a University Employee is not a civil servant and as such the appeal is not maintainable. Subsection (3) of section 3 of the Baluchistan University Ordinance, 1972 provides that the University shall be a body corporate. Such body has been held by the Supreme Court in P L D 1965 S C 90 as statutory body constituted by the Government in connection with the affairs of the Province. This would naturally imply that an employee of the University is engaged in connection with the affairs of the Province. He will therefore fall within the definition of a 'civil servant' as provided in section 2(a) of the Baluchistan Civil Services Tribunal Act. The Tribunal has jurisdiction to entertain appeals in respect of all matters relating to terms and conditions of service of civil servants of the Province under section 3 of the Baluchistan Civil Servants Act. We are therefore of the view that this Tribunal has jurisdiction to entertain this appeal as it has been filed by a civil servant. The preliminary objection is therefore disallowed.",
  "punishment": "N/A",
  "Decision_or_verdict": "Objection overruled; Tribunal has jurisdiction to entertain the appeal.",
  "legal_arguments": [
    "Subsection (3) of section 3 of the Baluchistan University Ordinance, 1972 establishes the University as a statutory body.",
    "Supreme Court precedent (P L D 1965 S C 90) confirms that such bodies are constituted by the Government in connection with provincial affairs.",
    "Section 2(a) of the Baluchistan Civil Services Tribunal Act defines civil servants to include employees engaged in provincial affairs."
  ],
  "assets": [],
  "statutes": [
    "Baluchistan University Ordinance, 1972",
    "Baluchistan Civil Services Tribunal Act",
    "Baluchistan Civil Servants Act"
  ],
  "sections": [
    "Section 3(3) of Baluchistan University Ordinance, 1972",
    "Section 2(a) of Baluchistan Civil Services Tribunal Act",
    "Section 3 of Baluchistan Civil Servants Act"
  ],
  "citations": [
    "1978 P L C (C. S. T.) 55",
    "P L D 1965 S C 90"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "20 of 1977",
  "legal_categories": [
    "Civil Service",
    "Administrative Law"
  ],
  "key_issues": [
    "Whether a University employee qualifies as a civil servant under the Baluchistan Civil Services Tribunal Act.",
    "Jurisdiction of the Tribunal to entertain appeals from University employees."
  ],
  "maxims": {},
  "legal_terms": {
    "civil servant": "An individual engaged in connection with the affairs of the Province as defined under section 2(a) of the Baluchistan Civil Services Tribunal Act."
  },
  "words_and_phrases": {
    "body corporate": "An entity established by law with legal rights and obligations."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the jurisdiction of the Tribunal to entertain appeals from University employees, with the ruling affirming their status as civil servants under applicable statutes."
}