{
  "case_title": "Sardar REHMATULLAH KHAN vs AZAD GOVERNMENT OF THE STATE OF JAMMU AND KASHMIR through its Chief Secretary",
  "reference_no_or_id": "Service Appeal No,344 of 1986",
  "judgment_date": "1987-05-10",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Muhammad Siddique Farooqi",
    "Chaudhry Karam Dad Khan"
  ],
  "appellant": [
    "Sardar REHMATULLAH KHAN"
  ],
  "respondant": [
    "Azad Government of the State of Jammu and Kashmir through its Chief Secretary"
  ],
  "accussed_details": [
    {
      "name": "Sardar REHMATULLAH KHAN",
      "age": "N/A",
      "gender": "Male",
      "designation": "Secretary to the Government",
      "allegation": [
        "Misappropriation of foodgrain in the Food Department",
        "Failure to prevent embezzlement under his administrative control"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Additional Advocate-General"
    ],
    "defense": [
      "Khawaja Muhammad Saeed"
    ]
  },
  "complaint_summary": "The appellant was retired from service under Section 12(ii) of the Civil Servants Act, 1976 without being charge-sheeted or given an opportunity to defend himself. He alleged mala fide action and violation of Islamic injunctions.",
  "investigation_summary": "Reports from the Chief Secretary and Inspection Team exonerated the appellant from involvement in misappropriation cases. However, the retirement decision was influenced by external factors and motivated complaints.",
  "judgment_summary": "The tribunal found the retirement order to be a colorable exercise of power and without jurisdiction. The appellant was reinstated with back benefits and deemed retired upon reaching the age of superannuation.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal accepted; retirement order quashed; appellant reinstated with back benefits.",
  "legal_arguments": [
    "Provisions of Section 12(ii) of Civil Servants Act, 1976 are violative of Islamic injunctions.",
    "Retirement was unjustified given the appellant's meritorious service record.",
    "Mala fide allegations must be proven.",
    "Government's discretion under Section 12(ii) does not require show-cause notice or inquiry."
  ],
  "assets": [],
  "statutes": [
    "Civil Servants Act, 1976"
  ],
  "sections": [
    "Section 12(ii) of Civil Servants Act, 1976"
  ],
  "citations": [
    "1988 P L C (C.S.) 40",
    "P L D 1974 S C 151",
    "P L D 1986 S C (A J & K) 87",
    "1984 P L C 360",
    "1986 S C M R 2000",
    "P L D 1973 S C 49",
    "Raja Muhammad Niaz Khan v. Azad Jammu & Kashmir Government",
    "Muhammad Akramullah v. Secretary Establishment Division, 1984 P L C 360",
    "Federation of Pakistan v. Saeed Ahmad Khan, P L D 1974 S C 151",
    "Ghous Muhammad Shah v. Province of Punjab, 1984 P L C 1539",
    "Federation of Pakistan v. Nazir Ahmad Swati, 1986 S C M R 2001"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "344 of 1986",
  "legal_categories": [
    "Service Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Validity of retirement under Section 12(ii) of Civil Servants Act, 1976",
    "Mala fide action by the appointing authority",
    "Violation of Islamic injunctions"
  ],
  "key_findings": [
    "Appellant was retired without being charge-sheeted or given an opportunity to defend himself.",
    "Reports from the Chief Secretary and Inspection Team exonerated the appellant from allegations of misappropriation.",
    "Retirement was deemed a colorable exercise of power influenced by external factors and not based on service record.",
    "Appellant's service record was largely unblemished, with positive assessments from senior officials."
  ],
  "maxims": {},
  "legal_terms": {
    "mala fide": "Bad faith or intent to deceive",
    "colorable exercise of power": "Use of authority in a deceptive or improper manner"
  },
  "words_and_phrases": {
    "retirement simplicitor": "Retirement without any formal charges or inquiry",
    "public interest": "Action taken for the welfare or benefit of the public"
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the premature retirement of Sardar Rehmatullah Khan under Section 12(ii) of the Civil Servants Act, 1976. The tribunal found the retirement order unjustified and influenced by external factors, despite the appellant's exoneration in official reports. The appellant was reinstated with back benefits.",
  "legal_basis": {
    "challenged_law": "Section 12(ii) of the Civil Servants Act, 1976",
    "issues_raised": [
      "Violation of Islamic injunctions",
      "Unjustified retirement despite meritorious service",
      "Mala fide or colorable exercise of power"
    ]
  },
  "decision": {
    "action_taken": "Order of retirement and Review Petition rejected by the Government are set aside.",
    "outcome": "Appellant reinstated with back benefits and deemed retired upon reaching the age of superannuation."
  }
}