{
  "case_title": "Secretary Establishment Division, Government of Pakistan, Islamabad vs Aftab Ahmed Manika and others Rao Manzar Hayat and others",
  "reference_no_or_id": "(1) CIVIL PETITION NO. 41 OF 2015 (2) CIVIL PETITION NO. 66 OF 2015",
  "case_number": {
    "civil_petition_1": "41 of 2015",
    "civil_petition_2": "66 of 2015"
  },
  "judgment_date": "2018-03-21",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Three-Judge Bench",
  "judges": [
    "Nasir-ul-Mulk",
    "Mushir Alam",
    "Gulzar Ahmed"
  ],
  "appellant": [
    "Secretary Establishment Division, Government of Pakistan, Islamabad"
  ],
  "respondant": [
    "Aftab Ahmed Manika",
    "Rao Manzar Hayat",
    "Others"
  ],
  "respondents": [
    "Aftab Ahmed Manika and others",
    "Rao Manzar Hayat and others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Attorney General for Pakistan"
    ],
    "defense": [
      "Ms. Asma Jahangir"
    ]
  },
  "complaint_summary": "Civil servants serving in BPS-20 were recommended for promotion to BPS-21 by the Central Selection Board. The Prime Minister returned the recommendations for reconsideration, citing concerns over integrity and reputation.",
  "investigation_summary": "Reports from ISI and IB were presented to the Prime Minister, suggesting concerns about the integrity of certain candidates. These reports were not available to the Central Selection Board during its deliberations.",
  "judgment_summary": "The Supreme Court allowed the appeal, setting aside the judgments of the Islamabad and Lahore High Courts. It directed the Central Selection Board to re-examine the cases of the respondents independently and finalize recommendations within 30 days.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal allowed; High Court judgments set aside.",
  "result": "Appeal allowed",
  "reported_as": "2018 SCP 1155",
  "legal_arguments": [
    "Article 212 of the Constitution excludes High Court jurisdiction in service matters.",
    "Section 9(3) of the Civil Servants Act, 1973 establishes the Central Selection Board as a recommendatory body.",
    "Reports from intelligence agencies were disputed as material for promotion decisions.",
    "The Prime Minister's discretion to return recommendations was upheld."
  ],
  "assets": [],
  "statutes": [
    "Civil Servants Act, 1973",
    "Service Tribunal Act, 1973",
    "Constitution of Pakistan, Article 212"
  ],
  "sections": [
    "Section 9(3) of Civil Servants Act, 1973",
    "Rule 7 of Civil Servants (Appointment, Promotion and Transfer) Rules, 1973"
  ],
  "citations": [
    "PLD 2014 SC 232",
    "2014 SCMR 817",
    "PLD 1981 SC 531",
    "PLD 2012 SC 1067",
    "1991 SCMR 1041"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Administrative Law",
    "Civil Service Law"
  ],
  "key_issues": [
    "Jurisdiction of High Courts under Article 212",
    "Discretionary powers of the Prime Minister in promotion matters",
    "Role of intelligence reports in civil servant promotions"
  ],
  "maxims": {
    "N/A": "N/A"
  },
  "legal_terms": {
    "recommendation": "Advisory suggestion not binding on the appointing authority."
  },
  "words_and_phrases": {
    "integrity": "General reputation and perception of honesty."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the discretionary powers of the Prime Minister in civil servant promotions and the jurisdiction of High Courts under Article 212 of the Constitution. The Supreme Court upheld the Prime Minister's authority to return recommendations for reconsideration, emphasizing the need for independent assessment by the Central Selection Board.",
  "summary": {
    "issue": "Promotion of civil servants from BPS-20 to BPS-21",
    "key_points": [
      "Recommendations of the Central Selection Board (CSB) returned by the Prime Minister for reconsideration.",
      "Jurisdiction of High Courts questioned under Article 212 of the Constitution.",
      "High Courts allowed writ petitions, citing discrimination and procedural flaws.",
      "Supreme Court overturned High Court judgments, stating Prime Minister's actions were not arbitrary or discriminatory."
    ]
  },
  "legal_references": {
    "constitution_articles": [
      "Article 212"
    ],
    "civil_servants_act": "Section 9",
    "rules": "Civil Servants (Appointment, Promotion and Transfer) Rules, 1973",
    "case_law": [
      "Safaraz Saleem v. The Federation of Pakistan (PLD 2014 SC 232)",
      "Orya Maqbool Abbasi v. Federation of Pakistan (2014 SCMR 817)",
      "Islamic Republic of Pakistan v. Israrul Haq (PLD 1981 SC 531)",
      "I.A. Sharwani v. Government of Pakistan (1991 SCMR 1041)"
    ]
  },
  "instructions_to_board": {
    "reconsideration_period": "30 days",
    "finalization_period": "15 days after recommendations"
  },
  "key_findings": {
    "prime_minister_powers": "Discretionary powers to return recommendations for reconsideration.",
    "high_court_jurisdiction": "High Courts can assume jurisdiction in absence of functional Service Tribunal.",
    "discrimination": "No evidence of arbitrary or discriminatory actions by the Prime Minister."
  }
}