{
  "case_title": "Seth HUSSAIN BHA vs MUHAMMAD IQBAL AND 2 others",
  "reference_no_or_id": "Civil Revision No. 14 of 1972",
  "judgment_date": "1975-12-11",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Dorab Patel"
  ],
  "appellant": [
    "Seth HUSSAIN BHA"
  ],
  "respondant": [
    "MUHAMMAD IQBAL",
    "2 others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Basharatullah"
    ],
    "defense": [
      "Mr. Muhammad Nawaz"
    ]
  },
  "complaint_summary": "The appellant entered into a partnership with the respondents to run a kerosene agency in Chaman under a partnership deed dated July 3, 1955. The appellant alleged mismanagement by the respondents, leading to the cancellation of the agency in 1960. He demanded accounts and filed a suit for dissolution of the firm and settlement of accounts.",
  "investigation_summary": "The appellant audited the firm's accounts through his employee and chartered accountants, but the respondents contested the findings. The trial court ruled in favor of the appellant, but the District Court reversed the decision, dismissing the suit.",
  "judgment_summary": "The High Court upheld the District Court's decision, finding that the partnership was formed for a single venture (Chaman agency) and was automatically dissolved upon the termination of the agency. The suit for accounts was deemed not maintainable as the applicant had access to all account books and knew his claim. The suit was also barred by limitation under Article 106 of the Limitation Act.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision application dismissed with costs.",
  "legal_arguments": [
    "The appellant argued the partnership was a general partnership and not limited to the Chaman agency.",
    "The appellant contended the suit for accounts was maintainable despite possession of account books.",
    "The respondents argued the partnership was for a single venture and dissolved automatically upon the agency's cancellation.",
    "The respondents claimed the suit was time-barred under the Limitation Act."
  ],
  "assets": [
    "Firm's account books"
  ],
  "statutes": [
    "Partnership Act, 1932",
    "Limitation Act"
  ],
  "sections": [
    "Section 8 of the Partnership Act, 1932",
    "Section 42 of the Partnership Act, 1932",
    "Article 106 of the Limitation Act"
  ],
  "citations": [
    "P L D 1976 Quetta 9",
    "P L D 1959 S C (Pak.) 319"
  ],
  "witnesses": [
    "Mr. Qureshi (auditor)"
  ],
  "witness_statement": {
    "Mr. Qureshi": "Audited the firm's accounts as an employee of the appellant."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Partnership Law",
    "Limitation Law"
  ],
  "key_issues": [
    "Maintainability of suit for accounts",
    "Nature of partnership (partnership-at-will vs. partnership for a single venture)",
    "Limitation under Article 106 of the Limitation Act"
  ],
  "maxims": {
    "Ex hypothesi": "A partnership confined to a particular class of adventures ends automatically with the termination of those adventures."
  },
  "legal_terms": {
    "Partnership-at-will": "A partnership that continues as long as the partners desire.",
    "Particular partnership": "A partnership formed for a specific venture or undertaking."
  },
  "words_and_phrases": {
    "Adventures": "A pecuniary risk, venture, or commercial enterprise.",
    "Undertakings": "Enterprise or management."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the dissolution of a partnership formed for a specific venture. The appellant's claim for accounts was dismissed as time-barred, and the court emphasized the automatic dissolution of the partnership upon the termination of the venture.",
  "facts": {
    "partnership_deed_date": "1955-07-03",
    "business_purpose": "Agency for kerosene in Chaman from Standard Vacuum Oil Company",
    "agency_cancellation_year": "1960",
    "suit_filing_date": "1965-11",
    "appellant_claim": "Dissolution of partnership and settlement of accounts"
  },
  "trial_court_decision": {
    "finding": "Partnership was a partnership-at-will",
    "result": "Suit decreed in favor of the applicant"
  },
  "district_court_decision": {
    "finding": "Partnership was for a single venture; suit barred by limitation",
    "result": "Suit dismissed"
  },
  "high_court_decision": {
    "finding": [
      "Applicant had access to all account books and knew his claim",
      "Partnership was for a single venture (Chaman agency)",
      "Suit barred under Article 106 of the Limitation Act"
    ],
    "result": "Revision dismissed with costs"
  },
  "reported_as": "P L D 1976 Quetta 9"
}