{
  "case_title": "SHAH FAISAL and another vs STATE",
  "reference_no_or_id": "Crl. Appeal No, 297 of 2005 & Crl. Appeal No, 318 of 2005",
  "judgment_date": "2009-05-18",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Full Bench",
  "judges": [
    "Akhter Zaman Malghani",
    "Ahmed Khan Lashari",
    "Muhammad Musir Khan"
  ],
  "appellant": [
    "Shah Faisal",
    "Another (Name not specified)"
  ],
  "respondant": [
    "State"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": [
        "N/A"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Special Prosecutor (Name not specified)"
    ],
    "defense": [
      "Counsel for appellants (Name not specified)"
    ]
  },
  "complaint_summary": "The appellants challenged the admissibility of the Chemical Examiner's report from the Forensic Science Laboratory Balochistan under the Control of Narcotic Substances Act, 1997.",
  "investigation_summary": "The investigation involved the submission of reports by the Forensic Science Laboratory Balochistan, which were contested for their admissibility under Sections 34, 35, and 36 of the Control of Narcotic Substances Act, 1997.",
  "judgment_summary": "The court resolved the issue of admissibility of Chemical Examiner's reports furnished by the Forensic Science Laboratory Balochistan. It held that the Federal Government had notified Provincial Narcotics Testing Laboratories as Federal Narcotics Testing Laboratories under Section 34 of the Control of Narcotic Substances Act, 1997. Reports submitted by Chemical Examiners notified under Section 510 Cr.P.C. are admissible as evidence under Sections 34 and 35 of the Act, 1997. The court found no conflict between Section 510 Cr.P.C. and provisions of the Act, 1997.",
  "punishment": "N/A",
  "Decision_or_verdict": "Order accordingly; appeals to be fixed before Division Bench for regular hearing.",
  "legal_arguments": [
    "Appellants argued that no Federal Narcotics Testing Laboratory was established or notified, making the reports inadmissible under Sections 34, 35, and 36 of the Control of Narcotic Substances Act, 1997.",
    "Prosecution argued that Provincial Testing Laboratories were declared Federal Narcotics Testing Laboratories under SRO No. 596(1)/97, making their reports admissible."
  ],
  "assets": [],
  "statutes": [
    "Control of Narcotic Substances Act, 1997"
  ],
  "sections": [
    "Section 34",
    "Section 35",
    "Section 36",
    "Section 47",
    "Section 510 Cr.P.C",
    "Section 103 Cr.P.C"
  ],
  "citations": [
    "PLJ 2010 Cr.C. (Quetta) 122",
    "2001 P.Cr.L.J 879"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Crl. Appeal No, 297 of 2005 & Crl. Appeal No, 318 of 2005",
  "legal_categories": [
    "Narcotics Control",
    "Evidence Admissibility"
  ],
  "key_issues": [
    "Admissibility of Chemical Examiner's report under Control of Narcotic Substances Act, 1997",
    "Notification of Provincial Laboratories as Federal Narcotics Testing Laboratories",
    "Applicability of Section 510 Cr.P.C. to reports of Chemical Examiners"
  ],
  "maxims": {
    "Repeal by implication": "Later enactments worded in affirmative terms do not repeal earlier laws unless expressly stated."
  },
  "legal_terms": {
    "Federal Narcotics Testing Laboratory": "A laboratory notified by the Federal Government under Section 34 of the Control of Narcotic Substances Act, 1997.",
    "Government Analyst": "An expert notified under Section 35 of the Control of Narcotic Substances Act, 1997."
  },
  "words_and_phrases": {
    "Admissible Evidence": "Evidence that is allowed to be presented in court under statutory provisions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the admissibility of reports from the Forensic Science Laboratory Balochistan under the Control of Narcotic Substances Act, 1997. The court upheld the validity of these reports, citing proper notification under Section 34 and compliance with Sections 35 and 510 Cr.P.C.",
  "key_notifications": [
    "S.R.O 596(1)/97"
  ],
  "directions": "The appeals are to be fixed before the Division Bench for regular hearing."
}