{
  "case_title": "SRI VENKATESWARA LODGE vs COMMISSIONER OF INCOME-TAX, HYDERABAD, AND OTHERS",
  "reference_no_or_id": "Writ Petition No. 646 of 1966",
  "judgment_date": "1968-03-25",
  "first_hearing_date": "1966-01-05",
  "court": "Andhra Pradesh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Basi Reddy",
    "Sambasiva Rao"
  ],
  "appellant": [
    "Sri Venkateswara Lodge"
  ],
  "respondant": [
    "Commissioner of Income-Tax, Hyderabad",
    "Income-Tax Officer, A-1 'A' Ward, Hyderabad",
    "Income-Tax Officer, Income-Tax-cum-Wealth Tax Circle II, Hyderabad"
  ],
  "accussed_details": [
    {
      "name": "A. Ramaswamy",
      "age": "30",
      "gender": "Male",
      "designation": "Partner, Sri Venkateswara Lodge",
      "allegation": [
        "Tax evasion",
        "Possession of undisclosed income or property"
      ]
    },
    {
      "name": "K. Ramamurty",
      "age": "N/A",
      "gender": "Male",
      "designation": "Partner, Sri Venkateswara Lodge",
      "allegation": [
        "Tax evasion",
        "Possession of undisclosed income or property"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Ananta Bablu"
    ],
    "defense": [
      "Kodanda Ramayya"
    ]
  },
  "complaint_summary": "The petitioners challenged the legality of a search and seizure conducted by Income-Tax Officers at Sri Venkateswara Lodge under Section 132 of the Income-Tax Act, 1961. They alleged abuse of power, mala fide actions, and procedural violations.",
  "investigation_summary": "On January 5, 1966, Income-Tax Officers searched the premises of Sri Venkateswara Lodge, its branches, and a residential property. The search, authorized by the Commissioner of Income-Tax, Hyderabad, was based on credible information about suspected tax evasion. Items seized included account books, documents, slips, cash, and jewelry.",
  "judgment_summary": "The court dismissed the writ petition, holding that the search and seizure were conducted in compliance with Section 132 of the Income-Tax Act and Rule 112 of the Income-Tax Rules. The Commissioner had recorded valid reasons for issuing the warrant, and the officers acted within the scope of their authority. The court also upheld the constitutionality of Section 132.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "Petitioners argued that the search violated Articles 14 and 19 of the Constitution.",
    "Petitioners claimed the search warrant lacked specificity and the seizure was excessive.",
    "Respondents argued that the search was conducted in compliance with legal provisions and based on credible information."
  ],
  "assets": [
    "Account books",
    "Documents",
    "Slips",
    "Cash (Rs. 222)",
    "Jewelry"
  ],
  "statutes": [
    "Income-Tax Act, 1961",
    "Income-Tax Rules, 1962"
  ],
  "sections": [
    "Section 132",
    "Rule 112"
  ],
  "citations": [
    "1972 P T D 205",
    "M.P. Sharma v. Satish Chandra (AIR 1954 SC 300)",
    "Durga Prasad v. Superintendent (AIR 1966 SC 1209)",
    "Seth Brothers v. Commissioner of Income-tax (1966 62 ITR 44)",
    "C. Venkata Reddy v. Income-tax Officer (Central) 1, Bangalore (1967 66 ITR 212)"
  ],
  "witnesses": [
    "Sri N.S. Mani",
    "Sri Chittal"
  ],
  "witness_statement": {
    "Sri N.S. Mani": "Identified papers seized during the search as related to Sri Venkateswara Lodge and its branches.",
    "Sri Chittal": "Reported to A. Ramaswamy about the arrival of Income-Tax Officers and the presence of N.S. Mani with gunny bags of documents."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law",
    "Constitutional Law"
  ],
  "key_issues": [
    "Legality of search and seizure under Section 132 of the Income-Tax Act",
    "Compliance with procedural requirements under Rule 112",
    "Allegations of abuse of power and mala fide actions"
  ],
  "key_findings": {
    "constitutionality": "Search and seizure powers under Section 132 are constitutional.",
    "compliance": "Commissioner followed legal procedures and recorded reasons for authorization.",
    "specificity": "Search warrant did not require specific identification of documents.",
    "seizure": "Seizure was not arbitrary or excessive."
  },
  "maxims": {
    "Reg v. Leatham": "It matters not how you get it; if you steal it even, it would be admissible."
  },
  "legal_terms": {
    "Search and Seizure": "The act of examining premises and confiscating relevant materials under legal authority.",
    "Writ of Prohibition": "A court order preventing a lower court or authority from exceeding its jurisdiction."
  },
  "words_and_phrases": {
    "Mala fide": "In bad faith or with intent to deceive.",
    "Inventory": "A detailed list of items seized during a search."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved a writ petition challenging the legality of a search and seizure conducted under Section 132 of the Income-Tax Act, 1961. The court upheld the validity of the search, dismissing allegations of abuse of power and procedural violations."
}