{
  "case_title": "SURYABALI and others vs THE VITH ADDITIONAL DISTRICT JUDGE, DEORIA and others",
  "reference_no_or_id": "Civil Miscellaneous Writ Petition No. 9631 of 1988",
  "judgment_date": "1988-10-31",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "bench_type": "Single Bench",
  "judges": [
    "B. L. Yadav"
  ],
  "appellant": [
    "SURYABALI and others"
  ],
  "respondant": [
    "THE VITH ADDITIONAL DISTRICT JUDGE, DEORIA and others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioners sought to quash orders dated 24-2-1987 and 9-3-1987 passed by the Munsif, which denied adjournment to the defendants for producing evidence and dismissed their application for restoration.",
  "investigation_summary": "The procedural fairness was questioned as the Munsif closed the evidence of the defendants without granting sufficient time or following the provisions of Order 17, Rule 3 of the Civil Procedure Code.",
  "judgment_summary": {
    "issue": "Refusal to grant adjournment to the defendant for producing evidence.",
    "court_findings": [
      "Procedural fairness and principles of natural justice were violated.",
      "Defendant was not granted reasonable time to produce evidence.",
      "Interpretation of procedural rules must advance substantial justice."
    ],
    "court_directions": [
      "Impugned orders quashed.",
      "Parties directed to appear before the Munsif on 1988-12-21.",
      "Short adjournments to be granted for objections and evidence production.",
      "Suit to be disposed of by 1989-03-31."
    ]
  },
  "punishment": "N/A",
  "Decision_or_verdict": "Petition allowed",
  "legal_arguments": [
    "Violation of procedural fairness under Order 17, Rule 3 of the Civil Procedure Code.",
    "Principles of natural justice, including audi alteram partem, were not adhered to.",
    "The court emphasized the importance of granting reasonable adjournments to ensure justice."
  ],
  "assets": [],
  "statutes": [
    "Constitution of India",
    "Civil Procedure Code"
  ],
  "sections": [
    "Order 17, Rules 1, 2, and 3"
  ],
  "citations": [
    "1990 M L D 394",
    "AIR 1984 SC 1268",
    "AIR 1984 SC 1543",
    "AIR 1985 SC 1416",
    "John v. Rees, 1970 Ch D 345",
    "Union of India v. Tulsi Ram Patel, AIR 1985 SC 1416",
    "Maharashtra State Board of S.H.S.E. v. Paritosh Bhupesh Kumar Seth, AIR 1984 SC 1543",
    "Liberty Oil Mills v. Union of India, (1984) 3 SCC 465",
    "Nirankar Nath Wahi v. Vth Addl. Distt. Judge, AIR 1984 SC 1268"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Civil Procedure",
    "Natural Justice"
  ],
  "key_issues": [
    "Whether the denial of adjournment violated procedural fairness.",
    "Whether the principles of natural justice were adhered to."
  ],
  "maxims": {
    "audi alteram partem": "The right of a party must not be affected without affording them an opportunity of hearing.",
    "Qui aliquid statuerit parte inaudita altera": "Justice should not only be done but must manifestly appear to have been done."
  },
  "legal_terms": {
    "adjournment": "Postponement of court proceedings to a later date.",
    "casus omissus": "A situation not provided for by statute."
  },
  "words_and_phrases": {
    "procedural fairness": "Adherence to rules ensuring fair treatment in legal proceedings.",
    "natural justice": "Legal principles ensuring fairness and equity in judicial processes."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around procedural fairness and adherence to natural justice principles under Order 17, Rules 1, 2, and 3 of the Civil Procedure Code. The court quashed the impugned orders, directed the Munsif to grant adjournments for objections and evidence production, ensuring the suit's disposal by 31-3-1989.",
  "reported_as": "1990 M L D 394",
  "legal_provisions": {
    "constitution_article": "Art. 226 of the Constitution of India",
    "procedural_code": "Order 17, Rules 1, 2, and 3 of the Code of Civil Procedure (C.P.C.)"
  },
  "key_orders": {
    "impugned_order_date": "1988-04-21",
    "orders_quashed": [
      "1987-02-24",
      "1987-03-09"
    ]
  },
  "costs": "No order as to costs"
}