{
  "case_title": "Syed MAZHAR-UL-HAQ vs INNSPECTOR-GENERAL OF POLICE, POLICE HEADQUARTER, QUETTA",
  "reference_no_or_id": "S.A. No.339 of 2014",
  "judgment_date": "2014-12-03",
  "first_hearing_date": "N/A",
  "court": "Balochistan Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Zaheer-Ud-Din Kakar",
    "Farzand Ali Mengal",
    "Muhammad Ibrahim Sumalani"
  ],
  "appellant": [
    "Syed MAZHAR-UL-HAQ"
  ],
  "respondant": [
    "INNSPECTOR-GENERAL OF POLICE, POLICE HEADQUARTER, QUETTA"
  ],
  "accussed_details": [
    {
      "name": "Syed MAZHAR-UL-HAQ",
      "age": "N/A",
      "gender": "Male",
      "designation": "Inspector (later demoted to Sub-Inspector)",
      "allegation": [
        "Willful avoidance to relinquish charge",
        "Non-compliance with orders of IG Police",
        "Absence from duty from 21-10-2010 to 10-6-2013"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "A.A.-G."
    ],
    "defense": [
      "Counsel for the appellant (name not specified)"
    ]
  },
  "complaint_summary": "The appellant was accused of avoiding relinquishment of charge and remaining absent from duty for over two years after being repatriated to his parent department.",
  "investigation_summary": "An inquiry was conducted by Mr. Muhammad Azher Akram, AIG General, CPO Quetta, concluding that the appellant avoided relinquishing charge and absented himself from duty without justification. Major punishment of reduction in rank was recommended.",
  "judgment_summary": "The tribunal found procedural and legal irregularities in the disciplinary proceedings, including the application of outdated Police Disciplinary Rules, 1975 instead of the Balochistan Employees Efficiency and Discipline Act, 2011. The tribunal set aside the impugned orders and directed the respondent department to specify the penalty period as per Fundamental Rule 29.",
  "punishment": "Reduction in rank from Inspector to Sub-Inspector (later set aside by the tribunal).",
  "Decision_or_verdict": "Appeal accepted; impugned orders set aside with directions to specify penalty period under FR.29.",
  "legal_arguments": [
    "Disciplinary proceedings conducted under outdated Police Disciplinary Rules, 1975.",
    "Violation of Fundamental Rule 29 by failing to specify penalty duration.",
    "Denial of fair trial under Article 10A of the Constitution of Pakistan.",
    "Failure to serve Final Show-Cause Notice to the appellant.",
    "Quantum of punishment disproportionate to the gravity of the charge."
  ],
  "assets": [],
  "statutes": [
    "Balochistan Service Tribunals Act, 1974",
    "Balochistan Employees Efficiency and Discipline Act, 2011",
    "Police Disciplinary Rules, 1975",
    "Fundamental Rule 29",
    "Article 10A of the Constitution of Islamic Republic of Pakistan, 1973"
  ],
  "sections": [
    "Section 4 of Balochistan Service Tribunals Act, 1974",
    "Section 19 of Balochistan Employees Efficiency and Discipline Act, 2011"
  ],
  "citations": [
    "2015 P L C (C.S.) 1324",
    "2004 SCMR 647 (Tanvir Ahmed v. Chief Secretary)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Service Law",
    "Disciplinary Proceedings",
    "Constitutional Law"
  ],
  "key_issues": [
    "Application of outdated disciplinary rules.",
    "Violation of procedural fairness.",
    "Disproportionate punishment."
  ],
  "key_points": {
    "transfer_and_repatriation": "Appellant was transferred to ICT Islamabad Traffic Police on deputation for 3 years, extended for 2 years, and repatriated to Balochistan Police in 2010.",
    "disciplinary_action": "Appellant faced disciplinary proceedings for absence from duty and was demoted from Inspector to Sub-Inspector under Police Disciplinary Rules, 1975.",
    "legal_infirmities": "Appellant argued proceedings were conducted under outdated rules instead of the Balochistan Employees Efficiency and Discipline Act, 2011.",
    "fair_trial_violation": "Appellant claimed violation of Article 10A of the Constitution ensuring the right to a fair trial.",
    "punishment_specification": "Tribunal directed respondent to specify the duration of penalty as required under Fundamental Rule 29."
  },
  "tribunal_decision": {
    "appeal_result": "Accepted",
    "impugned_order": "Set aside",
    "costs": "No order as to costs",
    "directive": "Respondent department to specify penalty duration as per Fundamental Rule 29."
  },
  "maxims": {
    "Justice must not only be done but must appear to be done.": "Golden principle cited to emphasize fairness in disciplinary proceedings."
  },
  "legal_terms": {
    "Reduction in rank": "Demotion of a government servant due to misconduct or inefficiency.",
    "Fair trial": "Right to due process and impartial adjudication under Article 10A."
  },
  "words_and_phrases": {
    "Extraordinary leave without pay": "Leave granted without salary for an extended absence from duty."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around disciplinary action against Syed Mazhar-ul-Haq for alleged misconduct during his deputation and subsequent repatriation to Balochistan Police. The tribunal found procedural and legal irregularities, including the use of outdated rules and denial of fair trial, leading to the setting aside of the impugned orders."
}