{
  "case_title": "Syed MUHAMMAD AMIN SHAH vs AZAD GOVERNMENT OF THE STATE OF JAMMU & KASHMIR And Another",
  "reference_no_or_id": "File No. 168 of 1981",
  "judgment_date": "1985-03-07",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Sardar Muhammad Ashraf Khan",
    "Khawaja Abdus Samad"
  ],
  "appellant": [
    "Syed Muhammad Amin Shah"
  ],
  "respondant": [
    "Azad Government of the State of Jammu & Kashmir",
    "Another (unspecified)"
  ],
  "accussed_details": [
    {
      "name": "Syed Muhammad Amin Shah",
      "age": "50",
      "gender": "Male",
      "designation": "Inspector of Police (Reserve)",
      "allegation": [
        "Challenged retirement order under Section 12 of Azad Jammu and Kashmir Civil Servant Act, 1976"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "The appellant challenged his retirement order issued by the respondent under Section 12 of the Azad Jammu and Kashmir Civil Servant Act, 1976, claiming it violated his service terms and conditions and that he was entitled to remain in service until the age of 60.",
  "investigation_summary": "The respondent argued that the appellant's retirement was lawful and in accordance with Section 12 of the Civil Servant Act, 1976, which allows retirement after 25 years of service in the public interest.",
  "judgment_summary": "The Tribunal upheld the respondent's retirement order, stating it was lawful and aligned with the terms and conditions of service under Section 12 of the Civil Servant Act, 1976. The Tribunal emphasized that the discretion to retire a civil servant lies with the competent authority and cannot be interfered with. The Tribunal also clarified that civil servants cannot claim retention in service as a right after completing 25 years of service.",
  "punishment": "Retirement with pensionary benefits.",
  "Decision_or_verdict": "Appeal dismissed.",
  "legal_arguments": [
    "Appellant argued the retirement order violated Section 12 of the Civil Servant Act, 1976 and his service terms.",
    "Respondent contended the retirement was lawful and in the public interest under Section 12(ii) of the Act."
  ],
  "assets": [],
  "statutes": [
    "Azad Jammu and Kashmir Civil Servant Act, 1976",
    "Azad Jammu and Kashmir Constitution Act, 1974"
  ],
  "sections": [
    "Section 12 of Azad Jammu and Kashmir Civil Servant Act, 1976",
    "Section 49 of Azad Jammu and Kashmir Constitution Act, 1974"
  ],
  "citations": [
    "1987 P L C (C.S.) 324"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Service Law",
    "Civil Servant Retirement"
  ],
  "key_issues": [
    "Validity of retirement order under Section 12 of Civil Servant Act, 1976",
    "Discretion of competent authority in retiring civil servants"
  ],
  "maxims": {},
  "legal_terms": {
    "Retirement": "The act of ending employment, often with pension benefits.",
    "Public Interest": "Actions or decisions made for the welfare of the general public."
  },
  "words_and_phrases": {
    "Competent Authority": "The official body or person authorized to make decisions regarding civil servants.",
    "Pensionary Benefits": "Financial benefits provided to retired employees."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves a service appeal filed by Syed Muhammad Amin Shah challenging his retirement order issued under Section 12 of the Azad Jammu and Kashmir Civil Servant Act, 1976. The Tribunal upheld the retirement order, emphasizing the competent authority's discretion in retiring civil servants after 25 years of service in the public interest. The Tribunal also noted that it cannot question the propriety or public interest determination made by the competent authority."
}