{
  "case_title": "TANVIR AHMED KHAN vs HAMID MUKHTAR & 3 others",
  "reference_no_or_id": "R.P. Nil 474 of 2004 in ROR No. 1693 of 2003",
  "case_number": "R.P. Nil 474 of 2004 in ROR No. 1693 of 2003",
  "judgment_date": "2009-12-02",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Full Board",
  "judges": [
    "Nadeem Ashraf",
    "Azhar Hussain Shamim",
    "Nazir Saeed"
  ],
  "appellant": [
    "Tanvir Ahmed Khan"
  ],
  "respondant": [
    "Hamid Mukhtar",
    "Others (3 unnamed individuals)"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner challenged the orders of the Executive District Officer (Revenue), Toba Tek Singh and Member (Judicial-V), Board of Revenue, Punjab, which overturned his appointment as Lambardar.",
  "investigation_summary": "The petitioner was initially appointed Lambardar by the District Officer (Revenue), Toba Tek Singh on 14.04.2003. This decision was appealed and overturned by the Executive District Officer (Revenue), Toba Tek Singh on 02.09.2003, and later upheld by the Member (Judicial-V), Board of Revenue, Punjab on 19.06.2004.",
  "judgment_summary": "The review petition was accepted. The orders of the Executive District Officer (Revenue), Toba Tek Singh, and Member (Judicial-V), Board of Revenue, Punjab were set aside, reinstating the petitioner’s appointment as Lambardar.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition accepted; petitioner reinstated as Lambardar.",
  "legal_arguments": [
    "Petitioner argued he was better qualified, owned more land, and was younger than Respondent No. 1.",
    "Petitioner highlighted his sound physique, higher education (F.Sc.), and ownership of 76-Kanals, 14-Marlas of land compared to Respondent's 8-Kanals and primary education.",
    "Respondent No. 1 argued that the Board of Revenue lacked authority to adjudicate Lambardari cases as per PLD 1965 SC 393.",
    "Respondent claimed adjudication of the review petition violated Supreme Court orders."
  ],
  "assets": [
    {
      "owner": "Tanvir Ahmed Khan",
      "details": "76-Kanals, 14-Marlas of land"
    },
    {
      "owner": "Hamid Mukhtar",
      "details": "8-Kanals of land"
    }
  ],
  "statutes": [
    "Board of Revenue Act, 1957",
    "West Pakistan Land Revenue Rules, 1968"
  ],
  "sections": [
    "Section 8 of Board of Revenue Act, 1957"
  ],
  "citations": [
    "PLD 1965 SC 393",
    "PLJ 2010 Tr.C. (Revenue) 100"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Administrative Law",
    "Land Revenue"
  ],
  "key_issues": [
    "Authority of Board of Revenue to adjudicate Lambardari cases",
    "Qualifications and suitability for appointment as Lambardar"
  ],
  "maxims": {
    "Binding Precedent": "Orders of the Supreme Court are binding on subordinate courts."
  },
  "legal_terms": {
    "Lambardar": "A village headman responsible for revenue collection and administrative duties."
  },
  "words_and_phrases": {
    "Hereditary Claim": "A claim based on lineage or ancestry."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "facts": {
    "death_of_lambardar": "Lambardar of Chak No. 294/GB, Tehsil Toba Tek Singh passed away.",
    "initial_appointment": "District Officer (Revenue), Toba Tek Singh appointed Tanvir Ahmed Khan as Lambardar on 14.04.2003.",
    "appeal": "Hamid Mukhtar appealed against the appointment, which was accepted by Executive District Officer (Revenue), Toba Tek Singh on 02.09.2003.",
    "revision_petition": "Tanvir Ahmed Khan's revision petition was dismissed by Member (Judicial-V), Board of Revenue, Punjab on 19.06.2004."
  },
  "arguments": {
    "appellant": {
      "claims": [
        "Impugned orders were against the law and facts.",
        "Appellant was more suitable due to sound physique, higher education (F.Sc.), and ownership of 76-Kanals, 14-Marlas of land.",
        "Respondent owned only 8-Kanals and had primary education.",
        "Appointment of Lambardar is an administrative matter, and the District Collector's choice should prevail."
      ],
      "prayer": "Review petition should be accepted."
    },
    "respondent": {
      "claims": [
        "Supreme Court prohibited Board of Revenue from reopening Lambardari cases.",
        "Adjudication of the review petition violated Supreme Court orders in PLD 1965 SC 393."
      ],
      "prayer": "Review petition should be dismissed."
    }
  },
  "judgment": {
    "analysis": [
      "Supreme Court ruling in PLD 1965 SC 393 is not applicable due to supersession of rules by West Pakistan Land Revenue Rules, 1968.",
      "Under Section 8 of Board of Revenue Act, 1957, review by Full Board is permissible.",
      "Petitioner has resigned from government service and is prepared to serve as Lambardar.",
      "Petitioner has more land, better education, and is younger, making him more suitable for the role."
    ],
    "decision": "Review petition accepted. Orders dated 02.09.2003 and 19.06.2004 are set aside. Order dated 14.04.2003 by District Officer (Revenue), Toba Tek Singh is upheld."
  },
  "summary_vector_notes": "The case revolves around the appointment of Lambardar in Chak No. 294/GB, Tehsil Toba Tek Singh. Following the death of the previous Lambardar, Tanvir Ahmed Khan was appointed. His appointment was challenged by Hamid Mukhtar, citing lack of authority and qualifications. The court found the petitioner more suitable due to his land ownership, education, and age, and upheld his appointment while dismissing the respondent's objections."
}