{
  "case_title": "UMAR HAYAT vs MUHAMMAD NAWAZ KHAN Etc",
  "reference_no_or_id": "Review Petition No. 1% of 1989",
  "judgment_date": "1994-08-07",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Imtiaz Masrur"
  ],
  "appellant": [
    "Umar Hayat"
  ],
  "respondant": [
    "Muhammad Nawaz Khan Etc"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner, Umar Hayat, challenged the sanction of mutation No. 10046 dated 23.8.1987, alleging that his area was fraudulently included in the joint Khata of the respondents without his consent.",
  "investigation_summary": "The petitioner filed appeals against the mutation, which were dismissed by the AC/Collector on 28.1.1988 and by the Additional Commissioner (Revenue) on 14.7.1988. A revision petition was filed before the Board of Revenue, Punjab, which was remanded to the AC/Collector for disposal on 4.11.1989. A review petition was later accepted on 6.6.1993, recalling the earlier order, and the case was treated as a revision petition.",
  "judgment_summary": "The court dismissed the revision petition, upholding the orders of the Additional Commissioner (Revenue), Sargodha Division. The court noted that the appeal was time-barred by 3 months and 5 days and advised the petitioner to approach Civil Courts if he believed fraud was involved. The presence of parties was not disputed.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision petition dismissed. Impugned orders upheld.",
  "legal_arguments": [
    "Petitioner argued that his area was included in the joint Khata without his consent and requested remand for decision on merits.",
    "Respondents, who are real brothers, argued that the petitioner was aware of the transaction, as four mutations were attested on the same day with thumb impressions. They also contended that the appeal was time-barred by 3 months and 5 days."
  ],
  "assets": [],
  "statutes": [],
  "sections": [],
  "citations": [
    "K.L.R. 1995 Revenue Cases 11"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Revenue Law",
    "Property Disputes"
  ],
  "key_issues": [
    "Fraudulent inclusion of land in joint Khata",
    "Time-barred appeal"
  ],
  "maxims": {},
  "legal_terms": {
    "Mutation": "A change or transfer in property ownership recorded in revenue records.",
    "Khata": "A joint account or record of land ownership."
  },
  "words_and_phrases": {
    "Fard Patwar": "A document prepared by the Patwari (village accountant) detailing land transactions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves a property dispute over mutation No. 10046, where the petitioner alleged fraudulent inclusion of his land in the respondents' joint Khata. The appeal was dismissed as time-barred by 3 months and 5 days, and the court upheld the orders of the Additional Commissioner (Revenue). The petitioner was advised to seek remedy in Civil Courts."
}