{
  "case_title": "ZIA-UD-DIN ABDUL HAMID vs AZAD JAMMU AND KASHMIR GOVERNMENT through Secretary Education and 95 others",
  "reference_no_or_id": "Service Appeal No. 363",
  "judgment_date": "1992-01-27",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Sardar Muhammad Sajawal Khan",
    "Raja Muhammad Ashraf Kayani",
    "Zaidullah Khan"
  ],
  "appellant": [
    "ZIA-UD-DIN ABDUL HAMID"
  ],
  "respondant": [
    "AZAD JAMMU AND KASHMIR GOVERNMENT through Secretary Education",
    "95 others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Kh. Abdus Samad"
    ],
    "defense": [
      "Syed Nazir Hussain Kazami"
    ]
  },
  "complaint_summary": "The appellant challenged his placement at serial No. 160 in the seniority list dated 28-4-1986, arguing that he was senior to the respondents due to his entry into National Pay Scale No. 14 on 5-6-1976.",
  "investigation_summary": "The appellant's seniority was contested based on his clearing the B.Ed. examination in the second attempt on 7-7-1977. The respondents argued that seniority should be determined by the first attempt results, while the appellant claimed equal footing under Article 84 of K.S.R. Vol. I.",
  "judgment_summary": "The Tribunal allowed the appeal, ruling that the appellant's seniority should be fixed from 5-6-1976, the date he was placed in National Pay Scale No. 14, as per Article 84 of K.S.R. Vol. I. The impugned seniority list was set aside.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal allowed; seniority fixed from 5-6-1976.",
  "legal_arguments": [
    "Article 84 of K.S.R. Vol. I: Equal footing for teachers clearing compartment exams.",
    "Rule 10 of Azad Jammu and Kashmir Education Department Subordinate Senior Schools Branch (Non-Gazetted) Cadre Rules, 1975: Seniority based on merit assigned by appointing authority.",
    "Rule 8 of Azad Jammu and Kashmir Civil Servants (Appointment and Condition of Service) Rules, 1977: Seniority determined by continuous appointment date."
  ],
  "assets": [],
  "statutes": [
    "Civil Servants Act, 1977",
    "Azad Jammu and Kashmir Education Department Subordinate Senior Schools Branch (Non-Gazetted) Cadre Rules, 1975",
    "Azad Jammu and Kashmir Civil Servants (Appointment and Condition of Service) Rules, 1977"
  ],
  "sections": [
    "Article 84 of K.S.R. Vol. I",
    "Rule 10 of Education Department Rules, 1975",
    "Rule 8 of Civil Servants Rules, 1977"
  ],
  "citations": [
    "1992 P L C (C.S.) 876"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Service Law",
    "Seniority Dispute"
  ],
  "key_issues": [
    "Determination of seniority based on compartment exam clearance.",
    "Applicability of Article 84 of K.S.R. Vol. I.",
    "Validity of seniority list issued by Deputy Director."
  ],
  "respondent_arguments": [
    "Appeal is premature as the seniority list is not final.",
    "Appeal is time-barred.",
    "Appeal is not maintainable as it lacks specific orders against respondent No. 2.",
    "Appellant failed to submit objections to the seniority list in time."
  ],
  "tribunal_decision": {
    "majority_opinion": "Appellant's seniority should be reckoned from 5-6-1976, the date he was placed in regular pay scale No. 14.",
    "minority_opinion": "Appeal is not maintainable due to unchallenged orders promoting respondents and procedural limitations."
  },
  "key_findings": {
    "seniority_date": "Appellant's seniority fixed from 5-6-1976, aligning with the date increments were released.",
    "compartment_exam": "Clearing compartment does not disadvantage seniority under Article 84 of KSR.",
    "procedural_irregularities": "Impugned seniority list lacked legal force as it was unsigned by the appointing authority."
  },
  "order": {
    "appeal_status": "Allowed",
    "seniority_revised": "Appellant's seniority fixed w.e.f. 5-6-1976.",
    "costs": "No order as to costs."
  },
  "maxims": {},
  "legal_terms": {
    "seniority": "The order of precedence among employees based on their service or qualifications.",
    "compartment": "A situation where a candidate fails in one or more subjects but is allowed to retake the exam."
  },
  "words_and_phrases": {
    "inter se seniority": "Relative ranking among individuals within the same cadre or grade.",
    "National Pay Scale No. 14": "A specific grade in the pay structure for government employees."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around a seniority dispute where the appellant argued his placement in the seniority list was unjust due to his clearance of the B.Ed. exam in the second attempt. The Tribunal ruled in favor of the appellant, fixing his seniority from the date he was placed in National Pay Scale No. 14, as per Article 84 of K.S.R. Vol. I."
}