{
  "case_title": "(Auqaf and Settlement), Board of Revenue DARHOON vs AULADI AND ANOTHER",
  "reference_no_or_id": "SROA-162 of 1981",
  "judgment_date": "1983-01-29",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Single Bench",
  "judges": [
    "Ali Muhammad G. Shaikh"
  ],
  "appellant": [
    "(Auqaf and Settlement), Board of Revenue DARHOON"
  ],
  "respondant": [
    "AULADI",
    "ANOTHER"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The Additional Commissioner, Hyderabad Division, canceled a five-year lease of the petitioner and reserved the land for village assaish of Urs Machi.",
  "investigation_summary": "The Assistant Commissioner, Shandadpur, submitted a report confirming that the entire area of S. No. 289/2, 3, and 4 (10-10 acres) falls within 20 chains of the village Urs Machi.",
  "judgment_summary": "The court rejected the revision petition, upholding the Additional Commissioner’s order to reserve the land for village assaish.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition rejected.",
  "legal_arguments": [
    "The petitioner argued that the entire area does not fall within 20 chains of the village Urs Machi and that the policy reserves only land within 20 chains for village assaish.",
    "The respondent argued that the entire grant of the petitioner falls within 20 chains of the village, justifying the Additional Commissioner’s decision."
  ],
  "assets": [
    "Land (10-10 acres) in S. No. 289/2, 3, and 4"
  ],
  "statutes": [
    "Policy on land reservation for village assaish"
  ],
  "sections": [],
  "citations": [
    "P L D 1983 Rev. 25"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Whether the land falls within 20 chains of the village Urs Machi.",
    "Whether the Additional Commissioner’s order aligns with the policy on land reservation."
  ],
  "maxims": {},
  "legal_terms": {
    "assaish": "Land reserved for the use or benefit of a village."
  },
  "words_and_phrases": {
    "20 chains": "A measurement of distance used in land demarcation."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the cancellation of a lease and reservation of land for village assaish. The petitioner failed to provide documentary proof to support their claim that the land does not fall within the reserved area. The court upheld the Additional Commissioner’s decision based on the Assistant Commissioner’s report."
}