{
  "case_title": "ABDUR REHMAN vs SECRETARY TO THE GOVERNMENT OF WEST PAKISTAN, COLONY DEPARTMENT AND OTHERS",
  "reference_no_or_id": "Writ Petition No. 453 of 1968/LHR",
  "judgment_date": "1979-12-14",
  "first_hearing_date": "N/A",
  "court": "Baghdad-ul-Jadid",
  "bench_type": "Single Bench",
  "judges": [
    "Aftab Hussain"
  ],
  "appellant": [
    "Abdur Rehman"
  ],
  "respondant": [
    "Secretary to the Government of West Pakistan, Colony Department",
    "Others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "Petitioners claimed they were tenants under Section 10(4) of the Colonization of Government Lands (Punjab) Act, 1912, following the highest bid in an auction for temporary leases of state agricultural land from 1966 to 1976. They contested the inclusion of their leased lands in a new scheme introduced in 1968, arguing that their tenancy rights were violated.",
  "investigation_summary": "The petitioners provided evidence of possession and allotment orders issued by the Collector. Respondents failed to file written statements denying the claims. Departmental files and office notes confirmed possession and allotment orders.",
  "judgment_summary": "The court ruled that the petitioners were valid tenants under Section 10(4) of the Colonization of Government Lands (Punjab) Act, 1912. The Collector's orders and possession granted to the petitioners were deemed lawful. The inclusion of leased lands in the new scheme was declared invalid, and the cancellation orders were set aside.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petitions accepted. Orders canceling leases and including leased lands in the new scheme declared invalid.",
  "legal_arguments": [
    "Section 10(3) and (4) of the Colonization of Government Lands (Punjab) Act, 1912 grants the Collector authority to allot land and deliver possession.",
    "The letter dated 6th May 1965 delegating allotment powers to the Commissioner was deemed ultra vires.",
    "Existing leases were protected under the notification dated 7th February 1968."
  ],
  "assets": [],
  "statutes": [
    "Colonization of Government Lands (Punjab) Act, 1912",
    "Crown Grants Act, 1895"
  ],
  "sections": [
    "Section 10(3)",
    "Section 10(4)"
  ],
  "citations": [
    "1980 C L C 1042",
    "P L D 1971 Lah. 433",
    "P L D 1952 Lah. 200",
    "P L D 1968 Lah. 321",
    "1969 S C M R 110"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Validity of tenancy under Section 10(4) of the Colonization of Government Lands (Punjab) Act, 1912.",
    "Ultra vires delegation of allotment powers to the Commissioner.",
    "Protection of existing leases under the 1968 notification."
  ],
  "maxims": {
    "Ultra vires": "Acts beyond the scope of legal authority are invalid."
  },
  "legal_terms": {
    "Tenant": "A person who holds land under lease or tenancy agreement.",
    "Allotment": "The act of assigning land to a person under legal authority."
  },
  "words_and_phrases": {
    "Available land": "Land not already leased or allotted.",
    "Fard Taqseem": "Document indicating possession and allotment of land."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved the legality of temporary leases of state agricultural land granted to petitioners under Section 10(4) of the Colonization of Government Lands (Punjab) Act, 1912. The court upheld the petitioners' tenancy rights, invalidating the cancellation orders and inclusion of leased lands in a new scheme introduced in 1968. The delegation of allotment powers to the Commissioner was deemed ultra vires."
}