{
  "case_title": "ABDUL WAHID KHAN vs CUSTODIAN OF EVACUEE PROPERTY, WEST PAKISTAN, KARACHI AND Other",
  "reference_no_or_id": "Writ Petition No. 29 of 1964",
  "judgment_date": "1966-06-14",
  "first_hearing_date": "N/A",
  "court": "West Pakistan High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Muhammad Afzal Cheema",
    "Muhammad Gul"
  ],
  "appellant": [
    "Abdul Wahid Khan"
  ],
  "respondant": [
    "Custodian of Evacuee Property, West Pakistan, Karachi",
    "Muhammad Ali Gauri",
    "Ghulam Nabi",
    "Mir Ahmed Shah",
    "Lal Din"
  ],
  "accussed_details": [
    {
      "name": "Abdul Wahid Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Contractor",
      "allegation": [
        "Encroachment on evacuee property",
        "Violation of lease terms",
        "Illegal construction and possession of excess area"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Assistant Advocate-General"
    ],
    "defense": [
      "Muhammad Yaqub Khan"
    ]
  },
  "complaint_summary": "Abdul Wahid Khan challenged the transfer of evacuee property plots and shops situated on Anderson Road, Quetta, alleging that the orders were passed without lawful authority.",
  "investigation_summary": "Multiple inquiries revealed irregularities in Abdul Wahid Khan's possession and construction on evacuee property, including exceeding the allotted area and benefiting from favorable lease terms.",
  "judgment_summary": "The court dismissed the petition, finding Abdul Wahid Khan's conduct dubious and confirming the legality of the orders passed by the Custodian authorities. The petitioner was entitled to Rs. 29,800 as compensation for construction costs, but his lease was terminated.",
  "punishment": "Lease terminated; Rs. 29,800 compensation awarded for construction costs.",
  "Decision_or_verdict": "Petition dismissed with costs.",
  "legal_arguments": [
    "Petitioner argued that the properties were excluded from acquisition under the Displaced Persons (Compensation and Rehabilitation) Act, 1958.",
    "Respondents argued that the petitioner had no vested right in the property and had violated lease terms."
  ],
  "assets": [
    {
      "description": "Evacuee property plots and shops on Anderson Road, Quetta",
      "status": "Transferred to respondents"
    }
  ],
  "statutes": [
    "Displaced Persons (Compensation and Rehabilitation) Act, 1958",
    "West Pakistan Administration of Evacuee Property Act, 1957"
  ],
  "sections": [
    "Section 3 of Displaced Persons (Compensation and Rehabilitation) Act, 1958",
    "Section 43(6) of West Pakistan Administration of Evacuee Property Act, 1957"
  ],
  "citations": [
    "P L D 1966 (W. P.) Quetta 25",
    "P L D 1962 Quetta 72",
    "P L D 1963 S C 633",
    "P L D 1964 S C 189"
  ],
  "witnesses": [
    {
      "name": "Major T. H. Naqvi",
      "role": "Inquiry Officer"
    },
    {
      "name": "Shamshad Hussain Zaidi",
      "role": "Additional Custodian (Judicial)"
    }
  ],
  "witness_statement": {
    "Major T. H. Naqvi": "Confirmed encroachment and excess possession by Abdul Wahid Khan.",
    "Shamshad Hussain Zaidi": "Verified findings of Major Naqvi and upheld transfer of shops to respondents."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Evacuee Property",
    "Constitutional Law",
    "Property Law"
  ],
  "key_issues": [
    "Encroachment on evacuee property",
    "Validity of lease terms",
    "Transfer of property under Displaced Persons Act"
  ],
  "maxims": {
    "Equity": "He who comes into equity must come with clean hands."
  },
  "legal_terms": {
    "Evacuee Property": "Property left behind by individuals who migrated during partition.",
    "Lease Deed": "Legal document outlining terms of property lease."
  },
  "words_and_phrases": {
    "Certiorari": "A writ seeking judicial review of a lower court's decision.",
    "Mandamus": "A writ directing a public official to perform a duty."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved protracted litigation over evacuee property in Quetta. Abdul Wahid Khan's petition was dismissed due to irregularities in his possession and lease terms. The court upheld the Custodian's orders and awarded compensation for construction costs."
}