{
  "case_title": "ABDUR RASHID vs INSPECTOR-GENERAL OF POLICE AND 2 OTHERS",
  "reference_no_or_id": "Appeal No. 50 of 1977",
  "judgment_date": "1977-08-06",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Two-member bench",
  "judges": [
    "Malik Muhammad Aslam Khan",
    "Khawaja Abdus Samad"
  ],
  "appellant": [
    "Abdur Rashid"
  ],
  "respondant": [
    "Inspector-General of Police",
    "Deputy Inspector-General of Police HQ (Rangers)",
    "Commandant A.K.P. Rangers"
  ],
  "accussed_details": [
    {
      "name": "Abdur Rashid",
      "age": "N/A",
      "gender": "Male",
      "designation": "Constable in Rangers Police",
      "allegation": [
        "Absence without leave",
        "Negligence in duty"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Additional Advocate General"
    ],
    "defense": [
      "Counsel for the appellant"
    ]
  },
  "complaint_summary": "The appellant was reverted from his promoted position as Selection Grade Constable and later dismissed due to alleged absence without leave. He challenged the procedural irregularities in his demotion and dismissal.",
  "investigation_summary": "The appellant was subjected to departmental inquiries without being served personally or afforded an opportunity to defend himself. The inquiry led to his dismissal, which was later reversed due to lack of charge-sheeting and hearing.",
  "judgment_summary": "The Tribunal found procedural violations in the appellant's demotion and dismissal. It ruled that the appellant was not given an opportunity to show cause, violating Police Rule 16.28(3). The Tribunal reinstated the appellant as Selection Grade Constable and directed that his absence be treated as furlough leave or leave on private affairs, if due.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal accepted; appellant reinstated as Selection Grade Constable.",
  "legal_arguments": [
    "Violation of Police Rule 16.28(3) requiring opportunity to show cause before enhancing punishment.",
    "Improper delegation of review authority by Deputy Inspector-General to Inspector-General."
  ],
  "assets": [],
  "statutes": [
    "Punjab Police Rules (adopted in Azad Kashmir)"
  ],
  "sections": [
    "Police Rule 16.28(1)",
    "Police Rule 16.28(3)"
  ],
  "citations": [
    "1978 P L C [C. S. T.) 49"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Appeal No. 50 of 1977",
  "legal_categories": [
    "Service Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Procedural irregularities in demotion and dismissal.",
    "Violation of mandatory provisions under Police Rules."
  ],
  "maxims": {
    "audi alteram partem": "Principle requiring opportunity to be heard before punishment."
  },
  "legal_terms": {
    "review proceedings": "Process of reconsidering decisions made by subordinate authorities."
  },
  "words_and_phrases": {
    "furlough leave": "Leave granted for personal affairs or rest."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around procedural violations in the appellant's demotion and dismissal. The Tribunal emphasized adherence to Police Rule 16.28(3) and reinstated the appellant to his previous position, ensuring his absence was treated as appropriate leave."
}