{
  "case_title": "AHMED KHAN vs GOVERNMENT OF BALOCHISTAN through Secretary S&GAD, Civil Secretariat, Quetta and another",
  "reference_no_or_id": "S.A. No.618 of 2014",
  "judgment_date": "2015-11-02",
  "first_hearing_date": "2014-07-21",
  "court": "Balochistan Service Tribunal",
  "bench_type": "Three-member bench",
  "judges": [
    "Zaheer-Ud-Din Kakar",
    "Safdar Hussain",
    "Farzand Ali Mengal"
  ],
  "appellant": [
    "Ahmed Khan"
  ],
  "respondant": [
    "Government of Balochistan through Secretary S&GAD, Civil Secretariat, Quetta"
  ],
  "accussed_details": [
    {
      "name": "Ahmed Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Assistant Professor (B-18), Division of Crop Protection, Balochistan Agriculture College, Quetta",
      "allegation": [
        "Claim for promotion to Associate Professor (B-19) based on seniority-cum-fitness"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "Ahmed Khan challenged the decision of the Provincial Selection Board-I (PSB-I) to promote Lutufullah Khosa to Associate Professor (B-19) despite Ahmed Khan's seniority claim.",
  "investigation_summary": "The PSB-I reviewed the promotion cases of two Assistant Professors (Ahmed Khan and Lutufullah Khosa) against two vacancies but recommended only Lutufullah Khosa for promotion due to seniority and fitness criteria.",
  "judgment_summary": "The court dismissed Ahmed Khan's appeal, upholding the PSB-I's decision to promote Lutufullah Khosa based on seniority and fitness. The court emphasized that promotion is not a vested right and depends on multiple factors, including competence and availability of posts.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "Promotion is not a vested right and requires seniority, fitness, competence, and availability of posts.",
    "The government has the prerogative to amend service rules and promotion policies.",
    "Higher qualifications and specialized criteria for promotion are permissible under law."
  ],
  "assets": [],
  "statutes": [
    "Balochistan Service Tribunal Act, 1974"
  ],
  "sections": [
    "Section 4 of the Balochistan Service Tribunal Act, 1974"
  ],
  "citations": [
    "1987 SCMR 598",
    "PLD 2003 SC 110",
    "2008 PLC (C.S.) 1012",
    "2006 SCMR 1427",
    "2014 SCMR 997"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "S.A. No.618 of 2014",
  "legal_categories": [
    "Service Law",
    "Promotion Disputes"
  ],
  "key_issues": [
    "Whether seniority alone is sufficient for promotion.",
    "Validity of PSB-I's observations on service rules and promotion criteria."
  ],
  "maxims": {
    "Promotion is not a vested right": "Promotion depends on seniority, competence, fitness, and availability of posts."
  },
  "legal_terms": {
    "Seniority-cum-fitness": "A principle where both seniority and fitness are considered for promotion."
  },
  "words_and_phrases": {
    "Proforma promotion": "Promotion granted retrospectively from a due date."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Ahmed Khan filed an appeal challenging the PSB-I's decision to promote Lutufullah Khosa to Associate Professor (B-19) despite his seniority claim. The court upheld the PSB-I's decision, emphasizing that promotion is not a vested right and depends on seniority, fitness, competence, and availability of posts. The court also supported the government's prerogative to amend service rules and promotion policies to meet modern requirements."
}