{
  "case_title": "ATTA MUHAMMAD and others vs Mst. AZIZ and others",
  "reference_no_or_id": "R.O.R. No,3690 of 1987",
  "judgment_date": "1988-10-19",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Syed Sarfraz Hussain"
  ],
  "appellant": [
    "ATTA MUHAMMAD and others"
  ],
  "respondant": [
    "Mst. AZIZ and others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioners filed a revision petition under section 13 of the Consolidation of Holdings Ordinance, 1960, challenging the order of the Additional Commissioner (Cons.), Dera Ghazi Khan, which accepted the respondents' appeal regarding the partition of a joint Khata.",
  "investigation_summary": "The case involved the partitioning of a joint Khata without the written consent of all shareholders, which was opposed by the respondents. The Additional Commissioner (Cons.) ordered the rejoining of the Khata, deeming the partition unjustified.",
  "judgment_summary": "The court dismissed the revision petition, holding that the impugned order was in conformity with the law. It reaffirmed that a joint Khata could only be partitioned with the written consent of all shareholders.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "During consolidation, a joint Khata can only be partitioned with the written consent of all shareholders.",
    "The respondents opposed the separation of their Khata, making the partition unjustified."
  ],
  "assets": [],
  "statutes": [
    "Consolidation of Holdings Ordinance, 1960"
  ],
  "sections": [
    "Section 13"
  ],
  "citations": [
    "P L D 1989 Revenue 14"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Property Law",
    "Revenue Law"
  ],
  "key_issues": [
    "Whether the partition of a joint Khata without consent was lawful.",
    "Validity of the Additional Commissioner's order to rejoin the Khata."
  ],
  "maxims": {},
  "legal_terms": {
    "Khata": "A joint account or property holding shared by multiple stakeholders.",
    "Consolidation": "The process of reorganizing land holdings for efficient management."
  },
  "words_and_phrases": {
    "Partition": "The division of property or holdings among stakeholders.",
    "In limine": "At the outset or preliminary stage."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolved around the partitioning of a joint Khata during consolidation proceedings. The court upheld the Additional Commissioner's decision to rejoin the Khata, emphasizing the necessity of written consent from all shareholders for partitioning."
}