{
  "case_title": "CHALLA APPALASWAMY vs COMMISSIONER OF INCOME TAX, A. P.",
  "reference_no_or_id": "Case Referred No. 29 of 1966",
  "judgment_date": "1970-01-20",
  "first_hearing_date": "N/A",
  "court": "Andhra Pradesh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Gopalrao Ekbote",
    "Sriramulu"
  ],
  "appellant": [
    "CHALLA APPALASWAMY"
  ],
  "respondant": [
    "COMMISSIONER OF INCOME TAX, A. P."
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Sri Tamarao"
    ],
    "defense": [
      "Sri Anjaneyulu"
    ]
  },
  "complaint_summary": "The assessee-firm applied for registration under the Income Tax Act for assessment years 1960-61, 1961-62, and 1962-63, which was refused by the Income Tax authorities citing improper division of profits and losses.",
  "investigation_summary": "The Income Tax Appellate Tribunal upheld the refusal of registration, stating that the firm divided profits and losses separately for two businesses instead of combining them as per the partnership deed.",
  "judgment_summary": "The High Court ruled that the refusal of registration was incorrect. It held that the division of profits and losses was consistent with the partnership deed and did not contravene legal provisions. The court answered the referred question in favor of the assessee.",
  "punishment": "N/A",
  "Decision_or_verdict": "Question answered in the negative and in favor of the assessee.",
  "legal_arguments": [
    "Defense argued that the division of profits and losses was lawful and consistent with the partnership deed.",
    "Prosecution argued that the division was not in accordance with the shares specified in the partnership deed."
  ],
  "assets": [],
  "statutes": [
    "Indian Income Tax Act, 1922",
    "Indian Income Tax Act, 1961",
    "Indian Partnership Act, 1932"
  ],
  "sections": [
    "Section 66(1) of Indian Income Tax Act, 1922",
    "Section 256(1) of Indian Income Tax Act, 1961",
    "Section 26-A of Indian Income Tax Act, 1922",
    "Section 30 of Indian Partnership Act, 1932"
  ],
  "citations": [
    "Commissioner of Income Tax v. Sivakasi Match Exporting Co. (1964) 53 ITR 204",
    "S. C. Prashar v. Vasantsen Dwarkadas (1983) 49 ITR (SC) 1",
    "Commissioner of Income Tax v. S. M. Chaitnavis (1932) 2 Comp. Cas. 464",
    "Calcutta Co. Ltd. v. Commissioner of Income Tax (1959) 37 ITR 1"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law",
    "Partnership Law"
  ],
  "key_issues": [
    "Whether the refusal of registration to the assessee-firm was justified.",
    "Interpretation of clauses in the partnership deed regarding profit and loss sharing."
  ],
  "maxims": {},
  "legal_terms": {
    "Instrument of Partnership": "A legal document specifying the terms and conditions of a partnership.",
    "Registration of Firm": "Process under tax law to recognize a firm for tax purposes."
  },
  "words_and_phrases": {
    "Regardless of such losses": "Phrase indicating that a minor partner is entitled to profits but not liable for losses."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the refusal of registration to an assessee-firm due to alleged improper division of profits and losses. The High Court ruled in favor of the assessee, interpreting the partnership deed clauses as lawful and consistent with the Indian Partnership Act."
}