{
  "case_title": "Chief Executive Officer, Peshawar Electric and Power Company (PEPCO) and another vs Sajeeda Begum and others",
  "reference_no_or_id": "Civil Petitions Nos. 4963 and 5021 of 2018",
  "judgment_date": "2022-05-17",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Single Judge Bench",
  "judges": [
    "Ijaz-ul-Ahsan"
  ],
  "appellant": [
    "Chief Executive Officer, Peshawar Electric and Power Company (PEPCO)",
    "Water and Power Development Authority (WAPDA)"
  ],
  "respondant": [
    "Sajeeda Begum",
    "Gul Farah Jaan"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Learned Counsel for PESCO",
      "Learned ASC for WAPDA"
    ],
    "defense": [
      "Learned Counsel for Respondents"
    ]
  },
  "complaint_summary": "Respondents filed writ petitions seeking compensation under the 2014 Prime Minister's Assistance Package for deceased spouses employed by PESCO and WAPDA.",
  "investigation_summary": "The Islamabad High Court directed PESCO and WAPDA to compensate Respondents under the 2014 Prime Minister's Assistance Package, which was challenged by PESCO and WAPDA in the Supreme Court.",
  "judgment_summary": "The Supreme Court set aside the Islamabad High Court's judgments, ruling that PESCO and WAPDA employees are not government servants and thus not eligible for the 2014 Prime Minister's Assistance Package. The Court also found jurisdictional issues with the Islamabad High Court's decision.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeals allowed; Islamabad High Court judgments set aside.",
  "legal_arguments": [
    "PESCO employees are not government servants under any statutory law.",
    "PESCO does not fall within the territorial jurisdiction of the Islamabad High Court.",
    "WAPDA employees are governed by the WAPDA Act and its own Assistance Package.",
    "Beneficial legislation does not apply retrospectively unless explicitly stated."
  ],
  "assets": [],
  "statutes": [
    "Companies Ordinance, 1984",
    "Pakistan Water and Power Development Authority Act, 1958",
    "Constitution of Pakistan, 1973"
  ],
  "sections": [
    "Article 199 of the Constitution of Pakistan, 1973",
    "Section 7 of the Companies Ordinance, 1984",
    "Sections 1, 3, 17, and 29 of the WAPDA Act"
  ],
  "citations": [
    "2015 SCMR 1418",
    "1996 SCMR 350",
    "2023 PLC (C.S.) 90"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Administrative Law",
    "Employment Law"
  ],
  "key_issues": [
    "Jurisdiction of Islamabad High Court over PESCO and WAPDA.",
    "Eligibility of PESCO and WAPDA employees for government assistance packages.",
    "Applicability of the 2014 Prime Minister's Assistance Package."
  ],
  "maxims": {
    "Nemo dat quod non habet": "A person cannot give what they do not have."
  },
  "legal_terms": {
    "Body Corporate": "An entity recognized by law as having its own legal personality.",
    "Assistance Package": "Financial aid provided to families of deceased employees."
  },
  "words_and_phrases": {
    "Territorial Jurisdiction": "The authority of a court to hear cases within a specific geographic area."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved appeals by PESCO and WAPDA against Islamabad High Court judgments directing compensation under the 2014 Prime Minister's Assistance Package. The Supreme Court ruled that PESCO and WAPDA employees are not government servants and thus ineligible for the package. Jurisdictional issues were also highlighted."
}