{
  "case_title": "COMMISSIONER OF INCOME-TAX vs S. R. M. T. STAFF ASSOCIATION",
  "reference_no_or_id": "Case Referred No. 86 of 1987",
  "judgment_date": "1995-07-28",
  "first_hearing_date": "N/A",
  "court": "Andhra Pradesh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Syed Shah Mohammad Quadri",
    "G. Bikshapathy"
  ],
  "appellant": [
    "Commissioner of Income-Tax"
  ],
  "respondant": [
    "S. R. M. T. Staff Association"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": [
        "N/A"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Shri S.R. Ashok"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The Revenue questioned whether advertising charges collected by the respondent association could be treated as voluntary contributions or trading receipts under the Income Tax Act, 1961.",
  "investigation_summary": "The respondent association collected funds from businessmen for advertisements in a souvenir published in 1981. The Income-tax Officer treated the funds as taxable revenue receipts, rejecting the association's claim of charitable status.",
  "judgment_summary": "The court held that the advertising charges collected by the respondent association were voluntary contributions and not trading receipts. The association was not deemed a charitable institution, but the contributions did not qualify as taxable income under clause (24) of section 2 of the Income Tax Act.",
  "punishment": "N/A",
  "Decision_or_verdict": "Reference answered in favor of the assessee and against the Revenue.",
  "legal_arguments": [
    "Prosecution argued that the contributions should be treated as trading receipts based on the absence of charitable status.",
    "Defense argued that the contributions were voluntary and not income under clause (24) of section 2 of the Income Tax Act."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Act, 1961"
  ],
  "sections": [
    "Section 256(1)",
    "Clause (24) of Section 2"
  ],
  "citations": [
    "CIT v. Trustees of Visha Nima Charity Trust (1982) 138 ITR 564",
    "Automobile Association of Bengal v. CIT (1968) ITR 878 (Cal)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law"
  ],
  "key_issues": [
    "Whether advertising charges collected by the respondent association qualify as voluntary contributions or trading receipts."
  ],
  "maxims": {},
  "legal_terms": {
    "Voluntary Contribution": "A payment made without obligation or expectation of return.",
    "Trading Receipts": "Income derived from business activities."
  },
  "words_and_phrases": {
    "Revenue Receipts": "Income earned from regular business operations.",
    "Charitable Institution": "An organization established for charitable purposes."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the taxability of advertising charges collected by the S.R.M.T. Staff Association. The court ruled in favor of the association, stating that the funds were voluntary contributions and not trading receipts, despite the association lacking charitable status."
}