{
  "case_title": "COMMISSIONER OF WEALTH-TAX vs GAJU",
  "reference_no_or_id": "Wealth Tax Application No, 192 of 1991",
  "judgment_date": "1991-11-14",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "A. N. Verrna",
    "R. K. Gulati"
  ],
  "appellant": [
    "Commissioner of Wealth-Tax"
  ],
  "respondant": [
    "Gaju"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Learned Standing Counsel"
    ],
    "defense": [
      "Written Arguments Submitted on Behalf of Assessee"
    ]
  },
  "complaint_summary": "The case involves a dispute over the valuation of land at the rate of Rs. 2.80 per square yard as confirmed by the Income-tax Appellate Tribunal.",
  "investigation_summary": "The Income-tax Appellate Tribunal confirmed the Deputy Commissioner (Appeals)'s order regarding the valuation of land. The appellant sought clarification on whether this decision was legally correct.",
  "judgment_summary": "The court directed the Income-tax Appellate Tribunal to state the case and refer the question of law regarding the valuation of land for judicial opinion. No order as to costs was issued.",
  "punishment": "N/A",
  "Decision_or_verdict": "Order Accordingly",
  "legal_arguments": [
    "Whether the Income-tax Appellate Tribunal was legally correct in confirming the order of the Deputy Commissioner (Appeals) on the point of value of land at Rs. 2.80 per square yard."
  ],
  "assets": [],
  "statutes": [
    "1993 P T D 1269"
  ],
  "sections": [],
  "citations": [],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law",
    "Wealth Tax"
  ],
  "key_issues": [
    "Valuation of land at Rs. 2.80 per square yard",
    "Legal correctness of Income-tax Appellate Tribunal's decision"
  ],
  "maxims": {},
  "legal_terms": {
    "Income-tax Appellate Tribunal": "A quasi-judicial body that adjudicates disputes related to income tax."
  },
  "words_and_phrases": {
    "Order Accordingly": "A directive issued by the court indicating the conclusion of the case."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the valuation of land at Rs. 2.80 per square yard and the legal correctness of the Income-tax Appellate Tribunal's decision. The court directed the Tribunal to refer the question for judicial opinion without issuing any order as to costs."
}