{
  "case_title": "Commissioner Inland Revenue, Zone-IV vs Messrs Hazara Efficient Gas, Karachi",
  "reference_no_or_id": "I.T.A. No.487/KB of 2017",
  "judgment_date": "2017-12-13",
  "first_hearing_date": "N/A",
  "court": "Appellate Tribunal Inland Revenue",
  "bench_type": "Division Bench",
  "judges": [
    "Nazir Ahmad",
    "Ahmed Saeed"
  ],
  "appellant": [
    "Commissioner Inland Revenue, Zone-IV"
  ],
  "respondant": [
    "Messrs Hazara Efficient Gas, Karachi"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": [
        "Misclassification as a commercial importer instead of industrial undertaking"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Zia Agro, DR"
    ],
    "defense": [
      "Mr. Abid H. Shaban, Advocate"
    ]
  },
  "complaint_summary": "The appellant challenged the classification of the respondent as an industrial undertaking under section 2(29C) of the Income Tax Ordinance, 2001, alleging that their activities did not qualify as manufacturing.",
  "investigation_summary": "The Additional Commissioner Inland Revenue issued a revisionary notice under sections 122(5A)/122(9) of the Income Tax Ordinance, 2001, asserting that the respondent's activities did not meet the criteria for industrial undertaking. The respondent provided evidence of their manufacturing process, employment of over 10 employees, and use of electrical energy.",
  "judgment_summary": "The Appellate Tribunal Inland Revenue upheld the decision of CIR (Appeals-I), confirming the respondent's classification as an industrial undertaking under section 2(29C) of the Income Tax Ordinance, 2001. The Tribunal found the respondent's activities to be manufacturing, producing a distinct marketable product from raw materials, and dismissed the appeal filed by the appellant.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed; respondent classified as an industrial undertaking.",
  "legal_arguments": [
    "Respondent argued their activities qualified as manufacturing under section 2(29C) of the Income Tax Ordinance, 2001 and section 2(16) of the Sales Tax Act, 1990.",
    "Appellant argued the respondent was a commercial importer and not engaged in manufacturing."
  ],
  "assets": [
    "LPG handling, mixing, bottling, and filling plant",
    "Diesel generators (125 KVA and 85 KVA)",
    "Electrical energy consumption"
  ],
  "statutes": [
    "Income Tax Ordinance, 2001",
    "Sales Tax Act, 1990"
  ],
  "sections": [
    "2(29C) of Income Tax Ordinance, 2001",
    "153(7) of Income Tax Ordinance, 2001",
    "2(16) of Sales Tax Act, 1990",
    "148 of Income Tax Ordinance, 2001"
  ],
  "citations": [
    "2018 PTD (Trib.) 1188",
    "2000 PTD 874",
    "1982 SCMR 523",
    "PLD 1959 Lah. 955",
    "2007 PTD 2088",
    "2017 PTD 1181"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Tax Law",
    "Industrial Classification"
  ],
  "key_issues": [
    "Whether the respondent qualifies as an industrial undertaking under section 2(29C) of the Income Tax Ordinance, 2001.",
    "Whether the activities of blending, mixing, and bottling LPG constitute manufacturing."
  ],
  "maxims": {},
  "legal_terms": {
    "Industrial Undertaking": "Defined under section 2(29C) of the Income Tax Ordinance, 2001.",
    "Manufacturer": "Defined under section 153(7) of the Income Tax Ordinance, 2001 and section 2(16) of the Sales Tax Act, 1990."
  },
  "words_and_phrases": {
    "Manufacturing Process": "Activities that substantially change raw materials into a distinct marketable product."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the classification of Messrs Hazara Efficient Gas as an industrial undertaking under section 2(29C) of the Income Tax Ordinance, 2001. The Tribunal upheld the CIR (Appeals-I) decision, confirming the respondent's manufacturing activities and dismissing the appellant's claim that the respondent was a commercial importer. The judgment relied on detailed findings, legal provisions, and case law precedents."
}