{
  "case_title": "COMMISSIONER OF INCOME-TAX, M. P. vs DR. FIDA HUSSAIN G. ABBASI",
  "reference_no_or_id": "Civil Case No. 241 of 1964",
  "judgment_date": "1967-12-07",
  "first_hearing_date": "N/A",
  "court": "Andhra Pradesh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "P. V. Dixit",
    "K. L. Pandey"
  ],
  "appellant": [
    "Commissioner of Income-tax, M. P."
  ],
  "respondant": [
    "Dr. Fida Hussain G. Abbasi"
  ],
  "accussed_details": [
    {
      "name": "Dr. Fida Hussain G. Abbasi",
      "age": "N/A",
      "gender": "Male",
      "designation": "Shareholder and Director of Ratlam Straw Board Mills (Private) Limited",
      "allegation": [
        "Claiming deduction of Rs. 2,850 as interest on loans borrowed for investment in shares which did not yield dividend income."
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Departmental Representative"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The Commissioner of Income-tax challenged the deduction claimed by the assessee for interest paid on loans borrowed for investment in shares that did not yield dividend income.",
  "investigation_summary": "The Income-tax Appellate Tribunal allowed the deduction based on precedents, including Ormerods (India) (Private) Ltd. v. Commissioner of Income-tax (1959) 36 ITR 329. The Commissioner of Income-tax filed an application under section 66(1) of the Indian Income-tax Act, 1922, for referring two questions of law to the High Court.",
  "judgment_summary": "The Andhra Pradesh High Court upheld the Tribunal's decision allowing the deduction under section 12(2) of the Indian Income-tax Act, 1922. The court declined to answer the second question due to procedural non-compliance by the assessee.",
  "punishment": "N/A",
  "Decision_or_verdict": "Deduction of Rs. 2,850 allowed under section 12(2) of the Indian Income-tax Act, 1922.",
  "legal_arguments": [
    "The expenditure must have been laid out solely for the purpose of earning income, irrespective of whether income was actually earned.",
    "Precedents cited include Ormerods (India) (Private) Ltd. v. Commissioner of Income-tax (1959) 36 ITR 329, Chhail Behari Lal v. Commissioner of Income-tax (1960) 39 ITR 696, and others."
  ],
  "assets": [
    "225 shares of Ratlam Straw Board Mills (Private) Limited valued at Rs. 1,000 each."
  ],
  "statutes": [
    "Indian Income-tax Act, 1922"
  ],
  "sections": [
    "Section 12(2)",
    "Section 66(1)"
  ],
  "citations": [
    "(1959) 36 ITR 329",
    "(1960) 39 ITR 696",
    "(1962) 46 ITR 511",
    "(1963) 49 ITR 127",
    "(1957) 32 ITR 377",
    "(1963) 47 ITR 1",
    "(1957) 31 ITR 92",
    "(1964) 51 ITR 112"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law",
    "Income Tax Deduction"
  ],
  "key_issues": [
    "Whether interest paid on loans borrowed for investment in shares without dividend income is deductible under section 12(2) of the Indian Income-tax Act, 1922.",
    "Procedural compliance for referring questions of law under section 66(1)."
  ],
  "maxims": {},
  "legal_terms": {
    "Deduction": "Reduction in taxable income.",
    "Dividend Income": "Income earned from shares."
  },
  "words_and_phrases": {
    "Allowable Deduction": "Expenses permitted to be subtracted from taxable income."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the applicability of section 12(2) of the Indian Income-tax Act, 1922, for deducting interest paid on loans used for investment in shares without dividend income. The High Court upheld the Tribunal's decision allowing the deduction, citing precedents. Procedural non-compliance led to the rejection of the second question for reference."
}