{
  "case_title": "COMMISSIONER OF WEALTH TAX vs MOTILAL CHHADAMILAL",
  "reference_no_or_id": "W.T.R.NO. 122 of 1983",
  "judgment_date": "2006-02-14",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "A. K. Yog",
    "Prakash Krishna"
  ],
  "appellant": [
    "Commissioner of Wealth Tax"
  ],
  "respondant": [
    "Motilal Chhadamilal"
  ],
  "accussed_details": [
    {
      "name": "Motilal Chhadamilal",
      "age": "N/A",
      "gender": "Male",
      "designation": "Factory Owner",
      "allegation": [
        "Dispute over inclusion of Rs.2,08,000 in net wealth under Wealth Tax Act"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Sri Bharat Ji Agarwal"
    ],
    "defense": []
  },
  "complaint_summary": "The Wealth Tax Officer added Rs.2,08,000 received as interest and compensation on land acquisition to the net wealth of the assessee, which was challenged by the assessee.",
  "investigation_summary": "The Tribunal directed the Wealth Tax Officer to investigate the financial position of the vendee company, the compromise petition, and the litigation outcomes, but the officer failed to conduct proper inquiries.",
  "judgment_summary": "The court ruled that the Rs.2,08,000 received by the assessee was not includible in the net wealth as the title to the property and authority to receive compensation were sub-judice and not finalized.",
  "punishment": "N/A",
  "Decision_or_verdict": "In favor of the assessee and against the Revenue.",
  "legal_arguments": [
    "The Department argued that the sum should be included in net wealth as the assessee had possession of the property.",
    "The assessee contended that the compromise petition was not accepted by the court, and the title to the property was not transferred back to him."
  ],
  "assets": [
    "Rs.2,08,000 deposited in fixed deposit under court orders"
  ],
  "statutes": [
    "Wealth Tax Act, 1957"
  ],
  "sections": [
    "Section 27(3)"
  ],
  "citations": [
    "CWT v. U.C. Mehatab [1998] 231 ITR 501",
    "Vidhyadhar v. Mankikrao, AIR 1999 SC 1441",
    "F.S. Ghandi v. CWT [1990] 184 ITR 34; AIR 1991 SC 1866"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Wealth Tax",
    "Property Law",
    "Taxation"
  ],
  "key_issues": [
    "Whether Rs.2,08,000 received as interest and compensation could be included in the net wealth of the assessee.",
    "Validity of the compromise petition and its impact on ownership and compensation."
  ],
  "maxims": {
    "Ownership Transfer": "Ownership of immovable property can only be transferred by registered sale deed or decree."
  },
  "legal_terms": {
    "Net Wealth": "The total value of assets minus liabilities under the Wealth Tax Act.",
    "Vendor's Lien": "The right of a seller to retain possession of property until payment is made."
  },
  "words_and_phrases": {
    "Permissive Possession": "Possession granted by the owner without transferring title.",
    "Sub-judice": "Under judicial consideration and not yet decided."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around whether Rs.2,08,000 received by the assessee as interest and compensation should be included in his net wealth under the Wealth Tax Act. The court ruled in favor of the assessee, stating that the title to the property and authority to receive compensation were sub-judice and not finalized."
}