{
  "case_title": "COMMISSIONER OF INCOME-TAX vs ASHWANI KUMAR LILADHAR",
  "reference_no_or_id": "Income-tax Reference No. 134 of 1980",
  "judgment_date": "1996-07-19",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "B. M. Lal",
    "Alok Chakrabarti"
  ],
  "appellant": [
    "Commissioner of Income-Tax"
  ],
  "respondant": [
    "Ashwani Kumar Liladhar"
  ],
  "accussed_details": [
    {
      "name": "Ganesh Narain Somani",
      "age": "N/A",
      "gender": "Male",
      "designation": "Employee/Partner (disputed)",
      "allegation": [
        "Embezzlement of Rs. 1,72,279"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Sri S. Srivastava"
    ],
    "defense": [
      "Sri A.N. Mahajan"
    ]
  },
  "complaint_summary": "The assessee claimed a deduction of Rs. 1,72,279 as a business loss due to embezzlement allegedly committed by Ganesh Narain Somani, who was appointed to manage the iron and steel business. The Income-tax Officer rejected the claim, stating insufficient evidence and disputing Somani's status as an employee.",
  "investigation_summary": "The assessee lodged an FIR on December 11, 1965, but did not pursue further legal actions such as filing a protest petition or civil proceedings. The police submitted a final report citing lack of evidence.",
  "judgment_summary": "The court ruled against the assessee, affirming that the loss was not sufficiently proven and that Somani's status as an employee was not established. The Tribunal's reasoning was deemed insufficient, and the claim was classified as a capital loss rather than a business loss.",
  "punishment": "N/A",
  "Decision_or_verdict": "Reference answered in favor of the Revenue and against the assessee.",
  "legal_arguments": [
    "The assessee argued that the embezzlement constituted a business loss and cited precedents such as Associated Banking Corporation of India Ltd. v. CIT (1965) 56 ITR 1 (SC), Kothari & Sons v. CIT (1966) 61 ITR 23 (Mad.), and Hopkin and Williams (Travancore) Ltd. v. CIT (1967) 64 ITR 76 (Ker.).",
    "The Revenue countered that the loss was not proven and Somani was not an employee but a partner entitled to 40% of profits."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Act",
    "Criminal Procedure Code, Section 200"
  ],
  "sections": [
    "N/A"
  ],
  "citations": [
    "Associated Banking Corporation of India Ltd. v. CIT (1965) 56 ITR 1 (SC)",
    "Kothari & Sons v. CIT (1966) 61 ITR 23 (Mad.)",
    "Hopkin and Williams (Travancore) Ltd. v. CIT (1967) 64 ITR 76 (Ker.)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Income Tax",
    "Business Loss",
    "Embezzlement"
  ],
  "key_issues": [
    "Whether the loss of Rs. 1,72,279 was a business loss due to embezzlement.",
    "Whether the loss was irrecoverable during the assessment year 1968-69.",
    "Whether Somani was an employee or a partner of the assessee."
  ],
  "maxims": {},
  "legal_terms": {
    "Business Loss": "A financial loss incurred in the course of business operations.",
    "Embezzlement": "The fraudulent appropriation of funds or property entrusted to one's care."
  },
  "words_and_phrases": {
    "Capital Loss": "A loss incurred on the sale or exchange of a capital asset.",
    "Irrecoverable": "Unable to be recovered or regained."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the assessee's claim for deduction of Rs. 1,72,279 as a business loss due to alleged embezzlement by Ganesh Narain Somani. The court found insufficient evidence to prove the loss and ruled that Somani was not an employee but a partner entitled to 40% of profits. The reference was answered in favor of the Revenue."
}