{
  "case_title": "CONTROLLER OF ESTATE DUTY, ASSAM, TRIPURA AND MANIPUR vs BIRENDRA KUMAR SEN",
  "reference_no_or_id": "1965 PTD 219",
  "judgment_date": "1964-01-22",
  "first_hearing_date": "N/A",
  "court": "Assam High Court",
  "bench_type": "Division Bench",
  "judges": [
    "S. K. Dutta",
    "G. Mehrotra"
  ],
  "appellant": [
    "Controller of Estate Duty, Assam, Tripura and Manipur"
  ],
  "respondant": [
    "Birendra Kumar Sen"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "The case concerns the estate duty assessable on the chargeable estate of the deceased, Shri Jnanendra Mohan Sen, who gifted half of his pharmacy business to his son, Birendra Kumar Sen, and later entered into a partnership agreement with him.",
  "investigation_summary": "The Assistant Controller of Estate Duty included the gifted half share in the dutiable estate, arguing that Section 10 of the Estate Duty Act applied. The Appellate Controller excluded the inclusion, stating the donor did not retain possession or enjoyment of the gifted property.",
  "judgment_summary": "The court upheld the Tribunal's decision that the donor was entirely excluded from possession and enjoyment of the gifted property. Section 10 of the Estate Duty Act was deemed not applicable, as the gift was shorn of partnership rights.",
  "punishment": "N/A",
  "Decision_or_verdict": "Question answered in the affirmative; Section 10 of the Estate Duty Act not applicable.",
  "legal_arguments": [
    "The Department argued that the capital investment of the son formed part of the dutiable estate under Section 10 of the Estate Duty Act.",
    "The respondent contended that the gift was of a half share in the business, shorn of partnership rights, and thus excluded from estate duty."
  ],
  "assets": [
    {
      "description": "Half share in Upper Assam Pharmacy",
      "value": "Rs. 30,000"
    }
  ],
  "statutes": [
    "Estate Duty Act, 1953"
  ],
  "sections": [
    "Section 2(16)",
    "Section 5",
    "Section 9",
    "Section 10"
  ],
  "citations": [
    "Clifford John Chick v. Commissioner of Stamp Duties of New South Wales",
    "H. R. Munro v. Commissioner of Stamp Duties"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Estate Duty",
    "Gift Tax"
  ],
  "key_issues": [
    "Applicability of Section 10 of the Estate Duty Act",
    "Exclusion of donor from possession and enjoyment of gifted property"
  ],
  "maxims": {},
  "legal_terms": {
    "Estate Duty": "A tax levied on the estate of a deceased person.",
    "Gift Inter Vivos": "A gift made during the lifetime of the donor."
  },
  "words_and_phrases": {
    "Property Passing on Death": "Includes property passing either immediately on death or after any interval.",
    "Bona Fide Possession": "Genuine possession and enjoyment of property."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the estate duty implications of a gift made by Shri Jnanendra Mohan Sen to his son. The court determined that the donor was excluded from possession and enjoyment of the gifted property, and Section 10 of the Estate Duty Act did not apply."
}