{
  "case_title": "DR. ABDUL SAMI vs The DIRECTOR, HEALTH SERVICES, BALUCHISTAN",
  "reference_no_or_id": "Petition No. 69 of 1971",
  "judgment_date": "1973-05-15",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Ghulam Rasool K. Sheikh",
    "Z. A. Channa"
  ],
  "appellant": [
    "Dr. Abdul Sami"
  ],
  "respondant": [
    "The Director, Health Services, Baluchistan"
  ],
  "accussed_details": [
    {
      "name": "Dr. Abdul Sami",
      "age": "N/A",
      "gender": "Male",
      "designation": "Medical Officer",
      "allegation": [
        "Challenging pay scale restrictions while officiating in higher posts."
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Advocate-General, Quetta"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner challenged the orders restricting his pay scale while officiating in higher posts, claiming entitlement to the pay scale of Senior Class-I posts.",
  "investigation_summary": "The petitioner was appointed to various posts in Junior and Senior Class-I scales but was restricted to his original pay scale under Fundamental Rule 35. His appointments were temporary and did not confer substantive rights.",
  "judgment_summary": "The court dismissed the petition, holding that the petitioner was not substantively appointed to Senior Class-I posts and that Fundamental Rule 35 allowed the government to fix pay scales lower than those prescribed for officiating posts. The petitioner’s claims were deemed invalid as his appointments were temporary and did not confer rights to higher pay scales.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed.",
  "legal_arguments": [
    "Petitioner argued entitlement to Senior Class-I pay scale based on officiating appointments.",
    "Respondents cited Fundamental Rule 35, allowing pay restrictions for temporary appointments."
  ],
  "assets": [],
  "statutes": [
    "Fundamental Rule 35",
    "Fundamental Rule 31",
    "West Pakistan (Gazetted) Civil Services (Pay Revision) Rules, 1964"
  ],
  "sections": [],
  "citations": [
    "P L D 1969 Dacca 254",
    "P L D 1959 S C (Pak.) 107",
    "P L D 1959 S C (Pak.) 147",
    "P L D 1966 S C 99",
    "P L D 1973 Lab. 42"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Constitutional Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Entitlement to pay scale for higher posts while officiating.",
    "Validity of Fundamental Rule 35 in restricting pay scales."
  ],
  "maxims": {},
  "legal_terms": {
    "Officiating Appointment": "Temporary assignment to a higher post without substantive promotion.",
    "Reduction in Rank": "Reversion to a lower post or grade."
  },
  "words_and_phrases": {
    "Ultra Vires": "Beyond the legal power or authority.",
    "Presumptive Pay": "Pay admissible for a post under normal circumstances."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the petitioner’s challenge to pay restrictions under Fundamental Rule 35 while officiating in higher posts. The court upheld the government’s authority to restrict pay scales for temporary appointments, dismissing the petitioner’s claims."
}