{
  "case_title": "FEDERATION OF PAKISTAN through Secretary, Narcotics Control Division, Ministry of Interior and Narcotics Control, Government of Pakistan, Islamabad and another vs NOOR HUSSAIN PATHAN",
  "reference_no_or_id": "Civil Petition No, 625 of 1995",
  "judgment_date": "1996-04-10",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Single Bench",
  "judges": [
    "Sajjad Ali Shah"
  ],
  "appellant": [
    "FEDERATION OF PAKISTAN through Secretary, Narcotics Control Division, Ministry of Interior and Narcotics Control, Government of Pakistan, Islamabad",
    "Chairman, Pakistan Narcotics Control Board, Rawalpindi"
  ],
  "respondant": [
    "NOOR HUSSAIN PATHAN"
  ],
  "accussed_details": [
    {
      "name": "Noor Hussain Pathan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Field Investigating Officer, Pakistan Narcotics Control Board",
      "allegation": [
        "Aided and abetted in the escape of a smuggler in his custody"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Raja M Bashir (Deputy Attorney-General)"
    ],
    "defense": []
  },
  "complaint_summary": "The respondent, Noor Hussain Pathan, was dismissed from service on charges of aiding and abetting the escape of a smuggler in his custody.",
  "investigation_summary": "Three inquiries were conducted regarding the charges. The first inquiry was deemed improperly conducted. The second and third inquiries found the respondent not guilty. The authorized officer disagreed with the findings of the third inquiry, citing reasons in the show-cause notice.",
  "judgment_summary": "The Federal Service Tribunal reinstated the respondent with back benefits. The Supreme Court granted leave to appeal to examine whether the Tribunal's decision was legally sustainable and based on proper appraisal of the record.",
  "punishment": "Reinstatement with back benefits (Federal Service Tribunal decision)",
  "Decision_or_verdict": "Leave granted to appeal",
  "legal_arguments": [
    "Federal Service Tribunal did not review the entire record, including statements of P.C. Zakir Hussain and the respondent.",
    "Authorized officer provided cogent reasons to disagree with the third inquiry report."
  ],
  "assets": [],
  "statutes": [
    "1997 P L C (C.S.) 164"
  ],
  "sections": [],
  "citations": [],
  "witnesses": [
    "P.C. Zakir Hussain"
  ],
  "witness_statement": {
    "P.C. Zakir Hussain": "Statement referenced but details not provided in the judgment."
  },
  "appeal_number": "73(R)/95",
  "legal_categories": [
    "Service Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Whether the Federal Service Tribunal's decision was legally sustainable.",
    "Whether the Tribunal properly appraised the entire record."
  ],
  "maxims": {},
  "legal_terms": {
    "Show-cause notice": "A legal notice requiring an individual to explain or justify their actions."
  },
  "words_and_phrases": {
    "Leave granted": "Permission given by the court to proceed with an appeal."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves the dismissal of a government officer for alleged misconduct and subsequent reinstatement by the Federal Service Tribunal. The Supreme Court granted leave to appeal to assess the Tribunal's decision and its appraisal of evidence."
}