{
  "case_title": "G.V.K. INDUSTRIES LIMITED and another vs INCOME-TAX OFFICER and another",
  "reference_no_or_id": "Writ Petition No. 6866 of 1995",
  "judgment_date": "1997-05-02",
  "first_hearing_date": "N/A",
  "court": "Andhra Pradesh High Court",
  "bench_type": "Division Bench",
  "judges": [
    "B. S. Raikote",
    "Syed Shah Mohammad Quadri"
  ],
  "appellant": [
    "G.V.K. Industries Limited",
    "Director of G.V.K. Industries Limited"
  ],
  "respondant": [
    "Income-Tax Officer",
    "Commissioner of Income-Tax"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "J.V. Prasad"
    ],
    "defense": [
      "M.D.R. Dhanuka"
    ]
  },
  "complaint_summary": "The petitioner-company sought a 'no objection certificate' under Section 195 of the Income Tax Act, 1961, to remit Rs. 5.4 crores to ABB-Projects and Trade Finance (International) Ltd., Zurich, Switzerland (NRC). The Income-Tax Officer refused the certificate, citing tax liability under Sections 9(1)(i) and 9(1)(vii)(b). The petitioner challenged the refusal, arguing that the NRC had no business connection in India and rendered services entirely from outside India.",
  "investigation_summary": "The Income-Tax Officer and Commissioner of Income-Tax concluded that the NRC had a business connection with the petitioner-company, citing correspondence and services rendered. They determined that the 'success fee' fell under managerial and consultancy services, taxable under Section 9(1)(vii)(b). The petitioner argued that the NRC operated independently from Zurich and had no office or business connection in India.",
  "judgment_summary": "The court held that the 'success fee' payable to the NRC was chargeable under the Income Tax Act, 1961, as it constituted fees for technical services under Section 9(1)(vii)(b). The court found no evidence of a business connection between the petitioner-company and the NRC but ruled that the fee was taxable due to its nature as consultancy services. The petition for a 'no objection certificate' was dismissed.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "Petitioner argued that NRC had no business connection in India and rendered services from outside India, making Sections 9(1)(i) and 9(1)(vii) inapplicable.",
    "Respondent contended that the services rendered by NRC constituted managerial and consultancy services taxable under Section 9(1)(vii)(b)."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Act, 1961"
  ],
  "sections": [
    "Section 195",
    "Section 9(1)(i)",
    "Section 9(1)(vii)(b)"
  ],
  "citations": [
    "1999 P T D 2655"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Taxation Law",
    "International Taxation"
  ],
  "key_issues": [
    "Whether the 'success fee' payable to NRC is chargeable under the Income Tax Act, 1961.",
    "Whether the petitioner-company is entitled to a 'no objection certificate' under Section 195."
  ],
  "maxims": {},
  "legal_terms": {
    "business connection": "A real and intimate relationship contributing to the earning of income by a non-resident in India.",
    "fees for technical services": "Consideration for managerial, technical, or consultancy services."
  },
  "words_and_phrases": {
    "success fee": "Payment contingent upon successful financial closure of debt financing."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the applicability of Sections 9(1)(i) and 9(1)(vii)(b) of the Income Tax Act, 1961, concerning the taxability of fees paid to a non-resident entity for consultancy services. The court dismissed the petition, holding the fees taxable under Section 9(1)(vii)(b)."
}