{
  "case_title": "HAFEEZ-UR-REHMAN ABBASI, SUB-DIVISIONAL OFFICER ELECTRICITY CONSTRUCTION, SUB-DIVISION NEELUM VALLEY vs AZAD GOVERNMENT through its Chief Secretary, Azad Kashmir, Muzaffarabad and 3 others",
  "reference_no_or_id": "Service Appeal No, 119 of 2009",
  "judgment_date": "2009-04-09",
  "first_hearing_date": "2009-02-24",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Azhar Saleem Babar",
    "Malik Abdul Rashid"
  ],
  "appellant": [
    {
      "name": "Hafeez-ur-Rehman Abbasi",
      "designation": "Sub-Divisional Officer Electricity Construction, Sub-Division Neelum Valley"
    }
  ],
  "respondant": [
    {
      "name": "Azad Government",
      "designation": "Chief Secretary, Azad Kashmir, Muzaffarabad"
    },
    {
      "name": "Respondent No. 4",
      "designation": "N/A"
    },
    {
      "name": "Others",
      "designation": "N/A"
    }
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "The appellant challenged the notification dated 12.2.2009 transferring him to Muzaffarabad as Sub-Engineer, claiming he was senior and entitled to the post of Sub-Divisional Officer.",
  "investigation_summary": "The appellant argued that he was senior in the list of Sub-Engineers and had been performing duties as Sub-Divisional Officer for years. Respondents contended that the appellant was given additional charge as a stop-gap arrangement and lacked a vested right to the position.",
  "judgment_summary": "The court dismissed the appeal, stating that assigning additional charge of a senior post is not a vested right under service laws. The appellant was transferred in his own pay and scale, and the seniority list indicated another individual was senior to him.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed with no order as to costs.",
  "legal_arguments": [
    "Appellant argued seniority and entitlement to the post of Sub-Divisional Officer.",
    "Respondents argued appellant lacked locus standi and was given additional charge as a stop-gap arrangement."
  ],
  "assets": [],
  "statutes": [
    "Service Laws of Azad Jammu and Kashmir"
  ],
  "sections": [],
  "citations": [
    "PLJ 2009 Tr.C. (Services) 188"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "119 of 2009",
  "legal_categories": [
    "Service Law",
    "Employment Disputes"
  ],
  "key_issues": [
    "Seniority in service",
    "Entitlement to senior post",
    "Validity of transfer notification"
  ],
  "maxims": {},
  "legal_terms": {
    "locus standi": "The right or capacity to bring an action or to appear in a court."
  },
  "words_and_phrases": {
    "stop-gap arrangement": "Temporary assignment of duties until a permanent solution is found."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The appellant, Hafeez-ur-Rehman Abbasi, challenged his transfer from Neelum Valley to Muzaffarabad, claiming seniority and entitlement to the post of Sub-Divisional Officer. The court dismissed the appeal, stating that additional charge of a senior post is not a vested right under service laws. The appellant was transferred in his own pay and scale, and the seniority list indicated another individual was senior to him. The judgment emphasized the need for the Electricity Department to fill vacant posts in accordance with law."
}