{
  "case_title": "JWALAPRASAD AGARWALA vs COMMISSIONER OF INCOME-TAX, ASSAM",
  "reference_no_or_id": "Income-tax Reference No. 2 of 1962",
  "judgment_date": "1964-02-21",
  "first_hearing_date": "N/A",
  "court": "Assam High Court",
  "bench_type": "Division Bench",
  "judges": [
    "S. K. Dutta",
    "G. Mehrotra"
  ],
  "appellant": [
    "Jwala Prasad Agarwala"
  ],
  "respondant": [
    "Commissioner of Income-Tax, Assam"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Choudhuri"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The Income-tax Appellate Tribunal referred two questions of law regarding the inclusion of the minor son's share income from three firms in the father's income under Section 16(3)(a)(iv) of the Indian Income-tax Act, 1922.",
  "investigation_summary": "The Tribunal examined the financial connections between the firms and the minor's income derived from assets transferred by the father. It found that the minor's share income was not directly attributable to the assets transferred in two firms but was linked to the benefits of partnership in one firm.",
  "judgment_summary": "The court held that the minor's share of profit in the three firms was not liable to be included in the father's income under Section 16(3)(a)(iv). It emphasized strict interpretation of the statute and ruled that the income arose from the minor's admission to the benefits of partnership, not from the transfer of assets.",
  "punishment": "N/A",
  "Decision_or_verdict": "Questions answered in the negative. Minor's share of profit not included in father's income.",
  "legal_arguments": [
    "Strict interpretation of Section 16(3)(a)(iv) of the Indian Income-tax Act, 1922.",
    "Income arising from benefits of partnership versus assets transferred.",
    "Avoidance of double taxation under the Income-tax Act."
  ],
  "assets": [
    "Rs. 74,721 transferred to minor by father",
    "Rs. 11,000 transferred from Dhubri firm to Calcutta firm"
  ],
  "statutes": [
    "Indian Income-tax Act, 1922"
  ],
  "sections": [
    "Section 16(3)(a)(iv)",
    "Section 16(3)(a)(ii)",
    "Section 2(6-B)"
  ],
  "citations": [
    "Bhogilal Laherchand v. Commissioner of Income-tax ((1954) 25 ITR 523)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Income Tax",
    "Taxation Law"
  ],
  "key_issues": [
    "Whether minor's share income from three firms is liable to be included in father's income under Section 16(3)(a)(iv).",
    "Impact of financial connections between firms on income attribution."
  ],
  "maxims": {
    "Strict interpretation": "Section 16(3) must be strictly construed to avoid artificial or notional income attribution."
  },
  "legal_terms": {
    "Notional income": "Income attributed to an individual under statutory provisions, not earned directly.",
    "Benefits of partnership": "Rights granted to a minor admitted to a partnership under the Indian Partnership Act."
  },
  "words_and_phrases": {
    "Assets transferred": "Property or funds given by one individual to another without adequate consideration.",
    "Financial connection": "Economic linkage between entities influencing income attribution."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The judgment clarifies the scope of Section 16(3)(a)(iv) of the Indian Income-tax Act, 1922, emphasizing strict interpretation to avoid artificial income attribution. It distinguishes income arising from benefits of partnership versus assets transferred and addresses potential double taxation issues."
}