{
  "case_title": "KHUDA BAKHSH vs Syed MUHAMMAD HABIB SHAH HASHMI",
  "reference_no_or_id": "Civil Petition for Special Leave to Appeal No. 223-R of 1977",
  "judgment_date": "1978-11-12",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Coram",
  "judges": [
    "Muhammad Afzal Cheema",
    "Durab Patel"
  ],
  "appellant": [
    "Khuda Bakhsh"
  ],
  "respondant": [
    "Syed Muhammad Habib Shah Hashmi"
  ],
  "accussed_details": [
    {
      "name": "Khuda Bakhsh",
      "age": "N/A",
      "gender": "Male",
      "designation": "Tenant",
      "allegation": [
        "Subletting the demised premises",
        "Eviction due to landlord's bona fide requirement"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "Mr. Mujeeb-ur-Rehman"
    ]
  },
  "complaint_summary": "The respondent filed an eviction application against the petitioner under the West Pakistan Urban Rent Restriction Ordinance VI of 1959, citing bona fide requirement for personal use and subletting of the premises.",
  "investigation_summary": "The Rent Controller found the respondent's claim of bona fide requirement valid but dismissed the subletting allegation. The District Judge reversed the subletting finding and upheld the eviction. The Lahore High Court affirmed both findings.",
  "judgment_summary": "The Supreme Court dismissed the petition, upholding the findings of lower courts that the respondent required the premises in good faith and that subletting had occurred.",
  "punishment": "Petitioner ordered to vacate the premises by February 28, 1978, provided he continues paying monthly rent.",
  "Decision_or_verdict": "Petition dismissed.",
  "legal_arguments": [
    "Eviction application was not bona fide due to rent enhancement.",
    "Respondent owned another house sufficient for his family.",
    "Respondent's undecided relocation plans undermined bona fide requirement."
  ],
  "assets": [],
  "statutes": [
    "West Pakistan Urban Rent Restriction Ordinance VI of 1959"
  ],
  "sections": [
    "Section 13(3)"
  ],
  "citations": [
    "1978 S C M R 89"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Landlord-Tenant Disputes",
    "Eviction Proceedings"
  ],
  "key_issues": [
    "Bona fide requirement of premises",
    "Subletting allegation",
    "Rent enhancement justification"
  ],
  "maxims": {},
  "legal_terms": {
    "Bona fide": "In good faith; genuine."
  },
  "words_and_phrases": {
    "Demised premises": "The property leased or rented."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves a landlord-tenant dispute over eviction of the petitioner from a leased house in Rawalpindi. The respondent claimed bona fide requirement for personal use and alleged subletting. Lower courts upheld the eviction based on bona fide requirement and subletting. The Supreme Court dismissed the petition, affirming the findings of lower courts and granting the petitioner time to vacate the premises."
}