{
  "case_title": "LUQMAN vs MUHAMMAD NAWZ ETC.",
  "reference_no_or_id": "Criminal Revision No. 64 of 1952",
  "judgment_date": "1952-09-13",
  "first_hearing_date": "N/A",
  "court": "Baghdad-ul-Jadid",
  "bench_type": "Single Bench",
  "judges": [
    "Abdul Aziz"
  ],
  "appellant": [
    "Luqman"
  ],
  "respondant": [
    "Muhammad Nawz",
    "Others"
  ],
  "accussed_details": [
    {
      "name": "Allah Ditta",
      "age": "N/A",
      "gender": "Male",
      "designation": "N/A",
      "allegation": [
        "Assault",
        "Mutilation (cutting nose and lip)",
        "Physical violence"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Sleem"
    ],
    "defense": [
      "Mr. Rana"
    ]
  },
  "complaint_summary": "Luqman alleged that he was assaulted by Allah Ditta and his companions while watering his field on suspicion of an illicit relationship with Allah Ditta's wife. He was taken to a well, mutilated, and beaten.",
  "investigation_summary": "Police registered the complaint and challaned seven accused under sections 326, 148, and 149 of Pakistan Penal Code. Witnesses largely failed to corroborate the complainant's account, except for his brother Jumma, whose testimony was deemed biased.",
  "judgment_summary": "The trial Magistrate acquitted all accused due to lack of credible evidence. The Sessions Judge dismissed the revision petition, agreeing with the trial court's findings. The High Court also dismissed the second revision petition, citing no denial of fair trial or flagrant failure of justice.",
  "punishment": "None (Accused acquitted)",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "Section 439 of Criminal Procedure Code allows High Court interference in exceptional cases of denial of fair trial or flagrant failure of justice.",
    "Section 417 does not bar revision under Section 439.",
    "Improper acquittals can be set aside in revision only in exceptional circumstances."
  ],
  "assets": [],
  "statutes": [
    "Pakistan Penal Code"
  ],
  "sections": [
    "326",
    "148",
    "149"
  ],
  "citations": [
    "Nathu Mal v. Abdul Haq A.I.R. 1930 Lah. 159",
    "Kesho Prasad Singh v. Ram Swarup Ahir A.I.R. 1926 Pat. 176",
    "Wazir Kunjra v. Emperor A.I.R. 1929 Pat. 139"
  ],
  "witnesses": [
    "Jumma (complainant's brother)",
    "Unnamed individuals present at the scene"
  ],
  "witness_statement": {
    "Jumma": "Supported the complainant's account but was deemed biased.",
    "Others": "Expressed ignorance of the incident."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Criminal Revision",
    "Assault",
    "Acquittal"
  ],
  "key_issues": [
    "Whether the Sessions Judge erred in dismissing the revision petition.",
    "Whether the High Court should interfere in the acquittal order."
  ],
  "maxims": {
    "Denial of fair trial": "Ground for interference in exceptional cases.",
    "Flagrant failure of justice": "Ground for interference in exceptional cases."
  },
  "legal_terms": {
    "Revisional powers": "Authority of higher courts to review lower court decisions.",
    "Acquittal": "Judgment that the accused is not guilty."
  },
  "words_and_phrases": {
    "Improper order of acquittal": "An acquittal deemed unjust or incorrect.",
    "Exceptional cases": "Circumstances warranting deviation from standard legal procedures."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved allegations of assault and mutilation against Luqman by Allah Ditta and his companions. The trial court acquitted the accused due to lack of evidence, and subsequent revision petitions were dismissed by the Sessions Judge and High Court. The High Court emphasized that revisional powers can only be exercised in cases of denial of fair trial or flagrant failure of justice, neither of which were present."
}