{
  "case_title": "Major RIAZ AHMAD RASHID and others vs THE STATE and others",
  "reference_no_or_id": "R.O.R. Nos.1407 and 1735 of 1988",
  "judgment_date": "1990-08-13",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Single Bench",
  "judges": [
    "Abdul Waheed"
  ],
  "appellant": [
    "Major Riaz Ahmad Rashid",
    "Others"
  ],
  "respondant": [
    "The State",
    "Others"
  ],
  "accussed_details": [
    {
      "name": "Major Riaz Ahmad Rashid",
      "age": "N/A",
      "gender": "Male",
      "designation": "Petitioner",
      "allegation": [
        "Fraudulent acquisition of Khasra No. 837"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Ghulam Muhammad",
      "Mst. Janat Khatoon"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Petitioners claimed Khasra No. 837 was fraudulently acquired by respondents, depriving them of land allotted to their predecessor Fazal Karim.",
  "investigation_summary": "Field staff supported petitioners' claims, but the Deputy Commissioner resumed the land as evacuee property in favor of the Provincial Government.",
  "judgment_summary": "The court found that Khasra No. 837 was duly allotted and confirmed to Mst. Batool Begum and others, later transferred to Major Riaz Ahmad Rashid through registered deeds. The District Collector's resumption order was deemed void due to lack of jurisdiction post-repeal of Settlement Laws.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision Petition of Ghulam Muhammad dismissed; suit land remains with Major Riaz Ahmad Rashid.",
  "legal_arguments": [
    "Petitioners argued fraudulent acquisition of Khasra No. 837 by respondents.",
    "Respondents rebutted, citing valid allotment and registration of ownership in revenue records.",
    "Court examined Settlement Laws repeal and jurisdictional issues."
  ],
  "assets": [
    "Khasra No. 837"
  ],
  "statutes": [
    "Evacuee Property and Displaced Persons Laws (Repeal) Act, 1975"
  ],
  "sections": [
    "N/A"
  ],
  "citations": [
    "1991 C L C 277"
  ],
  "witnesses": [
    "Tehsildar",
    "Girdawar Halqa"
  ],
  "witness_statement": {
    "Tehsildar": "Supported petitioners' claims regarding Khasra No. 837.",
    "Girdawar Halqa": "Recommended correction of Khasra No. 837 in petitioners' favor."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Property Law",
    "Evacuee Property"
  ],
  "key_issues": [
    "Fraudulent acquisition of Khasra No. 837",
    "Jurisdiction of District Collector post-repeal of Settlement Laws"
  ],
  "maxims": {
    "N/A": "N/A"
  },
  "legal_terms": {
    "Khasra": "A specific plot of land in revenue records.",
    "Mutation": "Change in ownership recorded in revenue records."
  },
  "words_and_phrases": {
    "Evacuee Property": "Property left by individuals who migrated during partition.",
    "Settlement Laws": "Laws governing allocation of evacuee property."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around ownership of Khasra No. 837, contested between Major Riaz Ahmad Rashid and petitioners Ghulam Muhammad and Mst. Janat Khatoon. The court upheld the validity of registered deeds and dismissed claims of fraudulent acquisition, citing jurisdictional limitations post-repeal of Settlement Laws."
}