{
  "case_title": "MAN MOHAN SINGH vs ASSISTANT COMMISSIONER OF INCOME-TAX",
  "reference_no_or_id": "Civil Miscellaneous Writ Petition No, Nil of 1993",
  "judgment_date": "1993-03-24",
  "first_hearing_date": "N/A",
  "court": "Allahabad High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Om Prakash",
    "A. N. Gupta"
  ],
  "appellant": [
    "MAN MOHAN SINGH"
  ],
  "respondant": [
    "ASSISTANT COMMISSIONER OF INCOME-TAX"
  ],
  "accussed_details": [
    {
      "name": "MAN MOHAN SINGH",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Petitioner",
      "allegation": [
        "Non-compliance with notices under Section 148 of the Income Tax Act, 1961"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner challenged the issuance of notices under Section 148 of the Income Tax Act, 1961, and sought reasons recorded by the assessing authority for initiating proceedings.",
  "investigation_summary": "The petitioner filed an application requesting that the return filed under Section 139 be treated as filed pursuant to notices issued under Section 148. The petitioner also sought reasons recorded by the assessing authority for issuing notices.",
  "judgment_summary": "The court directed the assessing authority to communicate the reasons recorded under Section 148 to the petitioner within one week of receiving a certified copy of the order and the application. Proceedings related to the impugned notices were stayed until the reasons were communicated and the petitioner filed a reply.",
  "punishment": "N/A",
  "Decision_or_verdict": "Order accordingly",
  "legal_arguments": [
    "Petitioner argued entitlement to reasons recorded under Section 148 based on precedent set in K.M. Bansal (deceased) v. CIT (1992) 195 ITR 247 (All.).",
    "Court acknowledged the necessity of protecting the source/informant if deemed necessary by the assessing authority."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Act, 1961"
  ],
  "sections": [
    "Section 148",
    "Section 139"
  ],
  "citations": [
    "K.M. Bansal (deceased) v. CIT (1992) 195 ITR 247 (All.)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Tax Law",
    "Administrative Law"
  ],
  "key_issues": [
    "Whether the petitioner is entitled to reasons recorded under Section 148.",
    "Whether proceedings under Section 148 can be stayed pending communication of reasons."
  ],
  "maxims": {},
  "legal_terms": {
    "Section 148": "Provision under the Income Tax Act allowing reassessment of income.",
    "Assessing Officer": "Tax authority responsible for assessment."
  },
  "words_and_phrases": {
    "Impugned Notices": "Notices under legal challenge.",
    "Certified Copy": "Official copy of a court order."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Petitioner sought reasons for notices issued under Section 148 of the Income Tax Act, 1961. Court directed assessing authority to provide reasons within one week, staying proceedings until reasons were communicated and reply filed."
}