{
  "case_title": "Messrs DADA STEEL MILLS vs METALEXPORT and 5 others",
  "reference_no_or_id": "H.C.A. No. 22 of 1985",
  "judgment_date": "2009-07-27",
  "first_hearing_date": "N/A",
  "court": "Sindh High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Khilji Arif Hussain",
    "Soofia Latif"
  ],
  "appellant": [
    "Messrs DADA STEEL MILLS"
  ],
  "respondant": [
    "METALEXPORT",
    "Respondent No. 2",
    "Respondent No. 3",
    "Respondent No. 4",
    "Respondent No. 5",
    "Respondent No. 6"
  ],
  "accussed_details": [
    {
      "name": "METALEXPORT",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Seller",
      "allegation": [
        "Breach of agreement dated 24-10-1972",
        "Failure to deliver vessel 'S.S. Marbella'"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Khalid Anwar"
    ],
    "defense": []
  },
  "complaint_summary": "The appellant alleged breach of agreement dated 24-10-1972 by the respondent for failing to deliver the vessel 'S.S. Marbella' despite fulfilling contractual obligations, including opening an irrevocable letter of credit.",
  "investigation_summary": "The vessel was attached during the pendency of the suit and sold via auction to eliminate port and haulage charges. The appellant purchased the vessel at Rs. 65,05,299, with proceeds partially paid to the respondent and the balance invested by the Nazir of the Court.",
  "judgment_summary": "The court found the respondent committed a breach of contract but declined specific performance due to equity considerations. Damages of Rs. 20,36,628 were awarded, and the appellant was directed to deposit Rs. 14,41,271 with interest. On appeal, the court decreed specific performance, entitling the appellant to the amount lying in court.",
  "punishment": "Damages of Rs. 20,36,628 awarded; specific performance decreed on appeal.",
  "Decision_or_verdict": "Specific performance of the contract decreed; appellant entitled to the amount lying in court.",
  "legal_arguments": [
    "Appellant argued entitlement to compensation under Section 19 of the Specific Relief Act.",
    "Court considered precedents including AIR 1926 Born. 189, PLD 1970 Karachi 770, and others.",
    "Court analyzed Sections 73 of the Contract Act and 19 of the Specific Relief Act."
  ],
  "assets": [
    "Vessel 'S.S. Marbella'"
  ],
  "statutes": [
    "Specific Relief Act, 1877",
    "Contract Act, 1872"
  ],
  "sections": [
    "Section 73 of the Contract Act, 1872",
    "Section 19 of the Specific Relief Act, 1877"
  ],
  "citations": [
    "AIR 1926 Born. 189",
    "PLD 1970 Karachi 770",
    "1989 CLC 916",
    "1973 (1) All ER 897"
  ],
  "witnesses": [
    {
      "name": "Managing Partner of DADA STEEL MILLS",
      "role": "Appellant's witness"
    }
  ],
  "witness_statement": {
    "Managing Partner of DADA STEEL MILLS": "Testified that the vessel was purchased for use in the factory, not for selling scrap, and emphasized the business necessity of acquiring the vessel."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Specific Performance",
    "Breach of Contract",
    "Damages"
  ],
  "key_issues": [
    "Breach of agreement dated 24-10-1972",
    "Entitlement to specific performance",
    "Assessment of damages under Section 19 of the Specific Relief Act"
  ],
  "maxims": {
    "Equity": "Specific performance may be denied if it causes undue hardship to the defendant."
  },
  "legal_terms": {
    "Specific Performance": "A legal remedy requiring the breaching party to fulfill contractual obligations.",
    "Damages": "Monetary compensation awarded for loss or injury."
  },
  "words_and_phrases": {
    "Irrevocable Letter of Credit": "A financial instrument guaranteeing payment under specified conditions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Appellant sought specific performance of a contract for the purchase of a vessel. The court initially awarded damages but later decreed specific performance on appeal, entitling the appellant to the amount lying in court. Legal arguments centered on Sections 73 of the Contract Act and 19 of the Specific Relief Act."
}