{
  "case_title": "Messrs Shaheen Foundation (PAF) vs Commissioner-II, SRB, Karachi",
  "reference_no_or_id": "Appeal No. AT-38 of 2019",
  "judgment_date": "2019-05-16",
  "first_hearing_date": "N/A",
  "court": "Appellate Tribunal Inland Revenue",
  "bench_type": "Two-member bench",
  "judges": [
    "Nadeem Azhar Siddiqui",
    "Agha Kafeel Barik"
  ],
  "appellant": [
    "Messrs Shaheen Foundation (PAF)"
  ],
  "respondant": [
    "Commissioner-II, SRB, Karachi"
  ],
  "accussed_details": [
    {
      "name": "Messrs Shaheen Foundation (PAF)",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Registered entity under SRB",
      "allegation": [
        "Claiming and adjusting inadmissible input tax amounting to Rs.17,460,762",
        "Failure to attach necessary documents in Revision application"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Zaheer Hussain"
    ],
    "defense": [
      "Mr. Imran Hussain"
    ]
  },
  "complaint_summary": "The appellant was accused of claiming inadmissible input tax and failing to attach necessary documents in the Revision application filed under Section 55 of the Sindh Sales Tax on Services Act, 2011.",
  "investigation_summary": "The appellant's tax liability was initially determined at Rs.17,460,762, later revised to Rs.10,734,538, and finally reduced to Rs.7,691,986 after remand by the Tribunal. The appellant paid the revised amount but challenged the imposition of default surcharge and procedural irregularities in the rejection of its Revision application.",
  "judgment_summary": "The Tribunal remanded the case back to Commissioner-III, SRB, directing proper hearing and disposal of the Revision application on merits. The rejection letter dated 20-3-2019 was set aside due to procedural flaws, including lack of notice and denial of the right to hearing.",
  "punishment": "N/A",
  "Decision_or_verdict": "Case remanded to Commissioner-III for proper hearing and disposal.",
  "legal_arguments": [
    "Section 55 of the Sindh Sales Tax on Services Act, 2011 does not require filing of specific documents.",
    "Default surcharge cannot be imposed without establishing mens rea or willful default.",
    "Violation of principles of natural justice and audi alteram partem."
  ],
  "assets": [],
  "statutes": [
    "Sindh Sales Tax on Services Act, 2011"
  ],
  "sections": [
    "Section 15A(1)(g)(i)",
    "Section 43",
    "Section 44",
    "Section 45",
    "Section 55",
    "Section 57"
  ],
  "citations": [
    "2004 SCMR 456 (DG Khan Cement)",
    "2018 SCMR 939 (Pakistan v. Hazrat Hussain)",
    "PLD 1997 Karachi 1",
    "PLD 1981 Karachi 311"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Appeal No. AT-42/2018",
  "legal_categories": [
    "Tax Law",
    "Administrative Law",
    "Natural Justice"
  ],
  "key_issues": [
    "Procedural irregularities in rejection of Revision application",
    "Imposition of default surcharge without establishing mens rea",
    "Discrimination in waiver of default surcharge"
  ],
  "maxims": {
    "audi_alteram_partem": "No one can be condemned unheard."
  },
  "legal_terms": {
    "mens_rea": "Mental state of intent or knowledge of wrongdoing.",
    "quasi_judicial": "Actions or decisions made by administrative officers that resemble judicial proceedings."
  },
  "words_and_phrases": {
    "default_surcharge": "Additional charge imposed for non-compliance or delay in tax payment.",
    "revision_application": "Application for review of a decision by a higher authority."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around procedural irregularities in the rejection of a Revision application filed by Messrs Shaheen Foundation under Section 55 of the Sindh Sales Tax on Services Act, 2011. The Tribunal remanded the case to Commissioner-III for proper hearing and disposal, emphasizing adherence to principles of natural justice and due process."
}