{
  "case_title": "Messrs MAPLE LEAF CEMENT FACTORY LTD LAHORE vs COLLECTOR OF SALES TAX, FAISALABAD",
  "reference_no_or_id": "S.T.A. No,340/LB of 2009",
  "judgment_date": "2012-09-22",
  "first_hearing_date": "N/A",
  "court": "Appellate Tribunal Inland Revenue",
  "bench_type": "Two-member bench",
  "judges": [
    "Abdul Rauf",
    "Muhammad Nawaz Bajwah"
  ],
  "appellant": [
    "Messrs MAPLE LEAF CEMENT FACTORY LTD LAHORE"
  ],
  "respondant": [
    "COLLECTOR OF SALES TAX, FAISALABAD"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": [
        "Wrong adjustment of input tax",
        "Irregular timing of input tax adjustment",
        "Disallowance of input tax for non-taxable activities"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The appellant was accused of wrong adjustment of input tax paid on electricity bills for Phase-II against the output tax of Phase-I, violating section 8(4) of the Sales Tax Act, 1990. Additional tax and penalties were proposed for procedural lapses and disallowance of input tax for non-taxable activities.",
  "investigation_summary": "The Additional Collector issued a show cause notice and passed an order-in-original imposing penalties and additional tax. The appellant contested the decision, citing procedural lapses and legal clarifications issued by the Central Board of Revenue.",
  "judgment_summary": "The Tribunal accepted the appeal, holding that the appellant was justified in adjusting input tax for Phase-II against Phase-I after the cancellation of the second registration. Procedural lapses in timing of input tax adjustment and disallowance of input tax for non-taxable activities were deemed inadmissible.",
  "punishment": "Penalties and additional tax imposed by the adjudicating officer were deleted.",
  "Decision_or_verdict": "Appeal accepted. Adjustment of input tax allowed.",
  "legal_arguments": [
    "Clarification by CBR through Sales Tax General Order No. 10/1998",
    "Cancellation of second registration w.e.f. 27-6-1998",
    "Procedural lapses in input tax adjustment timing",
    "Input tax adjustment for electricity consumption within factory premises"
  ],
  "assets": [],
  "statutes": [
    "Sales Tax Act, 1990"
  ],
  "sections": [
    "Section 8(4)",
    "Section 34",
    "Section 33"
  ],
  "citations": [
    "2013 P T D (Trib.) 1800",
    "2000 PTD 1296",
    "2005 PTD (Trib.) 1358",
    "2006 PTD (Trib.) 196"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Tax Law",
    "Sales Tax Adjustment"
  ],
  "key_issues": [
    "Wrong adjustment of input tax",
    "Irregular timing of input tax adjustment",
    "Disallowance of input tax for non-taxable activities"
  ],
  "maxims": {},
  "legal_terms": {
    "Input Tax": "Tax paid on purchases used in taxable activities.",
    "Output Tax": "Tax collected on sales of taxable goods."
  },
  "words_and_phrases": {
    "Procedural Lapse": "An error or omission in following prescribed procedures.",
    "Taxable Activity": "Activities subject to sales tax under the law."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the adjustment of input tax paid on electricity bills for Phase-II against Phase-I output tax. The Tribunal ruled in favor of the appellant, citing procedural lapses and legal clarifications. Penalties and additional tax were deleted."
}