{
  "case_title": "Messrs LAL DIN AUTOPARTS (PVT.) LTD., LAHORE vs NATIONAL TARIFF COMMISSION, ISLAMABAD and another",
  "reference_no_or_id": "Appeal No. 118 of 2017",
  "judgment_date": "2019-05-14",
  "first_hearing_date": "N/A",
  "court": "Anti-Duping Appellate Tribunal",
  "bench_type": "Coram 2",
  "judges": [
    "Ahmed Owais Pirzada",
    "Mian Fasih-Ul-Mulk"
  ],
  "appellant": [
    "Messrs LAL DIN AUTOPARTS (PVT.) LTD., LAHORE"
  ],
  "respondant": [
    "NATIONAL TARIFF COMMISSION, ISLAMABAD",
    "Messrs Aisha Steel Mills Limited"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Legal Advisor for NATIONAL TARIFF COMMISSION"
    ],
    "defense": [
      "Counsel for Messrs LAL DIN AUTOPARTS (PVT.) LTD."
    ]
  },
  "complaint_summary": "The appellant challenged the Final Determination report issued by the National Tariff Commission on 13.01.2017, which imposed definitive anti-dumping duties on Cold Rolled Coils/Sheets (CRC) imported from China and Ukraine.",
  "investigation_summary": "The National Tariff Commission initiated an investigation on 16.07.2015 based on an application by Messrs Aisha Steel Mills Limited. A Preliminary Determination Report was issued on 12.01.2016, followed by a Final Determination Report on 13.01.2017, imposing definitive anti-dumping duties for five years.",
  "judgment_summary": "The appeal was dismissed. The Tribunal upheld the Commission's findings, stating that the investigation and determination complied with statutory requirements. Arguments regarding legal vacuum, improper appointments, and procedural violations were rejected based on prior judgments by higher courts.",
  "punishment": "Definitive anti-dumping duties imposed for five years on CRC imports from China and Ukraine.",
  "Decision_or_verdict": "Appeal dismissed.",
  "legal_arguments": [
    "Appellant argued that the Ordinance, 2015 was repealed, creating a legal vacuum.",
    "Appellant claimed the Commission's members were appointed unlawfully during the interregnum period.",
    "Appellant contended the investigation exceeded statutory time limits.",
    "Appellant alleged lack of necessary support from domestic producers for the application.",
    "Respondent argued that the Ordinance was extended retrospectively by the National Assembly.",
    "Respondent cited prior judgments validating the Commission's actions and appointments."
  ],
  "assets": [],
  "statutes": [
    "Anti-Dumping Duties Act, 2015",
    "Anti-Dumping Ordinance, 2000"
  ],
  "sections": [
    "Section 15",
    "Section 16",
    "Section 24",
    "Section 29",
    "Section 37",
    "Section 39"
  ],
  "citations": [
    "2020 P C T L R 476",
    "2019 P T D (Trib.) 2035",
    "WT/DS 405/R"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Appeal No. 118 of 2017",
  "legal_categories": [
    "Anti-Dumping",
    "Trade Law"
  ],
  "key_issues": [
    "Validity of Ordinance extension",
    "Lawfulness of Commission appointments",
    "Compliance with statutory investigation timelines",
    "Support from domestic producers for anti-dumping application",
    "Material injury assessment"
  ],
  "maxims": {
    "WTO Panel": "Absence of one or two injury factors does not necessarily mean no injury to the domestic industry."
  },
  "legal_terms": {
    "Anti-Dumping Duty": "A tariff imposed on imports to prevent dumping, which is selling goods below market value."
  },
  "words_and_phrases": {
    "Dumping Margin": "The difference between the export price and the normal value of a product.",
    "Material Injury": "Harm caused to a domestic industry due to unfair trade practices."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved an appeal against anti-dumping duties imposed on CRC imports from China and Ukraine. The appellant raised procedural and legal challenges, which were dismissed by the Tribunal based on compliance with statutory requirements and prior judicial validation."
}