{
  "case_title": "Mian Muhammad Nawaz Sharif vs Sardar Farooq Ahmad Khan Leghari",
  "reference_no_or_id": "Civil Miscellaneous Nos. 914-C, 915-C, 916-C and 917-C of 1995",
  "judgment_date": "1995-12-13",
  "first_hearing_date": "1995-12-12",
  "court": "Lahore High Court",
  "bench_type": "Principal Seat",
  "judges": [
    "Irshad Hasan Khan"
  ],
  "appellant": [
    "Mian Muhammad Nawaz Sharif"
  ],
  "respondant": [
    "Sardar Farooq Ahmad Khan Leghari"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Muhammad Akram Sheikh"
    ],
    "defense": [
      "Raja Muhammad Anwar"
    ]
  },
  "complaint_summary": "The appellant sought removal of a civil suit from the Senior Civil Judge, Islamabad, to the Lahore High Court under Section 24, C.P.C., citing administrative and jurisdictional concerns.",
  "investigation_summary": "No criminal investigation was conducted as the matter pertains to civil jurisdiction and procedural rules.",
  "judgment_summary": "The court dismissed the transfer application and revision petitions, ruling that the petitions must be filed at the Rawalpindi Bench as per Rule 3 of the Lahore High Court (Establishment of Benches) Rules, 1981.",
  "punishment": "N/A",
  "Decision_or_verdict": "Transfer application and revision petitions dismissed; petitions returned for filing at Rawalpindi Bench.",
  "legal_arguments": [
    "Rule 3 of the Lahore High Court (Establishment of Benches) Rules, 1981 mandates filing cases within the area assigned to a Bench.",
    "Islamabad is not part of Rawalpindi Civil Division but is assigned to Rawalpindi Bench.",
    "Rule 6 allows the Chief Justice to determine cases to be heard at the Principal Seat.",
    "Bias allegations against judges must be raised before the concerned judge first."
  ],
  "assets": [],
  "statutes": [
    "Section 24, C.P.C.",
    "Section 151, C.P.C.",
    "Article 1 of the Constitution of Pakistan",
    "Article 202 of the Constitution of Pakistan",
    "Article 270-A of the Constitution of Pakistan"
  ],
  "sections": [
    "Section 24, C.P.C.",
    "Section 151, C.P.C."
  ],
  "citations": [
    "PLD 1996 Lahore 92",
    "PLD 1995 SC 500",
    "PLD 1992 Lahore 342",
    "PLD 1995 Karachi 566",
    "1977 SCMR 514",
    "1992 SCMR 140"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "TA. No. 768-C of 1995",
  "legal_categories": [
    "Civil Procedure",
    "Jurisdiction"
  ],
  "key_issues": [
    "Jurisdiction of Lahore High Court Principal Seat vs Rawalpindi Bench",
    "Administrative discipline under Rule 3 of the Lahore High Court Rules",
    "Bias allegations against judges"
  ],
  "maxims": {
    "Equality before law": "All citizens are entitled to equal treatment under the Constitution."
  },
  "legal_terms": {
    "Interlocutory orders": "Temporary orders issued during the course of a legal proceeding.",
    "Transfer application": "A request to move a case from one court to another."
  },
  "words_and_phrases": {
    "Principal Seat": "The main location of the Lahore High Court.",
    "Bench": "A division of the High Court assigned to a specific geographical area."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves jurisdictional and procedural disputes regarding the filing and hearing of civil revision petitions and transfer applications. The Lahore High Court ruled that the petitions must be filed at the Rawalpindi Bench as per established rules, dismissing the appellant's request for hearing at the Principal Seat."
}