{
  "case_title": "MIR HASSAN AND ANOTHER vs DEPUTY REHABILITATION COMMISSIONER, ZHOB AND ANOTHER",
  "reference_no_or_id": "Constitutional Petition No, 33 of 1970",
  "judgment_date": "1980-04-26",
  "first_hearing_date": "1970-10-13",
  "court": "Balochistan High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Abdul Hayee Qureshi"
  ],
  "appellant": [
    "Mir Hassan",
    "Mir Gul"
  ],
  "respondant": [
    "Deputy Rehabilitation Commissioner, Zhob",
    "Mulla Khudai Nazar"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Azizullah Memon"
    ],
    "defense": [
      "Mr. S.H. Jaffri"
    ]
  },
  "complaint_summary": "Petitioners challenged two orders passed by the Deputy Rehabilitation Commissioner, Zhob, transferring evacuee property to respondent Mulla Khudai Nazar and ordering their ejectment.",
  "investigation_summary": "The Deputy Rehabilitation Commissioner transferred two evacuee properties to respondent Mulla Khudai Nazar under Settlement Scheme No, VII, which was later contested as invalid due to non-applicability of the scheme in Special Areas of Baluchistan.",
  "judgment_summary": "The court declared the transfer of property under Settlement Scheme No, VII invalid as the scheme was not extended to Special Areas. The subsequent ejectment order based on the invalid transfer was also declared void. Petitioners were denied relief for property transfer under the scheme.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition partly allowed; transfer and ejectment orders declared void.",
  "legal_arguments": [
    "Settlement Scheme No, VII was not applicable to Special Areas of Baluchistan.",
    "Section 7 and Section 8 of Baluchistan (Rehabilitation) Regulation II of 1950 were improperly invoked.",
    "Political Agent lacked authority under relevant regulations."
  ],
  "assets": [
    "Two evacuee Kutcha rural buildings (Nos. 30/F and 30/G)"
  ],
  "statutes": [
    "Displaced Persons (Compensation and Rehabilitation) Act, 1958",
    "Baluchistan (Rehabilitation) Regulation II of 1950",
    "Baluchistan Administration of Evacuee Property Regulation I of 1950"
  ],
  "sections": [
    "Section 7 of Baluchistan (Rehabilitation) Regulation II of 1950",
    "Section 8 of Baluchistan (Rehabilitation) Regulation II of 1950"
  ],
  "citations": [
    "P L D 1980 Quetta 43"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Evacuee Property",
    "Rehabilitation Law",
    "Constitutional Petition"
  ],
  "key_issues": [
    "Applicability of Settlement Scheme No, VII in Special Areas",
    "Authority of Political Agent under Rehabilitation Regulations",
    "Validity of property transfer and subsequent ejectment orders"
  ],
  "maxims": {},
  "legal_terms": {
    "Evacuee Property": "Property left behind by displaced persons during partition or migration.",
    "Rehabilitation Authority": "Government entity responsible for managing evacuee properties."
  },
  "words_and_phrases": {
    "Kutcha Rural Buildings": "Temporary or semi-permanent structures in rural areas.",
    "Special Areas": "Regions excluded from certain legislative applications."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved the invalid transfer of evacuee property under a non-applicable scheme and subsequent ejectment orders. The court ruled both actions void, citing lack of legal authority and improper application of regulations."
}