{
  "case_title": "MOHAMMAD NAWAZ And Other vs PIR RAKHSH And Other",
  "reference_no_or_id": "R.O.R. Nos. 1727,1728,1729 of 1987",
  "judgment_date": "1992-08-07",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Akhatar Said"
  ],
  "appellant": [
    "MOHAMMAD NAWAZ And Other"
  ],
  "respondant": [
    "PIR RAKHSH And Other"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "The respondents claimed ownership of the entire land based on mutation No.253 of 1945, which was never entered in the official records.",
  "investigation_summary": "The Additional Deputy Commissioner (Consolidation) accepted the respondents' appeal in 1985, ordering mutation No.253 to be implemented. This decision was upheld by the Additional Commissioner (Consolidation) in 1987, leading to the present revision petition.",
  "judgment_summary": "The court ruled that mutation No.253, not entered in the record of rights for over 40 years, cannot form the basis for consolidation. The revision petition was accepted, and the orders of the Additional Deputy Commissioner (Consolidation) and Additional Commissioner (Consolidation) were set aside.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision petition accepted; mutation No.253 excluded from consolidation.",
  "legal_arguments": [
    "Mutations are summary proceedings and cannot determine complex legal or factual issues.",
    "Long-standing entries in the record of rights are stronger evidence than unentered mutations.",
    "Consolidation authorities should not exceed their role by revisiting old records or mutations."
  ],
  "assets": [],
  "statutes": [
    "Law of Consolidation"
  ],
  "sections": [],
  "citations": [
    "K.L.R. 1992 Revenue Cases 52"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Revenue Law",
    "Land Disputes"
  ],
  "key_issues": [
    "Validity of mutation No.253 from 1945 not entered in records.",
    "Role and limits of consolidation authorities."
  ],
  "maxims": {},
  "legal_terms": {
    "Mutation": "A change or transfer of ownership in revenue records.",
    "Jamabandi": "A record of rights in land revenue."
  },
  "words_and_phrases": {
    "Consolidation": "The process of reorganizing land holdings for efficient use."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the validity of mutation No.253 from 1945, which was not entered in the record of rights. The court emphasized the importance of long-standing entries in revenue records over unentered mutations and restricted the role of consolidation authorities to avoid revisiting old records. The revision petition was accepted, and the disputed mutation was excluded from consideration."
}