{
  "case_title": "Mst. KARIM BIBI vs ABID ALI ETC.",
  "reference_no_or_id": "R. O. R. No, 1474 of 1966-67",
  "judgment_date": "1976-10-16",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Full Board",
  "judges": [
    "M. S. Chaudhry",
    "Zahur Azar",
    "Aslam Arab"
  ],
  "appellant": [
    "Mst. Karim Bibi"
  ],
  "respondant": [
    "Abid Ali",
    "Others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Mst. Karim Bibi challenged the termination of her tenancy rights under section 3 of the Muslim Personal Law (Shariat) Application Act, 1962, arguing that her rights were statutory under section 20(b) of the Colonization of Government Lands Act, 1912, and not governed by Customary Law.",
  "investigation_summary": "The case involved the interpretation of succession rights under section 20(b) of the Colonization of Government Lands Act, 1912, and whether these rights were affected by section 3 of the Muslim Personal Law (Shariat) Application Act, 1962.",
  "judgment_summary": "The court ruled that the Muslim Personal Law (Shariat) Application Act, 1962, does not abolish life interests held by females under section 20(b) of the Colonization of Government Lands Act, 1912. The succession to tenancy under section 20(b) is statutory and unaffected by the Shariat Act.",
  "punishment": "N/A",
  "Decision_or_verdict": "Reference answered accordingly. Mst. Karim Bibi's tenancy rights under section 20(b) were upheld.",
  "legal_arguments": [
    "Section 20(b) of the Colonization of Government Lands Act, 1912, provides statutory succession rights.",
    "Section 3 of the Muslim Personal Law (Shariat) Application Act, 1962, applies only to life estates under Customary Law.",
    "Precedents cited include P L D 1970 S C 580 and P L D 1971 Lab. 567."
  ],
  "assets": [],
  "statutes": [
    "Colonization of Government Lands Act, 1912",
    "Muslim Personal Law (Shariat) Application Act, 1962"
  ],
  "sections": [
    "Section 20(b) - Colonization of Government Lands Act, 1912",
    "Section 3 - Muslim Personal Law (Shariat) Application Act, 1962"
  ],
  "citations": [
    "P L D 1977 Rev. 54",
    "P L D 1970 S C 580",
    "P L D 1971 Lab. 567"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Succession Law",
    "Property Law",
    "Statutory Interpretation"
  ],
  "key_issues": [
    "Interpretation of section 20(b) of the Colonization of Government Lands Act, 1912.",
    "Applicability of section 3 of the Muslim Personal Law (Shariat) Application Act, 1962."
  ],
  "maxims": {},
  "legal_terms": {
    "Statutory Succession": "Succession rights defined by statute rather than Customary Law.",
    "Life Estate": "A property interest limited to the lifetime of the holder."
  },
  "words_and_phrases": {
    "Reward Grant": "Land granted as a reward under statutory provisions.",
    "Customary Law": "Traditional legal practices governing succession and property."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the interpretation of statutory succession rights under section 20(b) of the Colonization of Government Lands Act, 1912, and their immunity from section 3 of the Muslim Personal Law (Shariat) Application Act, 1962. The court upheld the statutory basis of Mst. Karim Bibi's tenancy rights."
}