{
  "case_title": "Mst. MUGHLAN And Others vs AMIR BADSHAH And OTHER",
  "reference_no_or_id": "R.O.R. No. 3447 of 1986",
  "judgment_date": "1988-06-07",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Sarfraz Hussain"
  ],
  "appellant": [
    "Mst. MUGHLAN And Others"
  ],
  "respondant": [
    "AMIR BADSHAH And OTHER"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioners challenged the adjustment of 40 Kanals of land from their Khata to the respondents' Wanda during consolidation proceedings, alleging improper condonation of delay and incorrect ownership determination by the Collector (Cons.).",
  "investigation_summary": "The case involved examination of land records, including Register Haqdaran Zameen 1979-80 and sketch maps prepared by the Patwari (Cons.), to determine rightful ownership and possession of disputed land parcels.",
  "judgment_summary": "The court accepted the revision petition, set aside the orders of the Additional Commissioner (Cons.) and Collector (Cons.), and restored the original consolidation scheme. The court found that the Collector (Cons.) had improperly condoned a 25-year delay and made adjustments without verifying the records.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision petition accepted; original consolidation scheme restored.",
  "legal_arguments": [
    "Petitioners argued that the disputed land (Khasra No. 5791/3201) was purchased and possessed by them since 1963 and was wrongly adjusted to the respondents.",
    "Respondents contended that the land was jointly purchased and owned by the petitioners and Imam Din, and the adjustments were in line with consolidation laws."
  ],
  "assets": [
    "40 Kanals of land (Khasra No. 5791/3201)"
  ],
  "statutes": [
    "Consolidation of Holdings Ordinance, 1960"
  ],
  "sections": [
    "Section 13 of the Consolidation of Holdings Ordinance, 1960"
  ],
  "citations": [
    "1988 C L C 2441"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Dispute",
    "Consolidation of Holdings"
  ],
  "key_issues": [
    "Improper condonation of delay in filing appeal.",
    "Incorrect ownership determination of disputed land."
  ],
  "maxims": {},
  "legal_terms": {
    "Wanda": "A term used in land consolidation referring to allocated land parcels.",
    "Tattima": "An adjustment or correction in land records."
  },
  "words_and_phrases": {
    "Khasra": "A land parcel number in revenue records.",
    "Khata": "A revenue record of land ownership."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around a land ownership dispute during consolidation proceedings. The petitioners successfully argued that the Collector (Cons.) improperly adjusted their land to the respondents' Wanda without verifying records and condoned a 25-year delay in appeal filing without justification. The court restored the original consolidation scheme."
}