{
  "case_title": "MUHAMMAD SIDDIQUE KHAN vs AZAD JAMMU AND KASHMIR GOVERNMENT Through Secretary Revenue, Azad Jammu And Kashmir, Muzaffarabad",
  "reference_no_or_id": "Appeal No. 235 of 1984",
  "judgment_date": "1987-02-07",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Sardar Muhammad Ashraf Khan",
    "Chaudhry Karam Dad Khan"
  ],
  "appellant": [
    "Muhammad Siddique Khan"
  ],
  "respondant": [
    "Azad Jammu and Kashmir Government Through Secretary Revenue"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Siddique Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Sadder Muhasib (Civil Servant)",
      "allegation": [
        "Challenging retirement order issued in public interest",
        "Claiming procedural unfairness in retirement process"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "The appellant challenged his retirement order issued by the Government, claiming it was not in public interest and procedural irregularities occurred, including lack of opportunity to present his case.",
  "investigation_summary": "The Government constituted a review committee to assess the appellant's retirement. The committee recommended retirement in public interest, and the appellant's review petition was rejected due to being filed beyond the prescribed time limit.",
  "judgment_summary": "The Tribunal dismissed the appeal, holding that the retirement order was issued in public interest and the appellant failed to challenge the final order within the stipulated time. The Tribunal found no evidence of mala fide intent or procedural violations.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "The appellant argued that his promotion indicated efficiency and fitness for service.",
    "The appellant contended that the retirement order was issued without giving him an opportunity to present his case.",
    "The respondent argued that the retirement was in public interest and the appellant failed to file a timely review petition."
  ],
  "assets": [],
  "statutes": [
    "Azad Jammu and Kashmir Service Tribunal Act",
    "Civil Servants Act"
  ],
  "sections": [
    "Section 4 of Azad Jammu and Kashmir Service Tribunal Act",
    "Section 12(ii) of Civil Servants Act"
  ],
  "citations": [
    "1987 P L C (C.S.) 604",
    "Fida Muhammad Rathore v. Azad Jammu and Kashmir 1983 P L C 256",
    "Mir Muhammad Sharif v. Azad Jammu and Kashmir Government P L D 1986 S C (AJ&K) 87"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "235 of 1984",
  "legal_categories": [
    "Civil Service",
    "Administrative Law"
  ],
  "key_issues": [
    "Timeliness of review petition",
    "Validity of retirement order issued in public interest",
    "Procedural fairness in retirement process"
  ],
  "maxims": {
    "Estoppel": "The appellant cannot accept part of the retirement order for benefits while rejecting other parts as uncommunicated."
  },
  "legal_terms": {
    "Public Interest": "Government's justification for retirement decisions.",
    "Final Order": "The first order passed by the competent authority on a review petition."
  },
  "words_and_phrases": {
    "Hot and Cold": "The appellant cannot simultaneously accept and reject parts of the same order."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The appellant, a civil servant, challenged his retirement order issued in public interest, claiming procedural unfairness and lack of opportunity to present his case. The Tribunal dismissed the appeal, citing the appellant's failure to file a timely review petition and lack of evidence of mala fide intent or procedural violations. The Tribunal upheld the Government's decision based on recommendations from a review committee."
}