{
  "case_title": "MUHAMMAD SADIQ KHAN, NAIB-TEHSILDAR vs AZAD GOVERNMENT OF STATE OF JAMMU AND KASHMIR Through Its Chief Secretary And Another",
  "reference_no_or_id": "Service Appeal No.158 of 1982",
  "judgment_date": "1986-11-23",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Tribunal",
  "judges": [
    "Muhammad Siddique Farooqi",
    "Khawaja Abdus Samad"
  ],
  "appellant": [
    "Muhammad Sadiq Khan"
  ],
  "respondant": [
    "Azad Government of State of Jammu and Kashmir Through Its Chief Secretary",
    "Another"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Sadiq Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Naib-Tehsildar",
      "allegation": [
        "Claiming seniority over respondent No.2 based on date of joining"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Khawaja Muhammad Saeed"
    ],
    "defense": []
  },
  "complaint_summary": "The appellant challenged the seniority decision and promotion of respondent No.2 to the post of Tehsildar, claiming seniority based on his date of joining.",
  "investigation_summary": "The appellant's claim was based on the tentative seniority list of 1979 and his date of joining. Respondent No.2 argued that seniority is determined by the date of selection and approval under Rule 9 of Azad Jammu and Kashmir Tehsildari and Naib-Tehsildari Rules, 1980.",
  "judgment_summary": "The tribunal dismissed the appeal, holding that seniority is determined by the date of selection and approval, not the date of joining. The appellant failed to challenge earlier promotion orders and was not entitled to preferential treatment.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "Rule 9 of Azad Jammu and Kashmir Tehsildari and Naib-Tehsildari Rules, 1980 governs seniority based on selection date.",
    "Appellant failed to challenge earlier promotion orders of other officers.",
    "Tentative seniority list of 1979 was incorrectly prepared."
  ],
  "assets": [],
  "statutes": [
    "Azad Jammu and Kashmir Tehsildari and Naib-Tehsildari Rules, 1980",
    "Punjab Tehsildari and Naib-Tehsildari Rules, 1962"
  ],
  "sections": [
    "Rule 9(1)(a)"
  ],
  "citations": [
    "1987 P L C (C. S.) 302",
    "1986 P L C (CS) 525",
    "1984 PLC 440",
    "1972 P L C 93"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "158 of 1982",
  "legal_categories": [
    "Service Law",
    "Seniority Dispute"
  ],
  "key_issues": [
    "Determination of seniority based on date of selection versus date of joining",
    "Failure to challenge earlier promotion orders",
    "Application of service rules from Punjab/West Pakistan in Azad Jammu and Kashmir"
  ],
  "maxims": {
    "Negligence Principle": "A person who is negligent and sleeps over his right cannot be given preference to one who is vigilant."
  },
  "legal_terms": {
    "Seniority": "The order of precedence among employees based on rules or criteria.",
    "Natural Justice": "Legal principles ensuring fair treatment."
  },
  "words_and_phrases": {
    "Tentative Seniority List": "A provisional list indicating the order of precedence among employees."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around a seniority dispute between Muhammad Sadiq Khan and respondent No.2 regarding the post of Tehsildar. The tribunal ruled that seniority is determined by the date of selection and approval under applicable rules, not the date of joining. The appellant's claim was dismissed due to failure to challenge earlier promotion orders and lack of merit in his arguments."
}