{
  "case_title": "MUHAMMAD YAQOOB vs PROVINCE OF SINDH through Secretary Home Department, Karachi and 7 others",
  "reference_no_or_id": "Constitutional Petition No. S-2070 of 2017",
  "judgment_date": "2018-03-02",
  "first_hearing_date": "N/A",
  "court": "Appellate Tribunal Sindh Revenue Board",
  "bench_type": "Single Bench",
  "judges": [
    "Agha Faisal"
  ],
  "appellant": [
    "Muhammad Yaqoob"
  ],
  "respondant": [
    "Province of Sindh through Secretary Home Department, Karachi",
    "7 others"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner, Muhammad Yaqoob, challenged the temporary custody of his minor daughter, Mariyam, granted to her mother (respondent No. 6) by the Sessions Judge, Hyderabad, under Section 491, Cr.P.C. He sought to have the custody order declared null and void and requested the court to hand over the minor's custody to him.",
  "investigation_summary": "The Sessions Judge, Hyderabad, determined that the mother, as the real guardian, was entitled to temporary custody of the minor based on the principle of 'Hizanat' under Muslim law. The court imposed conditions, including a P.R. Bond of Rs. 1,00,000 and restrictions on removing the minor from District Matiari.",
  "judgment_summary": "The petition was dismissed. The court upheld the Sessions Judge's order granting temporary custody to the mother, citing that the welfare of the minor was paramount. The court noted that the petitioner had already filed a Guardians and Wards Application, and the matter of permanent custody would be determined by the appropriate Family Court.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "The petitioner argued that the temporary custody order was unlawful and sought its annulment.",
    "The respondent argued that the mother had a preferential right to custody under Muslim law until the minor attains puberty.",
    "The court emphasized that the welfare of the minor is paramount and that temporary custody decisions do not prejudice the final determination by the Guardians and Wards Court."
  ],
  "assets": [],
  "statutes": [
    "Guardians and Wards Act, 1890",
    "Section 491, Cr.P.C."
  ],
  "sections": [
    "Section 491, Cr.P.C."
  ],
  "citations": [
    "2017 MLD 427 (Sindh)",
    "2016 PCr.LJ 44 [Lahore]",
    "PLD 2012 Supreme Court 758",
    "2001 SCMR 1782",
    "1983 SCMR 606"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Custody of Minors",
    "Guardianship",
    "Family Law"
  ],
  "key_issues": [
    "Whether the Sessions Judge had jurisdiction to grant temporary custody under Section 491, Cr.P.C.",
    "Whether the welfare of the minor was adequately considered in granting temporary custody to the mother.",
    "Whether the petitioner's rights were infringed by the temporary custody order."
  ],
  "maxims": {
    "Hizanat": "The preferential right of the mother to custody of a minor child under Muslim law."
  },
  "legal_terms": {
    "Temporary Custody": "Interim custody granted until a final determination by the appropriate court.",
    "Guardianship": "Legal responsibility for the care and management of a minor."
  },
  "words_and_phrases": {
    "Paramount Consideration": "The welfare of the minor is the most important factor in custody decisions."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "This case involves a custody dispute over a minor child. The Sessions Judge granted temporary custody to the mother, citing her preferential right under Muslim law and the welfare of the minor. The petitioner challenged this order, but the court dismissed the petition, emphasizing that the matter of permanent custody would be decided by the Guardians and Wards Court. The judgment underscores the principle that the welfare of the minor is paramount in custody matters."
}