{
  "case_title": "MUHAMMAD ALI And ANOTHER vs JAN MUHAMMAD And OTHER",
  "reference_no_or_id": "O.R. No. 403 of 1991",
  "judgment_date": "1992-08-30",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Single Bench",
  "judges": [
    "Ch. Talib Hussain"
  ],
  "appellant": [
    "Muhammad Ali",
    "Another"
  ],
  "respondant": [
    "Jan Muhammad",
    "Other"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The inheritance of Sardar Ahmad was mutated in favor of his widow, Mst. Maryam Begum, which was challenged by respondents Nos. 1 and 2 claiming entitlement as cousins of the deceased.",
  "investigation_summary": "The AC/Collector remanded the case for fresh mutation. Subsequent orders divided the inheritance into 1/4 for Mst. Maryam Begum and 3/4 for respondents Nos. 1 and 2. Petitioners filed a civil suit challenging the mutation and obtained a declaratory decree.",
  "judgment_summary": "The revision petition was disposed of with mutual consent of the parties, ensuring possession and mutation remain unaffected until the Civil Court's decision.",
  "punishment": "N/A",
  "Decision_or_verdict": "Order accordingly; possession and mutation remain unaffected until Civil Court decision.",
  "legal_arguments": [
    "Respondents Nos. 1 and 2 argued they were entitled to inheritance as cousins.",
    "Petitioners claimed ownership as purchasers of the suit land."
  ],
  "assets": [
    "Suit land"
  ],
  "statutes": [
    "Civil Procedure Code (C.P.C.)"
  ],
  "sections": [
    "Section 12(2) of C.P.C."
  ],
  "citations": [
    "1994 C L C 225"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Inheritance Law",
    "Civil Procedure"
  ],
  "key_issues": [
    "Validity of mutation order",
    "Inheritance rights of cousins",
    "Declaratory decree obtained by petitioners"
  ],
  "maxims": {},
  "legal_terms": {
    "Mutation": "The process of transferring ownership of property in revenue records.",
    "Declaratory Decree": "A court order that declares the rights of parties without ordering enforcement."
  },
  "words_and_phrases": {
    "Residuaries": "Legal heirs entitled to the remaining estate after specific bequests."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around inheritance rights and mutation orders following the death of Sardar Ahmad. Petitioners challenged the mutation favoring Mst. Maryam Begum, leading to multiple appeals and revisions. The court disposed of the revision petition with mutual consent, ensuring possession and mutation remain unaffected until the Civil Court's decision."
}