{
  "case_title": "Muhammad Ameen vs Deputy Commissioner Panjgur",
  "reference_no_or_id": "C.P. No. (T) 117 of 2022",
  "judgment_date": "2022-11-30",
  "first_hearing_date": "2022-06-08",
  "court": "Balochistan High Court",
  "bench_type": "Single Bench",
  "judges": [
    "Rozi Khan Barrech",
    "Abdul Hameed Baloch"
  ],
  "appellant": [
    "Muhammad Ameen"
  ],
  "respondant": [
    "Deputy Commissioner Panjgur"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "Learned AAG"
    ],
    "defense": [
      "Counsel for the petitioner (Name not provided)"
    ]
  },
  "complaint_summary": "Petitioner sought compensation for land affected by road construction in District Panjgur. Compensation for date trees was provided, but no compensation for land was granted. Petitioner alleged delay and non-resolution by the respondent.",
  "investigation_summary": "Petitioner failed to provide title documents for the land in question. Documents submitted included a judgment from Qazi Court dated 26.05.2009, which did not establish ownership. Government of Balochistan claimed ownership of the land.",
  "judgment_summary": "The court dismissed the petition, stating that the petitioner failed to establish clear legal ownership of the land. The matter was deemed unsuitable for adjudication under constitutional jurisdiction and recommended for resolution in a civil court.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "Petitioner failed to provide title documents.",
    "Disputed ownership of land requires adjudication in civil court.",
    "Constitutional jurisdiction under Article 199 requires clear legal rights without controversy."
  ],
  "assets": [],
  "statutes": [
    "Article 199 of the Constitution of Islamic Republic of Pakistan, 1973"
  ],
  "sections": [],
  "citations": [
    "2011 SCMR 1813",
    "2011 SCMR 848",
    "1990 MLD 563",
    "1990 MLD 344",
    "PLD 1992 Kar. 54",
    "PLD 1984 Lah. 223",
    "AIR 1953 Assam 155",
    "AIR 1953 Assam 145",
    "AIR 1953 Madh-B 165"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Constitutional Law",
    "Property Law"
  ],
  "key_issues": [
    "Disputed ownership of land",
    "Maintainability of petition under Article 199",
    "Compensation for land affected by road construction"
  ],
  "maxims": {
    "Legal Right": "A party seeking constitutional remedy must establish a clear legal right devoid of reasonable doubt or controversy."
  },
  "legal_terms": {
    "Constitutional Jurisdiction": "Jurisdiction exercised under Article 199 for expeditious remedies in cases of clear legal rights."
  },
  "words_and_phrases": {
    "Maintainability": "Suitability of a petition for adjudication under specific jurisdiction."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Petitioner sought compensation for land affected by road construction but failed to provide title documents. Court dismissed the petition, citing lack of clear legal ownership and recommended civil court adjudication."
}