{
  "case_title": "MUHAMMAD SHABBIR vs KHALID MEHMOOD and others",
  "reference_no_or_id": "R.O.R. No. 1968 of 1991",
  "judgment_date": "1993-08-19",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Hafeezullah Ishaq"
  ],
  "appellant": [
    "Muhammad Shabbir"
  ],
  "respondant": [
    "Khalid Mehmood",
    "Others"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Shabbir",
      "age": "N/A",
      "gender": "Male",
      "designation": "Petitioner",
      "allegation": [
        "Irregular allotment of Ihata No. 26 under Jinnah Abadi Scheme"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The petitioner challenged the restoration of Ihata No. 26 to its original classification for public use, claiming allotment under the Jinnah Abadi Scheme.",
  "investigation_summary": "The case involved irregularities in the allotment of Ihata No. 26, initially reserved for public use. The petitioner's father applied for a change in classification, which was approved without proper consultation. The petitioner later obtained possession and allotment under the Jinnah Abadi Scheme despite legal restrictions and ongoing litigation.",
  "judgment_summary": "The court dismissed the revision petition, citing irregularities in the allotment process and the petitioner's ineligibility under the Jinnah Abadi Scheme. The original classification of Ihata No. 26 for public use was upheld.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision dismissed with costs.",
  "legal_arguments": [
    "Petitioner argued eligibility under clause (g) of the Jinnah Abadi Act.",
    "Respondents contended the petitioner's ineligibility due to ownership of other properties and irregularities in the allotment process."
  ],
  "assets": [
    "Ihata No. 26 (19 Marlas 5 Sarsahis)"
  ],
  "statutes": [
    "West Pakistan Land Revenue Act, 1967",
    "Colonization of Government Lands (Punjab) Act, 1912",
    "Jinnah Abadi Act, 1986"
  ],
  "sections": [
    "Section 164 of West Pakistan Land Revenue Act, 1967",
    "Section 7 of Colonization of Government Lands (Punjab) Act, 1912",
    "Section 3 of Jinnah Abadi Act, 1986"
  ],
  "citations": [
    "PLD 1994 Revenue 1"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Revenue",
    "Property Disputes"
  ],
  "key_issues": [
    "Irregular allotment of land under Jinnah Abadi Scheme",
    "Eligibility criteria under Jinnah Abadi Act",
    "Restoration of land classification for public use"
  ],
  "maxims": {},
  "legal_terms": {
    "Mutation": "The process of transferring ownership of property in revenue records.",
    "Dera Deh Attiadaran": "Land reserved for public use in villages."
  },
  "words_and_phrases": {
    "Ex parte": "Legal proceedings conducted without one party being present."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the disputed allotment of Ihata No. 26, initially reserved for public use, under the Jinnah Abadi Scheme. The court dismissed the revision petition due to irregularities and upheld the original classification for public use."
}