{
  "case_title": "MUHAMMAD INAYAT vs MANZOOR AHMED DHUDRA, ADVOCATE, GUJRAT",
  "reference_no_or_id": "File No. 194 of 1998",
  "judgment_date": "2003-01-03",
  "first_hearing_date": "1998-10-24",
  "court": "Bar Council Tribunal",
  "bench_type": "Disciplinary Tribunal",
  "judges": [
    "Nasim Sikandar",
    "Arif Chaudhry",
    "Nusrat Javaid Bajwa"
  ],
  "appellant": [
    "Muhammad Inayat"
  ],
  "respondant": [
    "Manzoor Ahmed Dhadra, Advocate, Gujrat"
  ],
  "accussed_details": [
    {
      "name": "Manzoor Ahmed Dhadra",
      "age": "N/A",
      "gender": "Male",
      "designation": "Advocate, District Bar Association, Gujrat",
      "allegation": [
        "Professional misconduct",
        "Illegal gratification of Rs. 3,70,000"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": []
  },
  "complaint_summary": "Muhammad Inayat alleged that Manzoor Ahmed Dhadra deceitfully took Rs. 4 lacs for securing acquittal in a murder case involving the complainant's son and nephew. The respondent later denied the allegations and refused to return the money.",
  "investigation_summary": "The complaint was diarized on 28-07-1998. Witnesses Ghulam Muhammad and Muhammad Nawaz confirmed the payment of Rs. 3,70,000 to the respondent. The respondent denied the allegations and provided inconsistent defenses, including political rivalry and procedural objections.",
  "judgment_summary": "The Tribunal found Manzoor Ahmed Dhadra guilty of professional misconduct. He was removed from practice, and his name was ordered to be struck off the roll of advocates. The complainant was advised to seek civil and criminal remedies for recovery of the disputed amount.",
  "punishment": "Removal from practice; name struck off the roll of advocates.",
  "Decision_or_verdict": "Guilty of professional misconduct.",
  "legal_arguments": [
    "Discrepancy in the alleged amount (Rs. 4 lacs vs Rs. 3,70,000)",
    "Special oath taken by complainant and witness confirming payment",
    "Respondent's inconsistent defense claims, including political rivalry"
  ],
  "assets": [
    "Landed property worth millions claimed by respondent",
    "Donation of Rs. 50,000 to District Bar Clerk"
  ],
  "statutes": [
    "Punjab Bar Council Rules"
  ],
  "sections": [
    "Section 302/34, Pakistan Penal Code (PPC)"
  ],
  "citations": [
    "2003 MLD 1027"
  ],
  "witnesses": [
    "Ghulam Muhammad",
    "Muhammad Nawaz"
  ],
  "witness_statement": {
    "Ghulam Muhammad": "Confirmed payment of Rs. 3,70,000 to respondent.",
    "Muhammad Nawaz": "Confirmed presence during payment; denied prior statement before Disciplinary Committee."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Professional misconduct",
    "Disciplinary proceedings"
  ],
  "key_issues": [
    "Illegal gratification",
    "Professional misconduct",
    "Contradictions in defense statements"
  ],
  "maxims": {
    "Special oath": "Used to resolve disputes under fear of divine accountability."
  },
  "legal_terms": {
    "Professional misconduct": "Violation of ethical and professional standards by an advocate."
  },
  "words_and_phrases": {
    "Illegal gratification": "Unlawful payment made to influence a decision."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved allegations of professional misconduct against Advocate Manzoor Ahmed Dhadra, who was accused of taking illegal gratification to influence a murder trial. Witnesses corroborated the payment, and the respondent's inconsistent defenses were rejected. The Tribunal found him guilty and removed him from practice."
}