{
  "case_title": "MUHAMMAD NAWAZ Und 3 Other vs MUHAMMAD IKHLAQ Etc",
  "reference_no_or_id": "R.O.R. No. 920, 931, 1127 of 1990 and R.O.R. No. 1462 of 1991",
  "judgment_date": "1992-04-28",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Akhtar Said"
  ],
  "appellant": [
    "Muhammad Nawaz",
    "3 Others"
  ],
  "respondant": [
    "Muhammad Ikhlaq",
    "Etc"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Dispute over succession and appointment of Lambardar under rules 17 and 19 of the Land Revenue Act.",
  "investigation_summary": "The case involved the interpretation of rules 17 and 19 of the Land Revenue Act regarding succession of Lambardar. Sanaullah, the outgoing Lambardar, was erroneously considered 'temporary' by the Deputy Commissioner and Commissioner, leading to misapplication of rule 17 instead of rule 19(2).",
  "judgment_summary": "The court ruled that Sanaullah was a permanent Lambardar, and succession should be governed by rule 19(2) under primogeniture. Naseer Ahmad, the eldest grandson of Sanaullah, was appointed Lambardar. The petitions of Muhammad Nawaz and others were rejected.",
  "punishment": "N/A",
  "Decision_or_verdict": "Revision petition of Naseer Ahmad accepted; he is appointed Lambardar. Petitions of Muhammad Nawaz and others rejected.",
  "legal_arguments": [
    "Rule 17 applies to first appointments and does not distinguish between estates owned by Government or private individuals.",
    "Rule 19 governs succession and differentiates based on estate ownership.",
    "The terms 'temporary' and 'permanent' Lambardar are not recognized in the Land Revenue Act."
  ],
  "assets": [],
  "statutes": [
    "Land Revenue Act"
  ],
  "sections": [
    "Rule 17",
    "Rule 19"
  ],
  "citations": [
    "K.L.R. 1993 Revenue Cases 115"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Succession Law",
    "Land Revenue"
  ],
  "key_issues": [
    "Interpretation of rules 17 and 19 of the Land Revenue Act.",
    "Succession of Lambardar under primogeniture."
  ],
  "maxims": {},
  "legal_terms": {
    "Lambardar": "A village headman responsible for revenue collection and administrative duties.",
    "Primogeniture": "The right of succession belonging to the firstborn child."
  },
  "words_and_phrases": {
    "Temporary Lambardar": "Not recognized under the Land Revenue Act.",
    "Permanent Lambardar": "A Lambardar appointed under rule 17 and considered permanent."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The judgment clarified the legal interpretation of rules 17 and 19 of the Land Revenue Act, emphasizing that the terms 'temporary' and 'permanent' Lambardar are not recognized. Succession was determined under rule 19(2) based on primogeniture, leading to the appointment of Naseer Ahmad as Lambardar."
}