{
  "case_title": "MUHAMMAD KHAN vs GOVERNMENT OF WEST PAKISTAN AND OTHERS",
  "reference_no_or_id": "Civil Revision No, 53 of 1957/BWP",
  "judgment_date": "1971-04-30",
  "first_hearing_date": "1963-04-30",
  "court": "Baghdad-ul-Jadid",
  "bench_type": "Single Bench",
  "judges": [
    "Anwar-ul-Haq"
  ],
  "appellant": [
    "Muhammad Khan"
  ],
  "respondant": [
    "Government of West Pakistan",
    "Defendants Nos. 2 to 19"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Khan",
      "age": "N/A",
      "gender": "Male",
      "designation": "Petitioner",
      "allegation": [
        "Failure to pay sale price of auctioned agricultural land",
        "Non-compliance with auction terms"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Muhammad Khan filed a suit for possession of agricultural land measuring 461 kanals and 4 marlas, claiming he was wrongfully dispossessed after failing to pay the auction price and subsequent installments.",
  "investigation_summary": "The petitioner purchased state agricultural land between 1951 and 1954 but failed to pay the sale price as per auction terms. The Collector resumed the land and re-auctioned it to other respondents, forfeiting Rs. 10,000 deposited by the petitioner.",
  "judgment_summary": "The court dismissed the petitioner's suit, holding that the Collector acted within his authority to resume and re-auction the land due to non-payment. The review application was also rejected, as no sufficient grounds for review were found.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition dismissed",
  "legal_arguments": [
    "Error apparent on the face of the record regarding Provincial Government's written statement",
    "No notice required before resumption and re-auction under auction terms",
    "Petitioner deemed tenant under sections 10 and 15 of the Colonization of Government Lands Act"
  ],
  "assets": [
    "461 kanals and 4 marlas of agricultural land",
    "Rs. 10,000 forfeited"
  ],
  "statutes": [
    "Colonization of Government Lands Act"
  ],
  "sections": [
    "Section 10",
    "Section 15",
    "Section 24"
  ],
  "citations": [
    "P L D 1970 S C 506",
    "P L D 1971 Baghdad-ul-Jadid 53"
  ],
  "witnesses": [
    "N/A"
  ],
  "witness_statement": {},
  "appeal_number": "366 of 1962",
  "legal_categories": [
    "Civil Procedure",
    "Land Disputes"
  ],
  "key_issues": [
    "Non-payment of auction installments",
    "Collector's authority to resume and re-auction land",
    "Applicability of tenant rights under Colonization of Government Lands Act"
  ],
  "maxims": {
    "Ejusdem Generis": "Applied to interpret 'sufficient reason' in review provisions."
  },
  "legal_terms": {
    "Review": "A judicial re-examination of the case under Order XLVII, Rule 1 of the Code of Civil Procedure.",
    "Revision": "A supervisory jurisdiction exercised under Section 115 of the Code of Civil Procedure."
  },
  "words_and_phrases": {
    "Error apparent on the face of the record": "A mistake visible without detailed examination.",
    "Tenant of State land": "A legal status under the Colonization of Government Lands Act."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the petitioner's failure to comply with auction terms for agricultural land, leading to its resumption and re-auction by the Collector. The court upheld the Collector's authority and dismissed the petitioner's suit and subsequent review application."
}