{
  "case_title": "MUHAMMAD RAFIQUE vs AZAD GOVERNMENT OF THE STATE OF JAMMU & KASHMIR",
  "reference_no_or_id": "Appeal No, 93 of 1979",
  "judgment_date": "1983-10-15",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Service Tribunal",
  "judges": [
    "Sardar Muhammad Ashraf Khan",
    "Khawaja Ghulam Qadir"
  ],
  "appellant": [
    "Muhammad Rafique"
  ],
  "respondant": [
    "Azad Government of the State of Jammu & Kashmir"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Rafique",
      "age": "N/A",
      "gender": "Male",
      "designation": "Lecturer in Education Department",
      "allegation": [
        "Misconduct",
        "Inefficiency",
        "Failure to maintain strict control over subordinates leading to leakage of question papers"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Muhammad Rafique was accused of misconduct and inefficiency during his tenure as Secrecy Officer at the Azad Jammu and Kashmir Board of Intermediate and Secondary Education, Mirpur, resulting in the leakage of question papers.",
  "investigation_summary": "A Commission of Inquiry was appointed under Section 3 of the Commission of Inquiries Act to investigate allegations against officials of the Board. The Commission submitted a report leading to a show-cause notice issued to the appellant under Rule 6(b) of the Azad Jammu and Kashmir Civil Servants (Efficiency and Discipline) Rules, 1977.",
  "judgment_summary": "The Tribunal found procedural lapses in the handling of the appellant's case, including failure to conduct a proper inquiry under Rule 7 of the Efficiency and Discipline Rules, 1977. The impugned order of removal from service was set aside, and the case was remanded for further proceedings.",
  "punishment": "Removal from service (set aside upon appeal)",
  "Decision_or_verdict": "Appeal accepted; case remanded for proper inquiry under Rule 6(2) of the Efficiency and Discipline Rules, 1977.",
  "legal_arguments": [
    "Commission of Inquiry Act, 1956 was improperly invoked.",
    "Violation of natural justice principles during inquiry proceedings.",
    "Failure to conduct a detailed inquiry under Rule 7 of the Efficiency and Discipline Rules, 1977.",
    "Sub-rules (3) and (4) of Rule 6 alleged to be ultra vires of Fundamental Right No. 15 of the Interim Constitution Act, 1974."
  ],
  "assets": [],
  "statutes": [
    "Commission of Inquiries Act, 1956",
    "Azad Jammu and Kashmir Civil Servants (Efficiency and Discipline) Rules, 1977",
    "Azad Jammu and Kashmir Interim Constitution Act, 1974"
  ],
  "sections": [
    "Section 3 of Commission of Inquiries Act",
    "Rule 6(b) of Efficiency and Discipline Rules, 1977",
    "Rule 7 of Efficiency and Discipline Rules, 1977"
  ],
  "citations": [
    "1984 P L C (C.S.) 176",
    "P L D 1981 (C S) 877",
    "A I R 1953 S C 404",
    "A I R 1958 S C 538"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "93 of 1979",
  "legal_categories": [
    "Service Law",
    "Disciplinary Proceedings",
    "Constitutional Law"
  ],
  "key_issues": [
    "Procedural lapses in disciplinary proceedings",
    "Validity of sub-rules under Efficiency and Discipline Rules, 1977",
    "Violation of natural justice principles"
  ],
  "maxims": {
    "Equality before law": "Fundamental Right No. 15 under Interim Constitution Act, 1974"
  },
  "legal_terms": {
    "Misconduct": "Improper or unethical behavior by a civil servant.",
    "Inefficiency": "Failure to perform duties effectively as defined under Efficiency and Discipline Rules, 1977."
  },
  "words_and_phrases": {
    "Prima facie proof": "Evidence sufficient to establish a fact unless rebutted.",
    "Ultra vires": "Beyond the powers or authority."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The appellant challenged his removal from service on grounds of procedural irregularities and violation of fundamental rights. The Tribunal found merit in his arguments, particularly regarding the failure to conduct a proper inquiry, and remanded the case for further proceedings."
}