{
  "case_title": "MUHAMMAD SHARIF vs Syed CHIRAGH SHAH",
  "reference_no_or_id": "R. 0. A. No, 626 of 1978-79",
  "judgment_date": "1979-06-24",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Syed Naseer Ahmad"
  ],
  "appellant": [
    "MUHAMMAD SHARIF"
  ],
  "respondant": [
    "Syed CHIRAGH SHAH"
  ],
  "accussed_details": [
    {
      "name": "Syed CHIRAGH SHAH",
      "age": "N/A",
      "gender": "Male",
      "designation": "Declarant",
      "allegation": [
        "Failure to submit declaration under subsection (1) of section 7 of the Punjab Land Reforms Act, 1977"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The respondent failed to submit a declaration under subsection (1) of section 7 of the Punjab Land Reforms Act, 1977, leading to proceedings for resumption of excess land.",
  "investigation_summary": "The Deputy Land Commissioner initiated proceedings under subsection (5) of section 7, determined the respondent's holding, and ordered resumption of excess land. The respondent's review petition was rejected, but his choice to surrender specific land was later accepted by the Land Commissioner.",
  "judgment_summary": "The appeal was dismissed as the transaction of land transfer was deemed void under section 6 of the Punjab Land Reforms Act, 1977. The court upheld the Land Commissioner's decision and advised the petitioners to seek remedy in civil court.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal dismissed",
  "legal_arguments": [
    "The appeal was time-barred.",
    "The appellants argued they were bona fide purchasers of the land.",
    "The respondent's counsel argued the land transfer was void under section 6 of the Punjab Land Reforms Act, 1977."
  ],
  "assets": [
    {
      "description": "Land measuring 72 kanals and 19 marlas in village Muhammadpur, Nauabad, Tehsil Pakpattan, Sahiwal District",
      "status": "Resumed by Land Commissioner"
    },
    {
      "description": "Land measuring 110 kanals and 14 marlas in village Jumman Shah, Tehsil Pakpattan",
      "status": "Surrendered by respondent"
    }
  ],
  "statutes": [
    "Punjab Land Reforms Act, 1977"
  ],
  "sections": [
    "Section 7(1)",
    "Section 7(5)",
    "Section 6"
  ],
  "citations": [
    "P L D 1980 Rev, 5"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Reforms",
    "Property Law"
  ],
  "key_issues": [
    "Validity of land transfer under the Punjab Land Reforms Act, 1977",
    "Time-barred appeal",
    "Rights of bona fide purchasers"
  ],
  "maxims": {
    "ab initio": "From the beginning; the land transfer was void from the commencement of the Act."
  },
  "legal_terms": {
    "Declarant": "A person required to declare their land holdings under the Land Reforms Act.",
    "Mutation": "The process of transferring ownership in revenue records."
  },
  "words_and_phrases": {
    "Time-barred": "An appeal filed beyond the prescribed limitation period.",
    "Resumption": "The act of reclaiming excess land under the Land Reforms Act."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the resumption of excess land under the Punjab Land Reforms Act, 1977. The respondent's failure to submit a declaration led to proceedings, and his choice to surrender specific land was accepted. The appeal was dismissed as the land transfer was deemed void under section 6 of the Act."
}