{
  "case_title": "MUSA KHAN SILACHI vs PROVINCE OF BALUCHISTAN AND ANOTHER",
  "reference_no_or_id": "Criminal Revision No. 8 of 1976, Appeal No. 13 of 1977",
  "judgment_date": "1978-06-14",
  "first_hearing_date": "N/A",
  "court": "Balochistan Service Tribunal",
  "bench_type": "Coram",
  "judges": [
    "Abdul Qadeer Chaudhry",
    "Muhammad Hassan Baluch",
    "Bahlul Khan Nasir"
  ],
  "appellant": [
    "MUSA KHAN SILACHI"
  ],
  "respondant": [
    "PROVINCE OF BALUCHISTAN",
    "Federal Government"
  ],
  "accussed_details": [
    {
      "name": "MUSA KHAN SILACHI",
      "age": "N/A",
      "gender": "Male",
      "designation": "Superintendent of Police (S.P.), Anti-Corruption",
      "allegation": [
        "Built large property",
        "Running a bus in the name of his father",
        "Corruption and misconduct under Government Servants (Efficiency and Discipline) Rules, 1973"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Assistant Advocate-General"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The appellant was accused of corruption and misconduct, including building large property and running a bus business under his father's name.",
  "investigation_summary": "The appellant was served a show-cause notice by the Federal Government under Government Servants (Efficiency and Discipline) Rules, 1973. He denied all allegations, but was compulsorily retired by the President of Pakistan without further proceedings.",
  "judgment_summary": "The Tribunal ruled that the appellant was a provincial employee, not a federal employee, and the President of Pakistan lacked the authority to retire him. The retirement order was declared ultra vires and set aside.",
  "punishment": "Compulsory retirement order set aside.",
  "Decision_or_verdict": "Appeal allowed. Retirement order declared ultra vires.",
  "legal_arguments": [
    "Definition of 'Civil Servant' under Civil Servants Act, 1973 and Baluchistan Civil Servants Act, 1973",
    "Notification dated 14-9-1973 regarding All Pakistan Unified Grades",
    "Office Memorandum issued by Establishment Division on 31st May, 1975",
    "Provisions of the Constitution regarding provincial and federal services"
  ],
  "assets": [
    "Large property allegedly built by appellant",
    "Bus business allegedly run under appellant's father's name"
  ],
  "statutes": [
    "Civil Servants Act, 1973",
    "Baluchistan Civil Servants Act, 1973",
    "Government Servants (Efficiency and Discipline) Rules, 1973"
  ],
  "sections": [
    "Section 2(b) of Civil Servants Act, 1973",
    "Section 2(b) of Baluchistan Civil Servants Act, 1973"
  ],
  "citations": [
    "1980 P L C (C. S.) 70"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "13 of 1977",
  "legal_categories": [
    "Administrative Law",
    "Service Law"
  ],
  "key_issues": [
    "Jurisdiction of the Tribunal",
    "Authority of the President of Pakistan to retire provincial employees",
    "Definition and scope of 'Civil Servant'"
  ],
  "maxims": {
    "Ultra vires": "Acts beyond the legal authority of the entity performing them are invalid."
  },
  "legal_terms": {
    "Civil Servant": "A person employed in connection with the affairs of the Federation or a Province."
  },
  "words_and_phrases": {
    "Administrative Control": "Control over administrative matters, not necessarily including dismissal or retirement authority."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The appellant, a Superintendent of Police, was compulsorily retired by the President of Pakistan under allegations of corruption and misconduct. The Tribunal ruled that the appellant was a provincial employee, not a federal employee, and the President lacked the authority to retire him. The retirement order was declared ultra vires and set aside."
}