{
  "case_title": "MUSTAFA KAMAL vs GHULAM SABIR, ADVOCATE DISTRICT BAR ASSOCIATION, PESHAWAR",
  "reference_no_or_id": "Case No.T-7 of 2000",
  "judgment_date": "2003-12-13",
  "first_hearing_date": "1998-12-29",
  "court": "Bar Council Tribunal",
  "bench_type": "Disciplinary Tribunal",
  "judges": [
    "Muhammad Qaim Jan Khan",
    "Muhammad Alam Khan",
    "Saeed Akhtar"
  ],
  "appellant": [
    "Mustafa Kamal"
  ],
  "respondant": [
    "Ghulam Sabir"
  ],
  "accussed_details": [
    {
      "name": "Ghulam Sabir",
      "age": "N/A",
      "gender": "Male",
      "designation": "Advocate, District Bar Association, Peshawar",
      "allegation": [
        "Professional misconduct",
        "Violation of canons of conduct for Advocates",
        "Dishonest withdrawal of legal notice without client instructions"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Raham Badshah Khattak"
    ],
    "defense": [
      "Muhammad Lateef"
    ]
  },
  "complaint_summary": "Mustafa Kamal alleged that Ghulam Sabir, his engaged Advocate, dishonestly withdrew a legal notice sent to the State Life Insurance Corporation of Pakistan without his instructions, violating professional ethics and betraying client trust.",
  "investigation_summary": "The Disciplinary Committee of the N.W.F.P. Bar Council initiated proceedings, during which Ghulam Sabir admitted issuing and withdrawing the notice but claimed actions were done on behalf of Abdul Waheed Khan Advocate. Evidence was reviewed, and the matter was referred to the Tribunal for final adjudication.",
  "judgment_summary": "The Tribunal found Ghulam Sabir guilty of professional misconduct for withdrawing a legal notice without client instructions and ordered his suspension from the legal profession for two years. He was directed to pay Rs.48,840 to the complainant and Rs.5,000 as costs of proceedings.",
  "punishment": "Suspension from legal profession for two years; payment of Rs.48,840 to complainant and Rs.5,000 as costs.",
  "Decision_or_verdict": "Guilty of professional misconduct; suspension and monetary penalties imposed.",
  "legal_arguments": [
    "Prosecution argued that withdrawal of notice without client instructions constituted misconduct.",
    "Defense claimed actions were performed in good faith for Abdul Waheed Khan Advocate and denied client relationship.",
    "Tribunal rejected defense arguments due to lack of evidence supporting claims."
  ],
  "assets": [],
  "statutes": [
    "Legal Practitioner and Bar Council Act, 1973",
    "Legal Practitioner and Bar Council Rules, 1976"
  ],
  "sections": [
    "Section 44(3)(b) of Legal Practitioner and Bar Councils Act, 1973"
  ],
  "citations": [
    "2004 M L D 809"
  ],
  "witnesses": [
    "Mustafa Kamal",
    "Ghulam Sabir"
  ],
  "witness_statement": {
    "Mustafa Kamal": "Denied giving instructions for withdrawal of notice.",
    "Ghulam Sabir": "Claimed actions were performed on behalf of Abdul Waheed Khan Advocate."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Professional Misconduct",
    "Legal Ethics"
  ],
  "key_issues": [
    "Withdrawal of legal notice without client instructions",
    "Violation of professional ethics",
    "Existence of client-counsel relationship"
  ],
  "maxims": {
    "Nemo debet esse judex in propria causa": "No one should be a judge in their own cause."
  },
  "legal_terms": {
    "Professional Misconduct": "Improper or unethical conduct by a professional in their duties.",
    "Jural Relationship": "Legal relationship between parties."
  },
  "words_and_phrases": {
    "Good Faith": "Honest intention without intent to defraud.",
    "Ulterior Motive": "Hidden intention behind an action."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved allegations of professional misconduct against Ghulam Sabir Advocate for withdrawing a legal notice without client instructions. The Tribunal found him guilty, imposed a two-year suspension, and ordered monetary penalties."
}