{
  "case_title": "NABI BAKHSH and others vs HOTE MUHAMMAD and others",
  "reference_no_or_id": "Review No,n of 1987",
  "judgment_date": "1989-02-20",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue, Punjab",
  "bench_type": "Single Bench",
  "judges": [
    "Javed Ahmad Qureshi"
  ],
  "appellant": [
    "NABI BAKHSH and others"
  ],
  "respondant": [
    "HOTE MUHAMMAD and others"
  ],
  "accussed_details": [
    {
      "name": "NABI BAKHSH",
      "age": "N/A",
      "gender": "Male",
      "designation": "Petitioner",
      "allegation": [
        "Filed review petition challenging the decision of the Board of Revenue."
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Petitioners filed a review petition under Section 8 of the Board of Revenue Act, 1957, challenging the order dated 10-2-1987, which accepted the revision petition of the respondents.",
  "investigation_summary": "The case involved disputes over amendments in Khatas as part of a Consolidation Scheme. Petitioners claimed they were not given a fair hearing and sought to amend the list of parties involved.",
  "judgment_summary": "The court rejected the review petition, noting that petitioners Nos. 2 to 9 had submitted affidavits stating satisfaction with the prior decision. The review petition was deemed infructuous.",
  "punishment": "N/A",
  "Decision_or_verdict": "Review petition rejected.",
  "legal_arguments": [
    "Petitioners argued they were not afforded an opportunity of being heard and the case was decided ex parte.",
    "Respondents contended that petitioners Nos. 2 to 9 were satisfied with the prior decision and did not file the review petition."
  ],
  "assets": [],
  "statutes": [
    "Board of Revenue Act, 1957"
  ],
  "sections": [
    "Section 8"
  ],
  "citations": [
    "P L D 1989 Revenue 22"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Revenue Law",
    "Consolidation Scheme"
  ],
  "key_issues": [
    "Whether the petitioners were denied a fair hearing.",
    "Whether the amendments in Khatas were justified under the Consolidation Scheme."
  ],
  "maxims": {},
  "legal_terms": {
    "Consolidation Scheme": "A legal process to reorganize land holdings for efficiency.",
    "Khatas": "Land records or accounts."
  },
  "words_and_phrases": {
    "Ex parte": "A decision made without one party being present."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around a review petition filed under Section 8 of the Board of Revenue Act, 1957, challenging amendments in land records as part of a Consolidation Scheme. The court rejected the petition, citing affidavits from petitioners Nos. 2 to 9 expressing satisfaction with the prior decision. Legal arguments focused on procedural fairness and the validity of amendments under the scheme."
}