{
  "case_title": "NAZIR AHMAD vs THE STATE through Executive District Officer (Revenue), Vehari and another",
  "reference_no_or_id": "R.O.R. No,267 of 2009",
  "judgment_date": "2010-01-06",
  "first_hearing_date": "N/A",
  "court": "Board of Revenue",
  "bench_type": "Judicial-IV",
  "judges": [
    "Aftab Ahmad Maneka"
  ],
  "appellant": [
    "Nazir Ahmad"
  ],
  "respondant": [
    "The State through Executive District Officer (Revenue), Vehari"
  ],
  "accussed_details": [
    {
      "name": "Nazir Ahmad",
      "age": "N/A",
      "gender": "Male",
      "designation": "Petitioner",
      "allegation": [
        "Illegal rejection of application for grant of proprietary rights of State land"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [],
    "defense": [
      "Learned counsel for the petitioner (name not mentioned)"
    ]
  },
  "complaint_summary": "Nazir Ahmad filed a revision petition against the rejection of his application for proprietary rights of 100 Kanals of State land in Chak No. 365-EB, Burewala, District Vehari.",
  "investigation_summary": "The petitioner argued that the rejection of his application was unlawful and against the principles of natural justice. The land was allotted under a temporary cultivation lease scheme, and he fulfilled all terms and conditions of the lease. The DO(R), Vehari reviewed his earlier order without justification and in the absence of the petitioner.",
  "judgment_summary": "The court found that the impugned orders dated 5-9-2003 and 22-12-2008 suffered from legal and factual infirmities, as they were passed without providing an opportunity of hearing to the petitioner. The maxim 'audi alteram partem' was applied, and the case was remanded to the DO(R), Vehari for fresh adjudication strictly on merits.",
  "punishment": "N/A",
  "Decision_or_verdict": "Case remanded to DO(R), Vehari for fresh adjudication.",
  "legal_arguments": [
    "Impugned order passed without providing opportunity of hearing.",
    "Violation of principles of natural justice.",
    "Petitioner fulfilled all lease terms and conditions.",
    "Other allottees in similar circumstances were granted proprietary rights."
  ],
  "assets": [
    {
      "type": "Land",
      "details": "100 Kanals in Chak No. 365-EB, Burewala, District Vehari"
    }
  ],
  "statutes": [
    "Notification dated 10-7-2001"
  ],
  "sections": [],
  "citations": [
    "2010 C L C 629"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Land Rights",
    "Administrative Law",
    "Natural Justice"
  ],
  "key_issues": [
    "Whether the rejection of proprietary rights application was lawful.",
    "Whether the principles of natural justice were violated."
  ],
  "maxims": {
    "audi alteram partem": "No one should be condemned unheard."
  },
  "legal_terms": {
    "suo motu": "Action taken by a court or authority on its own initiative."
  },
  "words_and_phrases": {
    "Parcha Dakhal": "Possession document issued for land."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves a dispute over proprietary rights of State land allotted under a temporary cultivation lease scheme. The petitioner argued that the rejection of his application was unlawful and violated principles of natural justice. The court remanded the case for fresh adjudication, emphasizing the need for a fair hearing."
}