{
  "case_title": "NOT vs NOT",
  "reference_no_or_id": "I.T.A. No,4110/LB of 1986-87",
  "judgment_date": "1989-04-11",
  "first_hearing_date": "1984-05-23",
  "court": "Appellate Tribunal Inland Revenue",
  "bench_type": "Single",
  "judges": [
    "Abrar Hussain Naqvi"
  ],
  "appellant": [
    "Individual deriving income as a construction contractor"
  ],
  "respondant": [
    "Inland Revenue Department"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "Construction Contractor",
      "allegation": [
        "Filing unsigned revised income tax return",
        "Discrepancy in declared income and gross receipts"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The Inland Revenue Department reopened the agreed assessment of the appellant under Section 66A of the Income Tax Ordinance, citing errors and prejudice to revenue interests.",
  "investigation_summary": "The appellant initially declared income of Rs. 1,50,000 with gross receipts of Rs. 48,31,614 but later filed a revised return declaring Rs. 24,956 with gross receipts of Rs. 14,85,863. The revised return was unsigned, leading to its rejection.",
  "judgment_summary": "The Tribunal ruled that an agreed assessment is binding on both parties and cannot be reopened under Section 66A. It held that the unsigned revised return was valid as both parties acknowledged its filing. The appeal was accepted, and the original assessment order restored.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal accepted; original assessment order restored.",
  "legal_arguments": [
    "Agreed assessment is binding and cannot be reopened under Section 66A.",
    "Unsigned return is valid if acknowledged by both parties.",
    "Reopening agreed assessments undermines trust and mutual consent."
  ],
  "assets": [],
  "statutes": [
    "Income Tax Ordinance, Section 66A"
  ],
  "sections": [
    "Section 66A"
  ],
  "citations": [
    "1987 P T D 632",
    "1988 P T D (Trib) 965",
    "1989 P T D (Trib.) 907"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Tax Law",
    "Income Tax Assessment"
  ],
  "key_issues": [
    "Validity of unsigned revised income tax return",
    "Binding nature of agreed assessments",
    "Applicability of Section 66A to reopen assessments"
  ],
  "maxims": {},
  "legal_terms": {
    "Agreed Assessment": "A mutually accepted tax assessment between the taxpayer and the revenue department.",
    "Section 66A": "Provision allowing reopening of assessments if erroneous and prejudicial to revenue."
  },
  "words_and_phrases": {
    "Prejudicial to Revenue": "Causing harm or loss to the revenue interests.",
    "Unsigned Return": "A tax return filed without a signature but acknowledged by both parties."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the reopening of an agreed income tax assessment under Section 66A of the Income Tax Ordinance. The Tribunal ruled that agreed assessments are binding and cannot be reopened, even if the revised return was unsigned, as both parties acknowledged its filing. The appeal was accepted, restoring the original assessment order."
}