{
  "case_title": "RAHADUR vs The STATE",
  "reference_no_or_id": "Criminal Appeals Nos. 263 of 1969",
  "judgment_date": "1970-03-04",
  "first_hearing_date": "N/A",
  "court": "Baghdad-ul-Jadid",
  "bench_type": "N/A",
  "judges": [
    "A. R. Sheikh",
    "Attaullah Sajjad"
  ],
  "appellant": [
    "Bahadur"
  ],
  "respondant": [
    "The STATE"
  ],
  "accussed_details": [
    {
      "name": "Bahadur",
      "age": "17",
      "gender": "Male",
      "designation": "N/A",
      "allegation": [
        "Murder of Khanu",
        "Attempted abduction of Mst. Lalan"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Bahadur was accused of murdering his cousin Khanu following an altercation over expenses related to a prior abduction case.",
  "investigation_summary": "The police recovered two empty cartridges, blood-stained earth, and the licensed gun used in the crime. Witnesses corroborated the sequence of events leading to the murder.",
  "judgment_summary": "Bahadur was convicted of murder but his death sentence was commuted to transportation due to his youth and provocation during the altercation.",
  "punishment": "Transportation for life (commuted from death penalty)",
  "Decision_or_verdict": "Conviction upheld; death sentence commuted to transportation.",
  "legal_arguments": [
    "Defense argued appellant was falsely implicated due to enmity.",
    "Prosecution relied on witness testimony and physical evidence.",
    "Court considered provocation and appellant's age in sentencing."
  ],
  "assets": [
    "Licensed gun",
    "Two empty cartridges",
    "Blood-stained earth"
  ],
  "statutes": [
    "Niaz v. The State",
    "Nazir and others v. The State"
  ],
  "sections": [
    "N/A"
  ],
  "citations": [
    "1972 P Cr. L J 685"
  ],
  "witnesses": [
    "Ghulam Qadir",
    "Mst. Maryam",
    "Yusaf",
    "Maulvi Faiz Muhammad"
  ],
  "witness_statement": {
    "Ghulam Qadir": "Confirmed altercation and appellant's arrest at the scene.",
    "Mst. Maryam": "Described sequence of events leading to the murder.",
    "Yusaf": "Corroborated appellant's actions and arrest.",
    "Maulvi Faiz Muhammad": "Heard gunshots and confirmed timing of the incident."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Criminal Law",
    "Murder",
    "Youthful Offender"
  ],
  "key_issues": [
    "Whether the appellant was provoked during the altercation.",
    "Whether the death sentence was appropriate given the appellant's age."
  ],
  "maxims": {
    "Interested Witness": "Witnesses closely related to the deceased are not inherently biased unless proven otherwise."
  },
  "legal_terms": {
    "Transportation": "A form of punishment involving relocation or exile."
  },
  "words_and_phrases": {
    "Altercation": "A heated dispute or argument.",
    "Provocation": "Action or speech that incites someone to act."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "Bahadur, aged 17, was convicted of murdering his cousin Khanu following an altercation over expenses related to a prior abduction case. Witnesses corroborated the sequence of events, and physical evidence supported the prosecution's case. The court considered Bahadur's youth and provocation during the altercation, commuting his death sentence to transportation for life."
}