{
  "case_title": "RAJ MOHAN SAHA AND OTHERS vs COMMISSIONER OF INCOME-TAX, ASSAM",
  "reference_no_or_id": "Income-tax Reference No. 5 of 1961",
  "judgment_date": "1962-07-24",
  "first_hearing_date": "N/A",
  "court": "Assam High Court",
  "bench_type": "Division Bench",
  "judges": [
    "S. K. Dutta",
    "M. P. Mehrotra"
  ],
  "appellant": [
    "Raj Mohan Saha and Others"
  ],
  "respondant": [
    "Commissioner of Income-Tax, Assam"
  ],
  "accussed_details": [
    {
      "name": "Raj Mohan Saha",
      "age": "N/A",
      "gender": "Male",
      "designation": "Managing Partner",
      "allegation": [
        "Undisclosed income of Rs. 20,000 for assessment years 1954-55 and 1955-56",
        "Carrying on undisclosed business with a turnover of Rs. 4 lakhs"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Choudhury"
    ],
    "defense": []
  },
  "complaint_summary": "The Income-tax Officer alleged that the assessee firm failed to account for remittances sent from Agartala to Calcutta, suggesting undisclosed income and business activities.",
  "investigation_summary": "The Income-tax Officer conducted investigations, examined witnesses under Section 37 of the Indian Income-tax Act, and relied on postal records. The explanation provided by the managing partner was rejected, and Rs. 20,000 was added to the firm's income for each assessment year.",
  "judgment_summary": "The court held that there was no material evidence to justify the addition of Rs. 20,000 as undisclosed income of the assessee firm. The Tribunal's findings were based on suspicion and lacked sufficient evidence.",
  "punishment": "N/A",
  "Decision_or_verdict": "Question answered in the negative; no material evidence to support the addition of Rs. 20,000 as undisclosed income.",
  "legal_arguments": [
    "The Income-tax Officer relied on postal records without presenting them to the assessee, violating principles of natural justice.",
    "The Tribunal's inference of Rs. 4 lakhs turnover and 5% profit lacked evidentiary basis.",
    "The prosecution argued that sufficient material existed to justify the assessment."
  ],
  "assets": [],
  "statutes": [
    "Indian Income-tax Act, Section 23(3)",
    "Indian Income-tax Act, Section 37"
  ],
  "sections": [
    "Section 23(3)",
    "Section 37"
  ],
  "citations": [
    "Dhakeswari Cotton Mills Ltd. v. Commissioner of Income-tax (1954) 26 ITR 775",
    "Sree Meenakshi Mills Ltd. v. Commissioner of Income-tax (1957) 31 ITR 28",
    "Oriental Investment Co. Ltd. v. Commissioner of Income-tax (1957) 32 ITR 664",
    "Narayandas Kedarnath v. Commissioner of Income-tax (1952) 22 ITR 18",
    "Commissioner of Income-tax v. Scindia Steam Navigation Co. Ltd. (AIR 1961 SC 1633)"
  ],
  "witnesses": [
    "Sukhan Lal Poddar",
    "Makhan Lal Saha",
    "Benode Behari Saha"
  ],
  "witness_statement": {
    "Sukhan Lal Poddar": "Employee at Agartala gaddi; alleged to have remitted money.",
    "Makhan Lal Saha": "Employee at Agartala gaddi; alleged to have remitted money.",
    "Benode Behari Saha": "Manager at Burrabazar, Calcutta; recipient of remittances."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Income Tax",
    "Undisclosed Income",
    "Natural Justice"
  ],
  "key_issues": [
    "Whether there was material evidence to support the addition of Rs. 20,000 as undisclosed income.",
    "Violation of principles of natural justice in investigation.",
    "Inference of Rs. 4 lakhs turnover and 5% profit without evidence."
  ],
  "maxims": {
    "Natural Justice": "Audi alteram partem - No one should be condemned unheard."
  },
  "legal_terms": {
    "Undisclosed Income": "Income not reported in official accounts or tax filings.",
    "Turnover": "Total revenue generated by a business."
  },
  "words_and_phrases": {
    "Remittances": "Transfers of money from one location to another.",
    "Undisclosed Business": "Business activities not reported or accounted for officially."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around allegations of undisclosed income and business activities by the assessee firm. The court found insufficient evidence to support the Income-tax Authorities' conclusions, emphasizing the importance of material evidence and adherence to principles of natural justice."
}