{
  "case_title": "SARDAR MUHAMMAD vs Mst. NASIMA BIBI AND Other",
  "reference_no_or_id": "Petition No. 73 of 1964",
  "judgment_date": "1966-05-05",
  "first_hearing_date": "N/A",
  "court": "West Pakistan",
  "bench_type": "Division Bench",
  "judges": [
    "Muhammad Afzal Cheema",
    "Anwar-ul-Haq"
  ],
  "appellant": [
    "Sardar Muhammad"
  ],
  "respondant": [
    "Mst. Nasima Bibi"
  ],
  "accussed_details": [
    {
      "name": "Sardar Muhammad",
      "age": "N/A",
      "gender": "Male",
      "designation": "Head Constable, Police Department",
      "allegation": [
        "Neglect and refusal to maintain wife and minor daughter",
        "Failure to pay dower and provide adequate maintenance"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "Respondent alleged neglect and refusal by the petitioner to maintain her and their minor daughter, claiming dower money of Rs. 4,000, monthly allowance of Rs. 80, and recovery of jewelry, clothes, and furniture given as dowry.",
  "investigation_summary": "The Arbitration Council issued notices to the petitioner, followed by substituted service and publication in a newspaper. Ex parte proceedings were conducted due to the petitioner's non-response.",
  "judgment_summary": "The court quashed the impugned orders granting maintenance to both the wife and minor daughter, citing illegality under the Muslim Family Laws Ordinance. The case was remanded to the Arbitration Council for reconsideration of maintenance for the wife only.",
  "punishment": "N/A",
  "Decision_or_verdict": "Petition accepted; impugned orders quashed; case remanded for fresh decision on maintenance for the wife.",
  "legal_arguments": [
    "Section 9 of the Muslim Family Laws Ordinance applies to inadequate maintenance, not total neglect.",
    "Ex parte proceedings were valid due to proper substituted service.",
    "Under Muhammadan Law, past maintenance cannot be decreed unless based on a specific agreement.",
    "The Muslim Family Laws Ordinance does not provide maintenance for children."
  ],
  "assets": [
    "Jewelry",
    "Clothes",
    "Furniture"
  ],
  "statutes": [
    "Muslim Family Laws Ordinance, 1961",
    "Section 488, Code of Criminal Procedure"
  ],
  "sections": [
    "Section 9, Muslim Family Laws Ordinance",
    "Section 488, Code of Criminal Procedure"
  ],
  "citations": [
    "P L D 1966 (W. P.) Lahore 703",
    "I L R 6 Cal. 631"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Family Law",
    "Maintenance Rights"
  ],
  "key_issues": [
    "Validity of maintenance for minor daughter under Muslim Family Laws Ordinance",
    "Competency of Arbitration Council to grant arrears of maintenance",
    "Interpretation of 'adequate maintenance' under Section 9"
  ],
  "maxims": {
    "Interpretation of statutes": "Beneficial interpretation should advance the object of legislation."
  },
  "legal_terms": {
    "Maintenance": "Financial support provided by a husband to his wife.",
    "Dower": "Consideration agreed upon in a marriage contract."
  },
  "words_and_phrases": {
    "Adequate maintenance": "Proper and reasonable financial support.",
    "Ex parte proceedings": "Legal proceedings conducted in the absence of one party."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around maintenance rights under the Muslim Family Laws Ordinance. The petitioner challenged orders granting maintenance to his wife and minor daughter, arguing procedural and legal deficiencies. The court upheld the wife's right to maintenance but excluded the minor daughter, remanding the case for reconsideration."
}