{
  "case_title": "SHER BAHADER, ADVOCATE, TAKHT BHAI vs SHER ZAMAN",
  "reference_no_or_id": "Revision Petition T.A. No,19 of 2001",
  "judgment_date": "2001-07-20",
  "first_hearing_date": "2000-10-07",
  "court": "Bar Council Tribunal",
  "bench_type": "Disciplinary Committee",
  "judges": [
    "Mian Shakirullah Jan",
    "Muhammad Alam Khan",
    "Qaiser Rashid"
  ],
  "appellant": [
    "Sher Bahader, Advocate, Takht Bhai"
  ],
  "respondant": [
    "Sher Zaman"
  ],
  "accussed_details": [
    {
      "name": "Sher Bahader",
      "age": "N/A",
      "gender": "Male",
      "designation": "Advocate",
      "allegation": [
        "Fraudulently extracted money for litigation expenses",
        "Failed to conduct cases",
        "Refused to return received fees"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Tariq Javed, Deputy Advocate-General"
    ],
    "defense": [
      "Sher Bahader (self-represented)"
    ]
  },
  "complaint_summary": "Sher Zaman alleged that Sher Bahader, Advocate, fraudulently extracted Rs. 16,300 for litigation expenses, failed to conduct cases, and refused to return the fees.",
  "investigation_summary": "The Disciplinary Committee issued notices, recorded partial evidence, and imposed costs on both parties for adjournments. Sher Bahader contested the allegations and filed a review petition against the imposition of costs.",
  "judgment_summary": "The revision petition filed by Sher Bahader was dismissed. The court upheld the imposition of Rs. 500 costs as equitable and sound judicial discretion.",
  "punishment": "No punishment imposed; costs of Rs. 500 upheld.",
  "Decision_or_verdict": "Revision dismissed.",
  "legal_arguments": [
    "Sher Bahader argued that the imposition of costs was unwarranted due to his medical indisposition.",
    "The court found the medical certificate undated and likely procured after the fact, deeming it unreliable.",
    "The court emphasized the discretionary power under Order 17, Rule 1 and sub-rule (2), C.P.C., to impose costs for adjournments."
  ],
  "assets": [],
  "statutes": [
    "Order 17, Rule 1 and sub-rule (2), C.P.C."
  ],
  "sections": [],
  "citations": [
    "2001 Y L R 2104"
  ],
  "witnesses": [
    "Witnesses of Sher Zaman (names not provided)"
  ],
  "witness_statement": {
    "Sher Zaman's witnesses": "Present during hearings; their diet money was compensated through costs imposed on Sher Bahader."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Professional Misconduct",
    "Fraud"
  ],
  "key_issues": [
    "Fraudulent extraction of money by a lawyer",
    "Failure to conduct cases",
    "Judicial discretion in imposing costs"
  ],
  "maxims": {
    "Judicial discretion": "Costs imposed to compensate expenses incurred by witnesses, not as a penalty."
  },
  "legal_terms": {
    "Professional Misconduct": "Violation of ethical standards by a practicing lawyer.",
    "Diet Money": "Compensation for expenses incurred by witnesses attending court."
  },
  "words_and_phrases": {
    "Adjournment": "Postponement of court proceedings to a later date.",
    "Costs": "Monetary compensation imposed by the court for expenses incurred."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves allegations of professional misconduct against Sher Bahader, Advocate, by Sher Zaman. The court upheld the imposition of costs for adjournments and dismissed the revision petition, emphasizing judicial discretion and equity."
}