{
  "case_title": "Syed MUHAMMAD YOUSAF SHAH vs INSPECTOR-GENERAL OF POLICE, AZAD JAMMU &",
  "reference_no_or_id": "Appeal No. 24 of 1975",
  "judgment_date": "1977-04-06",
  "first_hearing_date": "N/A",
  "court": "Azad Jammu and Kashmir Service Tribunal",
  "bench_type": "Two-Judge Bench",
  "judges": [
    "Malik Muhammad Aslam Khan",
    "Khawaja Abdus Samad"
  ],
  "appellant": [
    "Syed Muhammad Yousaf Shah"
  ],
  "respondant": [
    "Inspector-General of Police, Azad Jammu & Kashmir"
  ],
  "accussed_details": [
    {
      "name": "N/A",
      "age": "N/A",
      "gender": "N/A",
      "designation": "N/A",
      "allegation": []
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The appellant challenged the seniority list prepared by the DIG Police, which placed him at S. No. 13, arguing that it disregarded earlier 'D' lists prepared by IG Police, which had placed him higher in seniority.",
  "investigation_summary": "The appellant argued that the 'D' lists were prepared following proper procedures, including interviews and recommendations, and were in accordance with Police Rules. The DIG's seniority list was alleged to be unauthorized and contrary to established rules.",
  "judgment_summary": "The court held that the 'D' lists were properly prepared and applicable to Reserve Police personnel. It ruled that the DIG lacked authority to override the 'D' lists and ordered the appellant's promotion based on the 1970 'D' list. The impugned seniority list was deemed ineffective.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal accepted. The appellant's promotion as Assistant Sub-Inspector (ASI) was ordered based on the 1970 'D' list.",
  "legal_arguments": [
    "The appellant argued that the 'D' lists were prepared in accordance with Police Rules and were applicable to Reserve Police.",
    "The respondents contended that the Reserve Police was not covered by the 'D' list rules and that promotions should be based on seniority lists prepared by the DIG.",
    "The court found that the Police Rules applied to Reserve Police and that the DIG lacked authority to override the 'D' lists."
  ],
  "assets": [],
  "statutes": [
    "Police Act",
    "Police Rules Chapter 13, Rule 13-9"
  ],
  "sections": [
    "Section 4 of the Police Act"
  ],
  "citations": [
    "1977 P L C [C.S.T.] 105"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "Appeal No. 24 of 1975",
  "legal_categories": [
    "Administrative Law",
    "Service Law"
  ],
  "key_issues": [
    "Validity of 'D' lists for Reserve Police promotions",
    "Authority of DIG to prepare seniority lists",
    "Applicability of Police Rules to Reserve Police"
  ],
  "maxims": {},
  "legal_terms": {
    "D List": "A list maintained for promotion eligibility of Head Constables to Assistant Sub-Inspectors.",
    "Seniority": "Order of precedence based on service duration or qualifications."
  },
  "words_and_phrases": {
    "Promotion": "Advancement in rank or position within an organization.",
    "Reserve Police": "A branch of the police department considered part of the overall police force."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around the appellant's challenge to a seniority list prepared by the DIG Police, which disregarded earlier 'D' lists prepared by IG Police. The court upheld the validity of the 'D' lists and ruled that the DIG lacked authority to override them. The appellant's promotion was ordered based on the 1970 'D' list."
}