{
  "case_title": "TARIQ BAIG, MANAGING DIRECTOR, TARIQ GLASS INDUSTRIES LTD. vs EXECUTIVE DIRECTOR (SM), SECURITIES AND EXCHANGE COMMISSION OF PAKISTAN, ISLAMABAD",
  "reference_no_or_id": "NOT",
  "judgment_date": "2002-04-25",
  "first_hearing_date": "N/A",
  "court": "Appellate Bench of Securities and Exchange Commission of Pakistan",
  "bench_type": "Appellate Bench",
  "judges": [
    "Abdul Rehman Oureshi",
    "N. K. Shahani"
  ],
  "appellant": [
    "Tariq Baig, Managing Director, Tariq Glass Industries Ltd."
  ],
  "respondant": [
    "Executive Director (SM), Securities and Exchange Commission of Pakistan, Islamabad"
  ],
  "accussed_details": [
    {
      "name": "Tariq Baig",
      "age": "N/A",
      "gender": "Male",
      "designation": "Managing Director, Tariq Glass Industries Ltd.",
      "allegation": [
        "Failure to tender Rs. 2,260,000 as tenderable gain under section 224(2) of the Companies Ordinance, 1984",
        "Misuse of privileged information for share transactions",
        "Violation of fiduciary duties"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. M. Ayub Qureshi, Director (SM)",
      "Mr. Muhammad Farooq, Deputy Director"
    ],
    "defense": [
      "Mr. Umar Mahmud Kasuri, Advocate",
      "Mr. Mubashir Latif, Advocate",
      "Mr. Mujahid Eshai, FCA"
    ]
  },
  "complaint_summary": "The appellant was accused of failing to tender Rs. 2,260,000 as tenderable gain from share transactions under section 224(2) of the Companies Ordinance, 1984. Allegations included misuse of privileged information and violation of fiduciary duties.",
  "investigation_summary": "The investigation revealed discrepancies in share transactions conducted by the appellant, including purchase and sale within six months, benefiting from privileged information. The appellant claimed exemption under section 224(1) but failed to substantiate claims of good faith and satisfaction of debt.",
  "judgment_summary": "The court upheld the impugned order requiring the appellant to deposit Rs. 2,260,000 with the Securities and Exchange Commission of Pakistan. The appellant's claims of exemption under section 224(1) were rejected due to lack of evidence of good faith and misuse of privileged information.",
  "punishment": "Deposit of Rs. 2,260,000 as tenderable gain to the Securities and Exchange Commission of Pakistan.",
  "Decision_or_verdict": "Appeal disposed of; impugned order upheld.",
  "legal_arguments": [
    "Appellant argued exemption under section 224(1) due to shares acquired in satisfaction of debt.",
    "Respondent argued misuse of privileged information and lack of good faith in transactions.",
    "Court emphasized fiduciary duties and objective of section 224 to prevent misuse of insider information."
  ],
  "assets": [
    "280,000 shares of Tariq Glass Industries Ltd."
  ],
  "statutes": [
    "Companies Ordinance, 1984"
  ],
  "sections": [
    "Section 224(2)",
    "Section 224(1)",
    "Section 222"
  ],
  "citations": [
    "2002 C L D 1346"
  ],
  "witnesses": [
    "Mian Saifullah (appeared on behalf of appellant)",
    "Mr. Khalil Masood (ex-Chairman, CLA)",
    "Mr. Shamim Ahmed Khan (ex-Chairman, CLA)",
    "Mr. Tariq Iqbal Khan (ex-Commissioner, SM)"
  ],
  "witness_statement": {
    "Mian Saifullah": "Provided options for proceedings; appellant chose continuation of earlier order.",
    "Mr. Khalil Masood": "Conducted hearings on reopened case.",
    "Mr. Shamim Ahmed Khan": "Participated in hearings on reopened case.",
    "Mr. Tariq Iqbal Khan": "Participated in hearings on reopened case."
  },
  "appeal_number": "N/A",
  "legal_categories": [
    "Corporate Law",
    "Securities Regulation"
  ],
  "key_issues": [
    "Applicability of section 224(1) exemption for shares acquired in satisfaction of debt.",
    "Misuse of privileged information in share transactions.",
    "Fiduciary duties of directors under Companies Ordinance, 1984."
  ],
  "maxims": {
    "Fiduciary Duty": "Directors must act in good faith and avoid misuse of privileged information."
  },
  "legal_terms": {
    "Tenderable Gain": "Profit made from share transactions that must be tendered to the company under section 224(2).",
    "Privileged Information": "Inside information accessible due to fiduciary position."
  },
  "words_and_phrases": {
    "Good Faith": "Honest intention without malice or fraud.",
    "Securities": "Financial instruments representing ownership or debt."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case revolves around allegations of misuse of privileged information and failure to tender profits from share transactions under section 224(2) of the Companies Ordinance, 1984. The appellant's claims of exemption under section 224(1) were rejected due to lack of evidence of good faith and contradictory stances. The court upheld the impugned order requiring deposit of Rs. 2,260,000 with the Securities and Exchange Commission of Pakistan."
}