{
  "case_title": "THE DIVISIONAL SUPERINTENDENT, P. W. R., QUETTA vs MIAN MUHAMMAD",
  "reference_no_or_id": "Letters Patent Appeal No. 5 of 1970",
  "judgment_date": "1973-04-06",
  "first_hearing_date": "N/A",
  "court": "Balochistan High Court",
  "bench_type": "Division Bench",
  "judges": [
    "Ghulam Rasool K. Sheikh",
    "Z. A. Channa"
  ],
  "appellant": [
    "THE DIVISIONAL SUPERINTENDENT, P. W. R., QUETTA"
  ],
  "respondant": [
    "MIAN MUHAMMAD"
  ],
  "accussed_details": [
    {
      "name": "Mian Muhammad",
      "age": "N/A",
      "gender": "Male",
      "designation": "Assistant Wireman",
      "allegation": [
        "Claim for compensation for injury sustained during employment"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "Mr. Muftikharuddin Advocate"
    ],
    "defense": [
      "Respondent appeared in person"
    ]
  },
  "complaint_summary": "Respondent claimed compensation for 60% disability and reimbursement of Rs. 788 spent on medical treatment following an injury sustained during employment.",
  "investigation_summary": "The Commissioner for Workmen's Compensation awarded Rs. 788 for medical expenses and compensation for 20% permanent incapacity, totaling Rs. 1908.",
  "judgment_summary": "The appeal was partly allowed. The respondent was found not entitled to Rs. 908 spent on medical treatment at C.M.H., Quetta, as it fell outside the scope of the Workmen's Compensation Act, 1923. However, the court expected the appellant not to recover this amount from the respondent due to his financial constraints.",
  "punishment": "N/A",
  "Decision_or_verdict": "Appeal partly allowed; Rs. 908 medical expenses disallowed.",
  "legal_arguments": [
    "Section 3(1) and Section 4 of the Workmen's Compensation Act, 1923 were analyzed to determine the scope of compensation.",
    "Proviso (a) to Section 4(1) was interpreted to exclude medical expenses unless paid by the employer during convalescence.",
    "Reference to Pakistan Beverage Company v. Ahmad Shah (PLD 1960 Kar. 331) for precedent."
  ],
  "assets": [],
  "statutes": [
    "Workmen's Compensation Act, 1923"
  ],
  "sections": [
    "Section 3(1)",
    "Section 4",
    "Proviso (a) to Section 4(1)"
  ],
  "citations": [
    "1973P L C 337",
    "Pakistan Beverage Company v. Ahmad Shah (PLD 1960 Kar. 331)"
  ],
  "witnesses": [],
  "witness_statement": {},
  "appeal_number": "N/A",
  "legal_categories": [
    "Workmen's Compensation",
    "Personal Injury",
    "Employment Law"
  ],
  "key_issues": [
    "Entitlement to medical expenses under Workmen's Compensation Act, 1923",
    "Interpretation of Section 4 and its proviso",
    "Calculation of compensation for permanent partial disability"
  ],
  "maxims": {},
  "legal_terms": {
    "Permanent Partial Disability": "A condition where an individual suffers a lasting impairment that partially limits their ability to work.",
    "Convalescence": "The period of recovery following an illness or injury."
  },
  "words_and_phrases": {
    "Medical Expenses": "Costs incurred for medical treatment and related services.",
    "Compensation": "Monetary award for injury or loss."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involves an appeal against compensation awarded under the Workmen's Compensation Act, 1923. The court disallowed Rs. 908 medical expenses claimed by the respondent, citing statutory limitations. The judgment clarified the scope of compensation under Section 4 and its proviso, emphasizing that medical expenses are only recoverable if paid by the employer during convalescence."
}