{
  "case_title": "The State/ANF vs Muhammad Arshad",
  "reference_no_or_id": "CRIMINAL APPEAL NO. 21-K OF 2016",
  "judgment_date": "2016-12-08",
  "first_hearing_date": "N/A",
  "court": "Supreme Court of Pakistan",
  "bench_type": "Three-Judge Bench",
  "judges": [
    "Khilji Arif Hussain",
    "Maqbool Baqar",
    "Faisal Arab"
  ],
  "appellant": [
    "The State/ANF"
  ],
  "respondant": [
    "Muhammad Arshad"
  ],
  "accussed_details": [
    {
      "name": "Muhammad Arshad",
      "age": "N/A",
      "gender": "Male",
      "designation": "N/A",
      "allegation": [
        "Smuggling heroin abroad"
      ]
    }
  ],
  "lawyers": {
    "prosecution": [
      "N/A"
    ],
    "defense": [
      "N/A"
    ]
  },
  "complaint_summary": "The respondent was accused of attempting to smuggle heroin abroad and was arrested at Karachi Airport based on spy information.",
  "investigation_summary": "The respondent was taken to Nihal Hospital for an X-Ray, which revealed foreign bodies in his abdomen. He was then moved to Jinnah Hospital, where he excreted 50 capsules containing 550 grams of heroin powder after being administered medicines.",
  "judgment_summary": "The Supreme Court overturned the High Court's acquittal, restored the Trial Court's conviction, and found sufficient evidence to connect the respondent to the crime.",
  "punishment": "Five years rigorous imprisonment, Rs. 50,000 fine, and six months additional imprisonment in case of fine default.",
  "Decision_or_verdict": "Appeal Allowed; High Court judgment set aside; Trial Court judgment restored.",
  "legal_arguments": [
    "Prosecution argued that the respondent excreted heroin capsules under police watch and that the capsules were chemically confirmed to contain heroin.",
    "Defense argued that the X-Ray did not contain the respondent's name and questioned procedural details such as capsule washing and presence of medical officers."
  ],
  "assets": [],
  "statutes": [],
  "sections": [],
  "citations": [
    "2016 SCP 110"
  ],
  "witnesses": [
    "Dr. Inam Khan (PW-5)",
    "Dr. Fazal Elahi (Chemical Examiner, PW-3)",
    "Head Constable (PW-3)"
  ],
  "witness_statement": {
    "Dr. Inam Khan": "Administered medicines and confirmed excretion of capsules.",
    "Dr. Fazal Elahi": "Confirmed capsules contained 550 grams of heroin powder.",
    "Head Constable": "Witnessed the excretion of capsules."
  },
  "appeal_number": "82-K/2015",
  "legal_categories": [
    "Criminal Law",
    "Drug Trafficking"
  ],
  "key_issues": [
    "Procedural omissions in evidence collection.",
    "Sufficiency of evidence to convict despite minor omissions."
  ],
  "maxims": {
    "N/A": "N/A"
  },
  "legal_terms": {
    "Rigorous Imprisonment": "A form of imprisonment involving hard labor."
  },
  "words_and_phrases": {
    "Foreign Bodies": "Objects not naturally present in the body, detected via X-Ray."
  },
  "metadata": {
    "source_website": "www.eastlaw.pk"
  },
  "summary_vector_notes": "The case involved the arrest of Muhammad Arshad for heroin smuggling. Evidence included X-Ray results, witness depositions, and chemical analysis confirming heroin presence. The Supreme Court restored the Trial Court's conviction, emphasizing sufficient evidence despite procedural omissions."
}