{
  "case_title": "AZAD TOBACCO FACTORY (P.) LTD. vs COMMISSIONER OF INCOME-TAX",
  "case_number": "Writ Petition No,665(M/B) of 1995",
  "judgment_date": "1995-04-20",
  "court": "Allahabad High Court",
  "judges": [
    "Brijesh Kumar",
    "D. K. Seth"
  ],
  "appellant": "AZAD TOBACCO FACTORY (P.) LTD.",
  "respondent": "COMMISSIONER OF INCOME-TAX",
  "result": "Order accordingly",
  "legal_issues": [
    {
      "issue": "Whether section 80-HHC(2)(a) of the Income Tax Act contemplates the making of an application for claiming deduction?",
      "finding": "No, section 80-HHC(2)(a) does not specify the making of any application or time limit for claiming deduction."
    },
    {
      "issue": "If so, whether such application is to be made before expiry of the said period of six months?",
      "finding": "No, the application is not required to be made before the expiry of six months."
    }
  ],
  "key_points": [
    "Section 80-HHC(1) allows deduction of profits derived from export of specified goods or merchandise.",
    "Subsection (2)(a) provides that sale proceeds must be received in or brought into India within six months, but allows relaxation if reasons beyond control are proven.",
    "The Commissioner failed to exercise jurisdiction due to an erroneous interpretation of subsection (2)(a).",
    "Deduction claims are to be made in the return, and assessing authorities must refer cases to the Chief Commissioner or Commissioner for further consideration."
  ],
  "directive": "The Commissioner is directed to decide the matter afresh in light of the observations made in the judgment.",
  "interim_order": "Stay of assessment granted on March 9, 1995, shall continue until the disposal of the application and its communication to the petitioner.",
  "citation": "1999 P T D 489",
  "advocates": [
    "S.P. Gupta (Advocate-General)",
    "Mr. Misra"
  ],
  "statutes_referenced": [
    "Income Tax Act, Section 80-HHC"
  ],
  "printed_by": "Areesha Kaleem",
  "printed_on": "2025-07-15"
}