{
  "case_title": "Ch. NASEER-UD-DIN vs GOVERNMENT OF WEST PAKISTAN THROUGH CHIEF SECRETARY, CIVIL SECRETARIAT, LAHORE AND 2 OTHERS",
  "case_number": "Writ Petition No. 976-S of 1969/(LHR.)",
  "judgment_date": "1971-04-28",
  "court": "Baghdad-ul-Jadid",
  "judges": [
    "M. S. H. Qureshi",
    "Anwar-ul-Haq"
  ],
  "appellant": "Ch. NASEER-UD-DIN",
  "respondent": "GOVERNMENT OF WEST PAKISTAN THROUGH CHIEF SECRETARY, CIVIL SECRETARIAT, LAHORE AND 2 OTHERS",
  "result": "Petition dismissed",
  "reported_as": "P L D 1971 Baghdad-ul-Jadid 45",
  "key_issues": [
    {
      "issue": "Consultation with the Public Service Commission",
      "contention": "Consultation with the Public Service Commission was obligatory under Article 186 of the 1962 Constitution, notwithstanding the amendment made by the Provincial Governor in 1965."
    },
    {
      "issue": "Finding of inefficiency",
      "contention": "The finding of inefficiency recorded against the petitioner was not warranted by the facts and evidence presented."
    }
  ],
  "facts": [
    {
      "description": "Petitioner joined service as Field Qanungo in 1947, promoted to Naib-Tehsildar in 1954, and later appointed Tehsildar in 1959."
    },
    {
      "description": "Charge-sheet served in 1962 regarding mutation correction and another in 1964 for irregular disposal of rent suits."
    },
    {
      "description": "Inquiry held by Special Judge (Anti-Corruption)-cum-Enquiry Officer in 1965 found petitioner guilty of inefficiency but exonerated him of corruption."
    },
    {
      "description": "Punishment finalized in 1967, reducing petitioner to Naib-Tehsildar for two years."
    }
  ],
  "legal_analysis": [
    {
      "article": "Article 186 of the 1962 Constitution",
      "interpretation": "Consultation with the Public Service Commission is mandatory unless the Governor provides otherwise by an order."
    },
    {
      "article": "Article 234 of the 1962 Constitution",
      "interpretation": "Terms and conditions of service for pre-Constitution employees are protected, but procedural changes like consultation requirements are not substantive rights."
    }
  ],
  "conclusion": "The petition was dismissed as the amendment exempting consultation with the Public Service Commission was valid, and the findings of inefficiency were supported by evidence."
}