{
  "case_title": "COMMISSIONER OF WEALTH TAX vs TRUSTEES OF SAHEBZADI ANWAR BEGUM TRUST",
  "case_number": "Case Referred No. 41 of 1989",
  "judgment_date": "1998-08-07",
  "court": "Andhra Pradesh High Court",
  "judges": [
    "P. Venkatarama Reddy",
    "Krishna Saran Shrivastav",
    "A. Hanumanthu"
  ],
  "appellant": "Commissioner of Wealth Tax",
  "respondent": "Trustees of Sahebzadi Anwar Begum Trust",
  "result": "Order accordingly",
  "reported_as": "1999 P T D 1705",
  "assessment_years": "1970-71 to 1975-76",
  "questions_of_law": {
    "question_1": "Whether, on the facts and in the circumstances of the case, the Appellate Tribunal was correct in law in holding that the assessee had no beneficial interest in the entire corpus regarding the shares fund liable to be assessed to wealth tax under section 21(1)?",
    "question_2": "Whether, on the facts and in the circumstances of the case, the Appellate Tribunal was correct in law in holding that the jewellery fund was not liable to be assessed to wealth tax under section 21(1)?",
    "question_3": "Whether, on the facts and in the circumstances of the case, the Appellate Tribunal is correct in law in holding that it was not open to the Wealth Tax Officer to make an assessment under section 21(1) subsequent to the direct assessment on the beneficiary?",
    "question_4": "Whether, on the facts and in the circumstances of the case, the Appellate Tribunal was correct in law in holding that the assessments under section 21(1) were not justified being in the nature of double assessments?"
  },
  "key_findings": {
    "shares_fund": "The interest of Anwar Begum in the 'shares fund' is not an asset within the meaning of section 2(e) of the Wealth Tax Act.",
    "part_1_jewellery": "The right conferred on Anwar Begum to wear jewellery on ceremonial or festive occasions cannot be regarded as an 'asset' within the meaning of section 2(e) of the Wealth Tax Act.",
    "part_2_jewellery": "Part-II jewellery was not subjected to tax for any of the years as it was sold out during the assessment year ending March 31, 1972."
  },
  "trust_details": {
    "trust_name": "Sahebzadi Anwar Begum Trust",
    "settlor": "H.E.H. Mir Osman Ali Khan Bahadur",
    "beneficiary": "Sahebzadi Anwar Begum",
    "trust_creation_date": "1953-03-21"
  },
  "legal_references": {
    "wealth_tax_act_sections": [
      "Section 2(e)",
      "Section 3",
      "Section 5",
      "Section 7",
      "Section 21"
    ],
    "related_cases": [
      "R.C. No. 67 of 1969",
      "CWT v. Trustees of H.E.H. The Nizam's Sahebzadi Anwar Begum Trust (1981) 129 ITR 796"
    ]
  },
  "tribunal_decision": "The Tribunal reversed the decision of the Appellate Commissioner and held that there is no beneficial interest which can be treated as an asset within the meaning of section 2(e) of the Wealth Tax Act."
}