{
  "case_title": "Commissioner of Income-Tax, Assam vs Kedarmall Keshardeo",
  "case_number": "Income-tax Reference No. 14 of 1966",
  "court_name": "Assam High Court",
  "judgment_date": "1971-02-20",
  "judges": [
    "P. K. Goswami",
    "C. S. Nayudu"
  ],
  "appellant": "Commissioner of Income-Tax, Assam",
  "respondent": "Kedarmall Keshardeo",
  "result": "Answered in the affirmative",
  "reported_as": "1971 PTD 942",
  "questions_of_law": {
    "question_1": {
      "sub_question_a": "Smt. Tribeni Debi was a partner in a representative capacity.",
      "sub_question_b": "The minor, Sri Gobindram Bajaj, was not made a full-fledged partner liable for losses.",
      "sub_question_c": "Smt. Tribeni Debi was not a partner in a dual capacity, and the deed of partnership was not invalid.",
      "sub_question_d": "Smt. Tribeni Debi and her minor son, Sri Gobindram Bajaj, had not been made partners jointly, and their individual shares were not required to be specified."
    },
    "question_2": "The Tribunal was justified in law in holding that the assessee-firm constituted under the deed of partnership dated February 25, 1953, was entitled to registration and in setting aside the order of the Commissioner under section 33-B of the Indian Income-tax Act, 1922.",
    "question_3": "The Commissioner of Income-Tax could invoke jurisdiction under section 33-B of the Indian Income-tax Act, 1922, even after its repeal by section 297 of the Income-tax Act, 1961."
  },
  "key_statutes": [
    "Income-tax Act, 1922",
    "Income-tax Act, 1961",
    "Indian Partnership Act"
  ],
  "key_findings": {
    "minor_status": "A minor cannot be a full-fledged partner under section 30 of the Indian Partnership Act.",
    "registration_validity": "The partnership deed was valid and genuine, and the firm was entitled to registration under section 26-A of the Income-tax Act.",
    "jurisdiction": "The Commissioner retained jurisdiction under section 33-B of the repealed Income-tax Act, 1922, due to section 297(2) of the Income-tax Act, 1961."
  },
  "citations": [
    "Kalawati Devi Harlalka v. Commissioner of Income-tax (1967) 66 ITR 680 (SC)",
    "Commissioner of Income-tax v. Dwarkadas Khetan & Co. (1961) 41 ITR 528",
    "N. T. Patel & Co. v. Commissioner of Income-tax (1961) 42 ITR 224",
    "Commissioner of Income-tax v. Bagyalakshmi & Co. (1965) 55 ITR 660 (SC)",
    "Commissioner of Income-tax v. A. Abdul Rahim & Co. (1965) 55 ITR 651 (SC)",
    "Ram Laxman Sugar Mills v. Commissioner of Income-tax (1967) 66 ITR 613 (SC)"
  ]
}