{
  "case_title": "COMMISSIONER OF WEALTH TAX vs SUNEHARI LAL GARG",
  "case_number": "Wealth Tax Reference No. 213 of 1980",
  "court_name": "Allahabad High Court",
  "judgment_date": "1996-12-12",
  "judges": "Om Prakash, Bhagwan Din",
  "appellant": "Commissioner of Wealth Tax",
  "respondent": "Sunehari Lal Garg",
  "result": "Question answered",
  "reported_as": "1998 P T D 2309",
  "questions_referred": [
    {
      "question": "Whether, on the facts and in the circumstances of the case, the Income-tax Appellate Tribunal was correct in law in holding that the amount of Rs. 43,100 which represented the amount of gift made by the assessee to his minor children could not be included in his net wealth for the assessment year 1972-73?"
    },
    {
      "question": "Whether, on the facts and in the circumstances of the case, the contention of the Department before the Income-tax Appellate Tribunal that the proviso to section 4(1)(a) of the Wealth Tax Act, 1957, made section 4(1)(a) of the Wealth Tax Act, 1957, inoperative only for a period of assessment years 1964-65 to 1971-72 in respect of the transferred assets chargeable or exempted under section 5 of the Gift-tax Act, 1958, and that from the assessment year 1972-73 and onwards such assets were to be included in the net wealth of the assessee irrespective of its chargeability or exemption under the Gift-tax Act is legally correct and whether the Income-tax Appellate Tribunal erred in law in not accepting the same?"
    },
    {
      "question": "Whether, on the facts and in the circumstances of the case, the Income-tax Appellate Tribunal was correct in law in upholding the Appellate Assistant Commissioner's action in deleting an addition of Rs. 43,100 made by the Wealth-tax Officer to the assessee's wealth under section 4(1)(a) of the Wealth Tax Act, 1957?"
    }
  ],
  "facts": {
    "assessee": "Individual",
    "assessment_years": "1972-73 to 1975-76",
    "disclosed_amount": "Rs. 43,100",
    "nature_of_amount": "Gifts made by the assessee to his minor children"
  },
  "legal_issue": "Whether the disclosed amount of Rs. 43,100 is includible in the net wealth of the assessee.",
  "tribunal_decision": "The amount chargeable to gift-tax during the period from March 31, 1964, to April 1, 1972, will not be included in the net wealth of the assessee.",
  "precedents": [
    {
      "case_name": "G.A. Parashuram v. CWT",
      "citation": "(1988) 171 ITR 41 (AP)",
      "decision": "Amount chargeable to gift-tax during the specified period will not be included in net wealth."
    },
    {
      "case_name": "CWT v. H.H. Bhawanisingh",
      "citation": "(1990) 181 ITR 458 (MP)",
      "decision": "Similar view as G.A. Parashuram case."
    }
  ],
  "court_decision": "In agreement with the Andhra Pradesh and Madhya Pradesh High Courts, the question is answered in favor of the assessee and against the Revenue."
}