{
  "case_title": "CONTROLLER OF ESTATE DUTY, ASSAM, TRIPURA AND MANIPUR vs BIRENDRA KUMAR SEN",
  "court_name": "Assam High Court",
  "judgment_date": "1964-01-22",
  "judges": "S. K. Dutta, G. Mehrotra",
  "appeallant": "CONTROLLER OF ESTATE DUTY, ASSAM, TRIPURA AND MANIPUR",
  "respondent": "BIRENDRA KUMAR SEN",
  "case_number": "N/A",
  "reported_as": "1965 PTD 219",
  "result": "Question answered in the affirmative",
  "legal_question": "Whether, on the facts and in the circumstances of the case, the Tribunal was justified in holding that the donor was entirely excluded from the possession and enjoyment of the subject-matter of gift, i.e., the half share of the partnership business known as Upper Assam Pharmacy and accordingly the provisions of section 10 of the Estate Duty Act were not attracted to the property so gifted?",
  "facts": {
    "deceased": "Shri Jnanendra Mohan Sen",
    "business_name": "Upper Assam Pharmacy",
    "gift_date": "1957-01-21",
    "gift_details": "Absolute gift of half share in the business to his eldest son, Shri Birendra Kumar Sen",
    "partnership_agreement_date": "1957-01-21",
    "business_valuation": "Rs. 60,000",
    "death_date": "1960-08-15"
  },
  "legal_provisions": {
    "estate_duty_act_section_10": "Property taken under any gift, whenever made, shall be deemed to pass on the donor's death to the extent that bona fide possession and enjoyment of it was not immediately assumed by the donee and thenceforward retained to the entire exclusion of the donor or of any benefit to him by contract or otherwise."
  },
  "tribunal_decision": {
    "appellate_controller_decision": "Excluded the gifted property from the principal value of the estate.",
    "tribunal_decision": "Upheld the Appellate Controller's decision and rejected the Department's contention."
  },
  "court_analysis": {
    "key_findings": "The donor was entirely excluded from the possession and enjoyment of the gifted property. The partnership agreement did not affect the exclusion of the donor from the gifted half share.",
    "precedents_considered": [
      {
        "case_name": "Clifford John Chick v. Commissioner of Stamp Duties of New South Wales",
        "principle": "Absolute gift of property without reservation leads to inclusion in dutiable estate."
      },
      {
        "case_name": "H. R. Munro v. Commissioner of Stamp Duties",
        "principle": "Gift shorn of partnership rights excludes donor from possession and enjoyment."
      }
    ]
  },
  "judgment": {
    "decision": "The Tribunal was justified in holding that the donor was entirely excluded from the possession and enjoyment of the subject-matter of the gift, and the provisions of section 10 of the Estate Duty Act were not attracted."
  }
}