{
  "case_title": "GHULAM MUHAMMAD vs THE STATE",
  "case_number": "ROR No. 1032 of 1988",
  "judgment_date": "1991-02-12",
  "court": "Board of Revenue",
  "judge": "Asad Ali Shah",
  "appellant": "Ghulam Muhammad",
  "respondent": "The State",
  "result": "N/A",
  "reported_as": "(K.L.R. 1996 Revenue Cases 109)",
  "summary": {
    "issue": "Revision petition against refusal to grant State land under the Temporary Cultivation Scheme.",
    "facts": [
      "Petitioner applied for land under the 15 Years Lease Scheme in 1971 after the deadline of 31-5-1971.",
      "Petitioner was granted lease based on being a landless tenant during Kharif, 1969 to Kharif, 1970.",
      "Complaints of irregular allotments led to an inquiry, which found the petitioner was not cultivating during the crucial period.",
      "Possession of land continued with the petitioner despite findings."
    ],
    "procedural_history": [
      "Additional Commissioner (Consolidation) accepted appeal in 1977, stating District Collector lacked authority to review orders.",
      "Case remanded in 1983 with instructions to cancel irregular allotments.",
      "Assistant Commissioner/Collector found petitioner eligible but noted part of the land was granted under the Atomic Energy Complex Oustees Scheme."
    ],
    "judgment": [
      "Petitioner was eligible under the 15 Years Lease Scheme.",
      "Land was included in the Atomic Energy Complex Scheme in 1980.",
      "Notification dated 3-9-1979 required lessees to apply for proprietary rights, which petitioner failed to do.",
      "Original lease expired in 1986; petitioner now occupies land without authority.",
      "Allotments to respondents upheld as valid; petitioner allowed to retain remaining land as a fresh lessee."
    ]
  },
  "key_points": {
    "land_details": "99 Kanals, 15 Marlas in Chak No. 4/DB, Tehsil and District Mianwali",
    "schemes_involved": [
      "15 Years Lease Scheme",
      "Temporary Cultivation Scheme",
      "Atomic Energy Complex Oustees Scheme"
    ],
    "notifications": "Notification dated 3-9-1979 granting proprietary rights to eligible lessees."
  }
}