{
  "case_title": "HAFEEZ-UR-REHMAN ABBASI, SUB-DIVISIONAL OFFICER ELECTRICITY CONSTRUCTION, SUB-DIVISION NEELUM VALLEY vs AZAD GOVERNMENT through its Chief Secretary, Azad Kashmir, Muzaffarabad and 3 others",
  "case_number": "Service Appeal No. 119 of 2009",
  "court_name": "Azad Jammu and Kashmir Service Tribunal",
  "judgment_date": "2009-04-09",
  "judges": [
    "Azhar Saleem Babar",
    "Malik Abdul Rashid"
  ],
  "appellant": "Hafeez-ur-Rehman Abbasi, Sub-Divisional Officer Electricity Construction, Sub-Division Neelum Valley",
  "respondents": [
    "Azad Government through its Chief Secretary, Azad Kashmir, Muzaffarabad",
    "3 others"
  ],
  "result": "Appeal dismissed",
  "reported_as": "PLJ 2009 Tr.C. (Services) 188",
  "key_issues": [
    "The appellant challenged a notification dated 12.2.2009 transferring him to Operation Sub-Division Electricity Muzaffarabad as Sub-Engineer.",
    "The appellant claimed seniority over Respondent No. 4 and argued that a junior employee cannot be assigned the charge of a senior post.",
    "The appellant contended that he was previously assigned additional charge of Sub-Divisional Officer (S.D.O) and that the transfer notification violated his seniority rights."
  ],
  "respondents_arguments": [
    "The appellant lacked locus standi and did not qualify as an aggrieved person.",
    "The appellant was given additional charge of S.D.O as a stop-gap arrangement, which could be terminated upon appointment of a regular S.D.O.",
    "The transfer was within the appellant's pay, scale, and position, and did not violate any vested rights."
  ],
  "court_findings": [
    "Assigning additional charge of a senior post is not a vested right under service laws.",
    "The appellant's transfer to Muzaffarabad as Sub-Engineer was lawful and did not constitute a violation of his rights.",
    "The appellant was not the senior-most Sub-Engineer as per the seniority list, and the senior employee (Amanullah Ghazi) had not approached the court."
  ],
  "court_directions": [
    "The Electricity Department was directed to fill vacant posts of Sub-Divisional Officers in accordance with the law."
  ],
  "final_decision": "The appeal was dismissed with no order as to costs."
}