{
  "case_title": "In Re: REQUEST OF MR. RIAZ AHMED SIPRA, SECRETARY/ MEMBER, FEDERAL ANTI CORRUPTION COMMITTEE FOR SUPPLY OF COPY OF STATEMENT OF ASSETS AND LIABILITIES OF MIAN MUHAMMAD NAWAZ SHARIF, M.NA.",
  "case_number": "Federal Government Notification No. 1/8/86",
  "court_name": "Chief Election Commissioner",
  "judgment_date": "1994-07-12",
  "reported_as": "1994 C L C 2088",
  "judges": "Naimuddin",
  "appellant": "Mr. Riaz Ahmed Sipra, Secretary/Member, Federal Anti-Corruption Committee",
  "respondent": "Mian Muhammad Nawaz Sharif, M.N.A.",
  "result": "Application dismissed",
  "key_issues": [
    "Request for a copy of the statement of assets and liabilities of Mian Muhammad Nawaz Sharif under subsection (3A) of section 42 of the Representation of the People Act, 1976.",
    "Determination of locus standi of the Federal Anti-Corruption Committee to request such a document.",
    "Assessment of whether the Federal Anti-Corruption Committee's request aligns with its authorized functions."
  ],
  "arguments": {
    "applicant": {
      "counsel": "Mr. Bashir Zafar",
      "submission": "The copy is required to move the Speaker for making a reference under Article 63(2) of the Constitution, alleging false statements constituting corrupt practices under section 78 of the Representation of the People Act, 1976."
    },
    "respondent": {
      "counsel": "Mr. Muhammad Akram Sheikh",
      "objections": [
        "The application lacked purpose or grounds initially.",
        "The Federal Anti-Corruption Committee is not authorized to request such documents under its mandate.",
        "The request was made in bad faith and was belated."
      ]
    }
  },
  "court_findings": [
    "The Federal Anti-Corruption Committee's functions, as outlined in the Prime Minister's Order dated 11-1-1987, do not include dealing with or investigating members of Parliament or referring matters to the Speaker under Article 63(2) of the Constitution.",
    "The statement of assets and liabilities is a public document but cannot be accessed by any person without locus standi.",
    "The Representation of the People Act, 1976 does not explicitly authorize the Chief Election Commissioner to grant copies of such statements to any person or body without a legitimate purpose."
  ],
  "legal_references": [
    "Representation of the People Act, 1976, Section 42(3A), Section 78",
    "Article 63(2) of the Constitution of Pakistan",
    "Article 4 and Article 25(1) of the Constitution of Pakistan",
    "Qanun-e-Shahadat, Article 87"
  ],
  "precedents_cited": [
    {
      "case_name": "Sultan Ali Lakhani v. Nasreen Jalil",
      "reference": "Judgment on granting copies of assets and liabilities to rival candidates."
    },
    {
      "case_name": "Ghulam Mustafa Khar v. Chief Election Commissioner of Pakistan",
      "reference": "PLD 1969 Lahore 602"
    }
  ],
  "court_order": [
    "The application for a copy of the statement of assets and liabilities of Mian Muhammad Nawaz Sharif is dismissed.",
    "Similar applications for Mian Abbas Sharif and Mian Shahbaz Sharif are also dismissed."
  ],
  "recommendation": "The court suggested that the government may amend the Representation of the People Act, 1976 to include provisions for granting public access to statements of assets and liabilities if deemed appropriate."
}