{
  "case_title": "JAVAID RIZVI vs GOVERNMENT OF BALUCHISTAN Through Services And General Administration Department And Another",
  "case_number": "Service Appeal No. 28 of 1984",
  "judgment_date": "1986-11-19",
  "court_name": "Balochistan Service Tribunal",
  "judges": [
    "Nazir Ahmad Bhatti",
    "Mukhtar Gul",
    "Manzoor Ahmad Jamali"
  ],
  "appellant": "Javaid Rizvi",
  "respondent": "Government of Baluchistan Through Services And General Administration Department And Another",
  "result": "Appeal accepted",
  "reported_as": "1987 P L C (C.S.) 234",
  "charges": {
    "charge_1": "Payments made to contractor without provision for horizontal or vertical reinforcement, causing cracks and loss of Rs.3,75,134.30.",
    "charge_2": "Use of cement concrete blocks below required specifications, causing alleged defects.",
    "charge_3": "Failure to exercise 10% test checking, leading to payments worth Rs.40,05,940 without proper checks.",
    "charge_4": "Measurements recorded in contravention of B&R Code.",
    "charge_5": "Failure to hand over list of works in hand, causing loss of Rs.31,49,103 due to non-renewal of bank guarantee."
  },
  "findings": {
    "charge_1": "No provision in contract for horizontal or vertical reinforcement; charge dismissed.",
    "charge_2": "Structure demolished before testing; appellant not responsible for quality checks; charge dismissed.",
    "charge_3": "Consultants solely responsible for quality and quantity checks; charge dismissed.",
    "charge_4": "Linked to charge 3; dismissed.",
    "charge_5": "Bank guarantee extended during appellant's tenure; charge dismissed."
  },
  "key_points": {
    "disciplinary_procedure": "Show-cause notice issued without thorough inquiry or evidence recording.",
    "discrimination": "Sub-Divisional Officer reinstated despite greater responsibility; appellant treated unfairly.",
    "appeal_decision": "Order of removal from service set aside; appellant reinstated with back benefits."
  }
}