{
  "case_title": "TANVIR AHMED KHAN vs HAMID MUKHTAR and 3 others",
  "case_number": "Review Petition No. 474 of 2004 in R.O.R. No. 1693 of 2003",
  "court_name": "Board of Revenue",
  "judgment_date": "2009-12-02",
  "judges": [
    "Nadeem Ashraf",
    "Azhar Hussain Shamim"
  ],
  "appellant": "Tanvir Ahmed Khan",
  "respondent": "Hamid Mukhtar and 3 others",
  "result": "Petition accepted",
  "facts": {
    "death_of_lamberdar": "Lamberdar of Chak No. 294/GB, Tehsil Toba Tek Singh passed away.",
    "initial_appointment": "District Officer (Revenue), Toba Tek Singh appointed Tanvir Ahmed Khan as Lamberdar on 2003-04-14.",
    "appeal_by_respondent": "Hamid Mukhtar appealed the appointment, which was accepted by Executive District Officer (Revenue), Toba Tek Singh on 2003-09-02.",
    "revision_petition": "Tanvir Ahmed Khan filed a revision petition, dismissed by Member (Judicial-V), Board of Revenue, Punjab on 2004-06-19."
  },
  "arguments": {
    "petitioner": {
      "claims": [
        "Impugned orders were against the law and facts.",
        "Petitioner was entitled to appointment based on sound physique, higher education, and land ownership.",
        "Petitioner owned 76 Kanals and 14 Marlas of land compared to respondent's 8 Kanals.",
        "Petitioner had F.Sc education compared to respondent's primary education.",
        "Petitioner was younger and more energetic."
      ],
      "prayer": "Review petition should be accepted."
    },
    "respondent": {
      "claims": [
        "Supreme Court prohibited Board of Revenue from adjudicating Lambardari cases.",
        "Adjudication violated Supreme Court orders in PLD 1965 SC 393."
      ],
      "prayer": "Review petition should be dismissed."
    }
  },
  "judgment": {
    "analysis": [
      "Supreme Court ruling in PLD 1965 SC 393 was based on rules superseded by West Pakistan Land Revenue Rules, 1968.",
      "Under section 8 of Board of Revenue Act, 1957, review by Full Board is permissible."
    ],
    "decision": [
      "Petitioner has resigned from government service and is prepared to serve as Lamberdar.",
      "Petitioner has more land, better education, and is younger than respondent.",
      "Collector's choice should be given weightage."
    ],
    "final_order": "Review petition accepted. Orders dated 2003-09-02 and 2004-06-19 are set aside. Order dated 2003-04-14 is upheld."
  },
  "citation": "2010 C L C 1190",
  "printed_by": "Areesha Kaleem",
  "printed_on": "2025-07-15"
}