{
  "case_title": "LAHORE STOCK EXCHANGE vs SHAHID GHAFFAR, COMMISSIONER (SECURITIES MARKET)",
  "case_number": "Appeal No. 2 of 2002",
  "court_name": "Appellate Bench of Securities and Exchange Commission of Pakistan",
  "judgment_date": "2002-06-27",
  "reported_as": "2002 C L D 1583",
  "result": "Order accordingly",
  "judges": [
    "Abdul Rehman Oureshi",
    "N. K. Shahani"
  ],
  "appellant": "Lahore Stock Exchange",
  "respondent": "Shahid Ghaffar, Commissioner (Securities Market)",
  "facts": {
    "trading_period": "2000-05-22 to 2000-05-26",
    "shares_involved": "1,061,400 shares of Adamjee Insurance Company Limited (AICL)",
    "trades_deleted": "23 out of 33 trades",
    "grounds_for_deletion": [
      "Cross-transactions",
      "Negotiated deal",
      "Fraudulent intention to shift exposures"
    ]
  },
  "key_events": [
    {
      "date": "2000-05-30",
      "event": "LSE directed deletion of 23 trades from LOTS."
    },
    {
      "date": "2000-05-31",
      "event": "Respondent No. 2 challenged deletion and requested honoring of trades."
    },
    {
      "date": "2000-07-15",
      "event": "Commission remanded case back to LSE for fresh decision."
    },
    {
      "date": "2000-09-15",
      "event": "LSE subcommittee upheld deletion and imposed fines on respondents Nos. 3 and 4."
    },
    {
      "date": "2001-01-03",
      "event": "Commission issued directive to treat 23 trades as genuine and allow settlement."
    },
    {
      "date": "2001-03-13",
      "event": "LSE requested withdrawal of directive and another hearing."
    },
    {
      "date": "2001-09-14",
      "event": "Hearing held; impugned order passed directing LSE to honor trades."
    }
  ],
  "issues": [
    "Whether pending litigation in Sindh High Court warrants stay of proceedings.",
    "Whether principles of natural justice were violated.",
    "Whether investigation was required under SECP Act.",
    "Whether LSE had power to delete transactions and exercised it judiciously.",
    "Whether SEC has jurisdiction to grant relief in terms of the impugned order."
  ],
  "findings": {
    "pending_litigation": "No stay warranted as issues and parties differ.",
    "natural_justice": "LSE had sufficient opportunity to contest; procedural objections dismissed.",
    "investigation": "Not mandatory; sufficient facts and documents were available.",
    "power_to_delete": "Deletion deemed unlawful; LSE failed to substantiate grounds.",
    "jurisdiction": "SEC has authority under SECP Act but cannot enforce performance of contracts."
  },
  "directions": {
    "to_LSE": "Warned and reprimanded to refrain from violations; action against responsible directors directed.",
    "to_respondent_No_2": "Advised to seek compensation for losses before appropriate forum."
  }
}