{
  "case_title": "M/S Habib Modaraba Management (Pvt.) Limited vs Commissioner (Appeals), SRB, Karachi and Assistant Commissioner (Unit-), SRB, Karachi",
  "case_number": "APPEAL NO. AT-164/2015",
  "court_name": "Appellate Tribunal Sindh Revenue Board",
  "judgment_date": "2016-01-06",
  "judges": "Razia Sultana Taher",
  "appellant": "M/S Habib Modaraba Management (Pvt.) Limited",
  "respondents": [
    "Commissioner (Appeals), SRB, Karachi",
    "Assistant Commissioner (Unit-), SRB, Karachi"
  ],
  "result": "Appeal dismissed",
  "facts": {
    "service_provided": "Management services including fund and assets management services",
    "taxable_tariff_heading": "9824.0000",
    "financial_statement": "M/S First Habib Modaraba for the year 2011-12 revealed Rs.95,408,940 paid as management fees",
    "tax_period": "July 2011 to January 2013",
    "failure": "Non-filing of sales tax returns and non-payment of sales tax"
  },
  "legal_issues": [
    "Whether Modaraba and Modaraba Management Companies are one and the same entity?",
    "Whether the transaction constitutes a service?",
    "Whether the services fall under taxable tariff heading 9824.0000?",
    "Whether tax liability arises from remuneration received from profit earned?"
  ],
  "key_findings": {
    "modaraba_and_management_company": "Separate legal entities with distinct rights and liabilities",
    "nature_of_service": "Management services including fund and asset management",
    "taxability": "Remuneration received is taxable under tariff heading 9824.0000"
  },
  "penalties": {
    "default_surcharge": "Under section 44 of the Sindh Sales Tax on Services Act, 2011",
    "penalty_for_non_payment": "Rs.204,470 under section 43(3)",
    "penalty_for_non_filing": "Rs.15,000 under section 43(2)"
  },
  "arguments_by_appellant": [
    "Remuneration is a share of profit, not service charges",
    "No service is provided; Modaraba and Management Company are partners",
    "Remuneration depends on profit earned by Modaraba",
    "Sales tax contradicts the legal principle of 'quid pro quo'",
    "Remuneration is fixed by law under Section 18 of the Modaraba Ordinance"
  ],
  "arguments_by_respondent": [
    "Modaraba and Management Company are not partners",
    "Management services are taxable under tariff heading 9824.0000",
    "Remuneration represents services rendered",
    "Both entities are separate legal persons under the Modaraba Ordinance"
  ],
  "precedents_cited": [
    "M/S UDL Modaraba Management Company vs Commissioner Appeals, SRB",
    "M/S Habib Safe Deposit Vault (Pvt.) Limited vs SRB"
  ],
  "final_decision": "The appeal was dismissed, confirming the taxability of management services provided by the appellant under tariff heading 9824.0000."
}