{
  "case_title": "M/s. Adamjee Insurance Company Limited, Lahore vs The CIR, CTO, Lahore",
  "case_number": "ITA No. 2451/LB/2023",
  "judgment_date": "2023-07-18",
  "court_name": "Appellate Tribunal Inland Revenue",
  "judges": [
    "Nasir Mahmud",
    "Ch. Anwaar-ul-Haq"
  ],
  "appellant": "M/s. Adamjee Insurance Company Limited, Lahore",
  "respondent": "The CIR, CTO, Lahore",
  "result": "Appeal accepted",
  "reported_as": "PTCL 2023 CL. 907",
  "key_issues": [
    {
      "issue": "Applicability of Rule 6(DA) of the Fourth Schedule for tax year 2022",
      "finding": "Rule 6(DA) becomes operative from tax year 2023, and super tax cannot be charged for tax year 2022 based on this rule."
    },
    {
      "issue": "Scope of Fourth Schedule regarding computation and tax charge",
      "finding": "Fourth Schedule governs both computation of profits and gains and tax charge for insurance companies."
    },
    {
      "issue": "Fourth Schedule as part of the main statute",
      "finding": "Fourth Schedule is not subservient legislation and holds equal legislative authority as the main statute."
    },
    {
      "issue": "Statutory interpretation favoring the taxpayer",
      "finding": "Rules of statutory interpretation favor the taxpayer, including strict construction of fiscal statutes and resolving ambiguities in favor of the taxpayer."
    },
    {
      "issue": "Inconsistency in show cause notice and impugned order",
      "finding": "Show cause notice referred to Rule 6(DA) for charging super tax, contradicting the impugned order's assertion that Rule 6(DA) is immaterial."
    }
  ],
  "arguments": {
    "appellant": [
      "Super tax under Section 4C is not applicable for tax year 2022 for insurance companies.",
      "Rule 6(DA) explicitly applies from tax year 2023 onwards.",
      "Fourth Schedule is a self-contained legislation for insurance companies.",
      "Statutory interpretation principles favor the taxpayer."
    ],
    "respondent": [
      "Section 4C overrides Rule 6(DA) and applies for tax year 2022.",
      "Fourth Schedule is limited to computation of profits and gains, not tax charge.",
      "Super tax for tax year 2022 is lawful under Section 4C."
    ]
  },
  "references": [
    "1997 PTD 1693 (SC)",
    "2003 PTD 1321 (HC)",
    "2001 PTD 2042 (HC)",
    "2022 PTD 618 (HC)",
    "PLD 1975 Lah 65 (HC)",
    "Shell Pakistan Ltd vs Federation of Pakistan (Sindh High Court, 2022)"
  ],
  "decision_summary": "The Tribunal annulled the orders passed by the Commissioner Inland Revenue (Appeals) and the Assessing Officer, holding that super tax under Section 4C is not applicable for tax year 2022 for insurance companies. Rule 6(DA) of the Fourth Schedule applies from tax year 2023 onwards."
}