{
  "case_title": "Malik MUHAMMAD AYUB BHATTANI vs HABIBULLAH KHAN KUNDI",
  "case_number": "Petition No. 16 of 1997",
  "judgment_date": "1999-05-31",
  "court": "Election Tribunal",
  "judge": "Nasir-ul-Mulk",
  "reported_as": "2000 M L D 1224",
  "result": "Petition dismissed",
  "appellant": "Malik MUHAMMAD AYUB BHATTANI",
  "respondent": "HABIBULLAH KHAN KUNDI",
  "issues": {
    "issue_1": "Whether petitioner has a cause of action?",
    "issue_2": "Whether the election petition is maintainable?",
    "issue_3": "Whether the petition is liable to dismissal on the ground that it is accompanied neither by list of witnesses nor supporting affidavits of the witnesses?",
    "issue_4": "Whether respondent No.1, his spouse and children have defaulted in repayment of loan of Rs.4,29,06,750, or any other amount, to the Agriculture Development Bank in respect of their project, called Agro Oil Extraction Industries Ltd. D.I. Khan, and therefore incurred disqualification?",
    "issue_5": "Whether respondent No.1 was disqualified from contesting the election on account of being defaulter of loan due to Agriculture Development Bank of Pakistan for Rs.262,40,000 and National Bank of Pakistan for Rs.15,00,000?",
    "issue_6": "Whether respondent No.1 in his declaration with the nomination paper had undervalued his properties and vehicles?",
    "issue_7": "Whether respondent No.1 had failed to disclose and declare in his nomination papers certain properties?",
    "issue_8": "Whether respondent No.1 by using his influence and illegal practices managed to poll bogus votes and converted the result in his favor?",
    "issue_9": "Whether respondent No.1 conducted illegal practice of purchasing votes?",
    "issue_10": "Relief"
  },
  "findings": {
    "issue_4_to_7": "No evidence provided to prove allegations of default, undervaluation, or nondisclosure of properties. Decided in the negative.",
    "issue_8": "No evidence of corrupt or illegal practices at polling stations. Discrepancy of five votes noted but deemed insignificant. Decided in the negative.",
    "issue_9": "No credible evidence of vote purchasing or misuse of identity cards. Witness testimonies ruled out due to inconsistencies and lack of affidavits. Decided in the negative.",
    "issue_10": "Petitioner not entitled to relief. Election petition dismissed."
  },
  "votes": {
    "respondent_votes": 10372,
    "petitioner_votes": 6958,
    "margin": "More than 3000 votes"
  },
  "properties_in_question": {
    "undervalued_properties": [
      "Bungalow No.220, Sector 7, Street 21, Islamabad",
      "209 Kanals of agricultural land known as 'Kundi Gardens', D.I. Khan",
      "Two Toyota Land Cruisers (Registration No. PRU-777 Model 1991 and DNB-99 Model 1991)"
    ],
    "undisclosed_properties": [
      "House owned at Gul Imam, Tank",
      "400 Kanals of agricultural land at Mamrez Jamal, Tank",
      "12000 Kanals at Ahmad Nagar, Tank",
      "Bungalow No.53, Sector G-2, Hayatabad, Peshawar",
      "Four Kanals plot at Hayatabad",
      "Residential apartment in U.K."
    ]
  },
  "legal_references": {
    "act": "Representation of the People Act, 1976",
    "section": "Section 76-A (lapsed)"
  }
}