{
  "case_title": "Messrs ALI BROTHERAN through Proprietor and 4 others vs PROVINCE OF PUNJAB through Secretary and 3 others",
  "case_number": "Writ Petitions Nos.26021 and 34202 of 2015",
  "court": "Lahore High Court",
  "judgment_date": "2016-03-22",
  "judge": "Ijaz-ul-Ahsan",
  "reported_as": "2016 C L C 1339",
  "parties": {
    "appellants": "Messrs ALI BROTHERAN through Proprietor and 4 others",
    "respondents": "PROVINCE OF PUNJAB through Secretary and 3 others"
  },
  "legal_issues": [
    "Whether the Punjab Curriculum and Textbook Board (PCTB) has the authority to develop its own manuscripts for textbooks.",
    "Compliance with the National Textbook and Learning Material Policy and Plan of Action, 2007."
  ],
  "statutes_referenced": [
    "Punjab Curriculum and Textbook Board Act, 2015",
    "National Textbook and Learning Material Policy and Plan of Action, 2007"
  ],
  "key_points": [
    "PCTB is a statutory body established under the Punjab Curriculum and Textbook Board Act, 2015.",
    "The petitioners argued that PCTB lacks the authority to prepare manuscripts in-house and must invite manuscripts through open competition.",
    "The respondents contended that PCTB has the power to develop manuscripts under Section 9(3) of the Act.",
    "The court examined whether PCTB, as a regulator, can also act as a regulatee, which would create a conflict of interest."
  ],
  "court_findings": [
    "The PCTB Act, 2015 does not explicitly grant the Board the power to prepare manuscripts in-house.",
    "The Board's role is primarily regulatory and supervisory, as per Section 9(3) of the Act.",
    "Manuscripts should be developed by external persons or agencies and submitted to PCTB for approval.",
    "Allowing PCTB to develop manuscripts would create a conflict of interest and undermine transparency."
  ],
  "resolution": {
    "agreement": "The Government of Punjab agreed to assign the development of manuscripts to a wing of the Education Department or another agency as defined in the Act.",
    "conditions": [
      "Manuscripts developed by such agencies must be submitted to PCTB for approval.",
      "Individuals with a nexus to the manuscript-developing agency must not participate in PCTB's approval meetings."
    ]
  },
  "result": "Petition disposed of in terms agreed upon by the parties."
}