{
  "case_title": "Messrs AL-NOOR through Partner vs The PROVINCE OF SINDH through Chief Secretary Sindh and 8 others",
  "case_number": "Suit No.1951 of 2018",
  "court_name": "Appellate Tribunal Sindh Revenue Board",
  "judgment_date": "2019-01-10",
  "judge": "Muhammad Junaid Ghaffar",
  "reported_as": "PLD 2019 Sindh 400",
  "result": "Application allowed",
  "parties": {
    "appellant": "Messrs AL-NOOR through Partner",
    "respondent": "The PROVINCE OF SINDH through Chief Secretary Sindh and 8 others"
  },
  "legal_issues": [
    "Declaration",
    "Injunction",
    "Cancellation of contract"
  ],
  "facts": {
    "notice_inviting_tenders_date": "2018-08-16",
    "number_of_tenders": 7,
    "plaintiff_participation": "Plaintiff participated in all tenders and submitted bids with requisite pay orders.",
    "evaluation_report_date": "2018-10-03",
    "allegations": [
      "Plaintiff's bids were ignored despite participation.",
      "Favoritism in awarding contracts.",
      "Misinterpretation of Clause 11.3.4 of SPPRA Regulations.",
      "Acceptance of bids in paisas instead of rupees."
    ]
  },
  "key_arguments": {
    "plaintiff": [
      "Plaintiff's bids were equal to or less than 30% below the Engineer's Estimate.",
      "Bids were fraudulently ignored to benefit certain contractors.",
      "Tender boxes were unsealed, creating a possibility of misplacement of bids.",
      "Clause 11.3.4 was misinterpreted to favor specific bidders."
    ],
    "defendants": [
      "Plaintiff did not submit bids despite attendance.",
      "Bids in paisas are valid in competitive bidding.",
      "Plaintiff failed to approach the Grievance Redressal Committee.",
      "Awarded tenders were to the lowest bidders."
    ]
  },
  "court_findings": {
    "plaintiff_participation": "Plaintiff's participation was established through attendance records and verified pay orders.",
    "favoritism": "Court found evidence of favoritism and lack of transparency in awarding tenders.",
    "misinterpretation_of_clause": "Clause 11.3.4 was misapplied, and bids calculated up to 9 digits after decimal were deemed improper.",
    "engineer's_estimate": "Engineer’s Estimate appeared exaggerated, favoring specific bidders."
  },
  "judgment": {
    "award_of_tenders": "Set aside the award of 7 tenders.",
    "re-advertisement": "Procurement agency (KDA) to re-advertise tenders with proper acknowledgment procedures.",
    "engineer's_estimate": "Engineer’s Estimate to be revised in consultation with NESPAK or similar agency.",
    "bids_in_paisas": "Bids quoted in paisas shall not be considered."
  },
  "laws_referenced": [
    "Sindh Public Procurement Act, 2009",
    "Sindh Public Procurement Rules, 2010",
    "Clause 11.3.4 of SPPRA Regulations"
  ],
  "precedents_cited": [
    "Messrs Facto Belarus Tractors Limited Karachi v. Federation of Pakistan (PLD 2006 Sindh 479)",
    "Asaf Fasihuddin v. Government of Pakistan (2014 SCMR 676)",
    "GETZ Pharma (Pvt) Limited v. Province of Sindh (PLD 2016 Sindh 479)"
  ]
}