{
  "case_title": "Messrs Pakistan Gum and Chemicals Limited vs Additional Commissioner, ENF-III, PRA, Lahore",
  "case_number": "Appeal No.38 of 2021",
  "judgment_date": "2022-11-24",
  "court": "Appellate Tribunal Punjab Revenue Authority",
  "judges": [
    "Ch. Muhammad Tariq Javed",
    "Ch. Javed Anwar"
  ],
  "appellant": "Messrs Pakistan Gum and Chemicals Limited",
  "respondent": "Additional Commissioner, ENF-III, PRA, Lahore",
  "result": "Case remanded",
  "reported_as": "2023 PTD (Trib.) 384",
  "laws_cited": [
    "Punjab Sales Tax on Services Act, 2012",
    "Punjab Sales Tax on Services (Withholding) Rules, 2015",
    "Punjab Sales Tax on Services (Adjudication and Appeals) Rules, 2012",
    "Article 10-A of the Constitution of Pakistan"
  ],
  "key_issues": [
    "Failure to withhold and deposit due tax on taxable services",
    "Violation of Sections 14 and 19 of Punjab Sales Tax on Services Act, 2012",
    "Assessment under Section 52 and recovery under Section 70",
    "Penalty under Section 48 and default surcharge under Section 49",
    "Dual taxation and trans-provincial activities",
    "Non-consideration of documentary evidence by Commissioner (Appeals)"
  ],
  "arguments_appellant": [
    "Impugned order is bad in law and against facts.",
    "Provided full information and documents to the Additional Commissioner.",
    "Tax demand raised on services beyond Punjab jurisdiction.",
    "Dual taxation as tax already deposited with respective authorities.",
    "Penalty under Section 48 wrongly imposed.",
    "Violation of procedural rules under Punjab Sales Tax on Services (Adjudication and Appeals) Rules, 2012."
  ],
  "arguments_respondent": [
    "Sufficient opportunities provided to appellant to present case.",
    "Appellant failed to submit required documentary evidence.",
    "Impugned order based on available record and due appreciation."
  ],
  "tribunal_observations": [
    "Fairness and ample opportunity are essential in litigation.",
    "Commissioner (Appeals) failed to consider relevant evidence.",
    "Tax assessment must be based on exactness, not presumptions.",
    "Show-cause notice included trans-provincial activities requiring further scrutiny."
  ],
  "directions": [
    "Case remanded to Commissioner (Appeals), PRA for fresh decision.",
    "Appellant to provide necessary documents/evidence.",
    "Authority to decide case based on available record if appellant fails to submit evidence.",
    "Registrar directed to communicate order to all concerned."
  ]
}