{
  "case_title": "Messrs DUTY FREE SHOP LTD vs CENTRAL BOARD OF REVENUE and others",
  "case_number": "Constitutional Petitions Nos.D-847, D-1865 and D-1930 of 1997",
  "judgment_date": "1999-07-05",
  "court": "Sindh High Court",
  "judges": [
    "Wajihuddin Ahmed",
    "Raja Qureshi",
    "Ghous Muhammad"
  ],
  "appellant": "Messrs DUTY FREE SHOP LTD",
  "respondent": "CENTRAL BOARD OF REVENUE and others",
  "result": "Petition allowed",
  "reported_as": "2000 P T D 1167",
  "key_issues": [
    "Applicability of withholding tax under section 50(5) of the Income Tax Ordinance, 1979 to goods stored in private bonded warehouses.",
    "Interpretation of 'levied' vs 'leviable' in section 50(5).",
    "Whether goods stored in private warehouses are technically imported into Pakistan.",
    "Impact of administrative interpretations and past practices on statutory provisions."
  ],
  "laws_referenced": [
    "Income Tax Ordinance, 1979 (Section 50(5))",
    "Customs Act, 1969 (Sections 12, 13, 30, 97, 104)",
    "Finance Act, 1995",
    "Customs General Order No.3 of 1982"
  ],
  "precedents_cited": [
    "Canada Sugar Company v. The Queen (1898) AC 735",
    "Nazeer Ahmed v. Pakistan CE&LC PLD 1988 SC 370",
    "Asian Food Industries Ltd. v. Pakistan 1985 SCMR 1753",
    "Eduljee Dinshaw Ltd. v. Income Tax Officer 1990 PTD 155",
    "East West Steamship Company v. Collector of Customs PLD 1976 SC 618",
    "Al-Samrez 1986 SCMR 1917",
    "English Biscuit Manufacturers Ltd. v. Assistant Collector 1991 PTD 478",
    "Central Insurance Company v. Central Board of Revenue 1992 SCMR 1232"
  ],
  "summary": {
    "facts": "Petitioners, engaged in running Duty Free Shops, hold private warehouse licenses and store goods in bonded warehouses. They challenged the imposition of withholding tax under section 50(5) of the Income Tax Ordinance, 1979, arguing that such goods are not technically imported into Pakistan and thus should not attract withholding tax.",
    "decision": "The court ruled that withholding tax under section 50(5) cannot be levied on goods stored in private bonded warehouses until they are cleared for home consumption. Notices and demands for withholding tax on such goods were declared invalid.",
    "majority_opinion": "Wajihuddin Ahmed and Ghous Muhammad held that withholding tax is payable only at the same time and in the same manner as customs duty, which is deferred for goods stored in warehouses.",
    "dissenting_opinion": "Raja Qureshi argued that withholding tax becomes payable even when goods are sent to warehouses, irrespective of their clearance for home consumption."
  }
}