{
  "case_title": "MUHAMMAD ISMAIL vs GOVERNMENT OF BALOCHISTAN, through Secretary S&GA and others",
  "case_number": "Service Appeals Nos.73, 88 of 2002, 2 to 5, 7, 9, 15 and 30 of 2003",
  "court_name": "Balochistan Service Tribunal",
  "judgment_date": "2006-12-28",
  "judges": [
    "Syeda Tahira Safdar",
    "Amanullah Khan"
  ],
  "appellant": "Muhammad Ismail",
  "respondents": [
    "Government of Balochistan, through Secretary S&GA",
    "Muhammad Saleem Lehri",
    "Wazir Muhammad Khan Nasir"
  ],
  "result": "Order accordingly",
  "reported_as": "2007 P L C (C.S.) 483",
  "key_points": {
    "issue_1": "Whether the appeals filed by the appellants are barred by time?",
    "issue_2": "Whether the Government/Executive Authority is competent to grant promotion, in recognition of meritorious services, to the officers of the police force, at the detriment of senior officers?"
  },
  "decision_summary": {
    "time_barred": "Delay in filing appeals was condoned due to public importance.",
    "promotion_legality": "Out of turn promotions were deemed unlawful as they violated statutory rules governing promotions."
  },
  "observations": {
    "promotion_rules": "Promotion should be based on seniority-cum-fitness and through Departmental Promotion Committee.",
    "discretionary_powers": "Discretionary powers must be exercised reasonably and not arbitrarily.",
    "reward_alternatives": "Meritorious services should be rewarded with medals or commendations, not accelerated promotions."
  },
  "directions": {
    "seniority_fixation": "Competent authority directed to consider seniority of appellants and respondents strictly in accordance with law.",
    "future_objections": "Any party may challenge the new seniority list before a competent forum."
  },
  "additional_notes": {
    "appellants_promoted": "All appellants except Tahir Allauddin were promoted to BPS-18 during the pendency of the appeals.",
    "respondents_service": "Respondents served over four years as Superintendent of Police in BPS-18."
  }
}