{
  "case_title": "PWD Employees' Union, Balochistan through Vice-President and others vs Secretary, Communication and Works Department, Government of Balochistan Quetta and others",
  "case_number": "Constitutional Petition No. 370 of 2010, Contempt Application No. 34 of 2010 in C.P. No. 370 of 2010, C.Ps. Nos. 357, 379, 402 of 2011, 117, 844, 912 of 2012, 448, 502, 662, 962 of 2013 and 89 of 2014",
  "judgment_date": "2014-11-10",
  "court": "Balochistan High Court",
  "judges": [
    "Muhammad Hashim Khan Kakar",
    "Ghulam Mustafa Mengal"
  ],
  "appellant": "PWD Employees' Union, Balochistan through Vice-President and others",
  "respondent": "Secretary, Communication and Works Department, Government of Balochistan Quetta and others",
  "result": "Petitions dismissed",
  "reported_as": "2015 P L C (C.S.) 1182",
  "key_issues": [
    "Whether Rule 12 of the Balochistan Civil Servants (Appointment, Promotion and Transfer) Rules, 2009 violates Articles 25 and 27 of the Constitution.",
    "Whether Rule 12 is in conflict with the parent statute, the Balochistan Civil Servants Act, 1974.",
    "Whether Rule 12 is unreasonable or uncertain.",
    "Jurisdiction of the court to strike down Rule 12."
  ],
  "judgment_summary": {
    "notification_examined": "Notification No. S.O.(R-I)5(13)S&GAD-2013/2057-2156 dated 31st July, 2013",
    "rule_12_analysis": "Rule 12 was found discriminatory and ultra vires to Articles 2A, 3, 4, 9, 18, 25, and 27 of the Constitution.",
    "constitutional_violation": "Rule 12 infringes fundamental rights and violates principles of merit and equality.",
    "judicial_review": "Court exercised judicial review under Article 199 of the Constitution to test the constitutionality of Rule 12.",
    "recommendation": "Provincial Government advised to eliminate discriminatory provisions and reservation of seats in government institutions."
  },
  "dismissed_petitions": [
    "Constitutional Petitions Nos. 370 of 2010, 357 of 2011, 117, 844, and 912 of 2012, 448, 502, 662, and 962 of 2013, and (S) 89 of 2014",
    "Constitutional Petitions Nos. 379 and 402 of 2011 dismissed for non-prosecution",
    "Contempt Application No. 34 of 2010 dismissed as not pressed"
  ]
}