{
  "case_title": "Secretary Establishment Division, Government of Pakistan, Islamabad vs Aftab Ahmed Manika and others Rao Manzar Hayat and others",
  "case_number": {
    "civil_petition_1": "41 of 2015",
    "civil_petition_2": "66 of 2015"
  },
  "judgment_date": "2018-03-21",
  "court": "Supreme Court of Pakistan",
  "judges": [
    "Nasir-ul-Mulk",
    "Mushir Alam",
    "Gulzar Ahmed"
  ],
  "result": "Appeal allowed",
  "reported_as": "2018 SCP 1155",
  "appellant": "Secretary Establishment Division, Government of Pakistan, Islamabad",
  "respondents": [
    "Aftab Ahmed Manika and others",
    "Rao Manzar Hayat and others"
  ],
  "summary": {
    "issue": "Promotion of civil servants from BPS-20 to BPS-21",
    "key_points": [
      "Recommendations of the Central Selection Board (CSB) returned by the Prime Minister for reconsideration.",
      "Jurisdiction of High Courts questioned under Article 212 of the Constitution.",
      "High Courts allowed writ petitions, citing discrimination and procedural flaws.",
      "Supreme Court overturned High Court judgments, stating Prime Minister's actions were not arbitrary or discriminatory."
    ]
  },
  "legal_references": {
    "constitution_articles": [
      "Article 212"
    ],
    "civil_servants_act": "Section 9",
    "rules": "Civil Servants (Appointment, Promotion and Transfer) Rules, 1973",
    "case_law": [
      "Safaraz Saleem v. The Federation of Pakistan (PLD 2014 SC 232)",
      "Orya Maqbool Abbasi v. Federation of Pakistan (2014 SCMR 817)",
      "Islamic Republic of Pakistan v. Israrul Haq (PLD 1981 SC 531)",
      "I.A. Sharwani v. Government of Pakistan (1991 SCMR 1041)"
    ]
  },
  "instructions_to_board": {
    "reconsideration_period": "30 days",
    "finalization_period": "15 days after recommendations"
  },
  "key_findings": {
    "prime_minister_powers": "Discretionary powers to return recommendations for reconsideration.",
    "high_court_jurisdiction": "High Courts can assume jurisdiction in absence of functional Service Tribunal.",
    "discrimination": "No evidence of arbitrary or discriminatory actions by the Prime Minister."
  }
}