{
  "case_title": "Sh. AZIZ-UR-RAHMAN AND Another vs BAHAWALNAGAR CO OPERATIVE COMMISSION SHOP LTD. AND Other",
  "case_number": "Regular First Appeal No. 2 of 195",
  "court_name": "Baghdad-ul-Jadid",
  "judgment_date": "1962-02-24",
  "reported_as": "P L D 1962 Baghdad-ul-Jadid 20",
  "judges": [
    "Sajjad Ahmad Jan",
    "Bashir Ahmad"
  ],
  "appellants": [
    "Sheikh Abdur Rahman",
    "Sheikh Aziz-ur-Rahman"
  ],
  "respondents": [
    "Bahawalnagar Co-operative Commission Shop Ltd.",
    "Other"
  ],
  "result": "Appeal partly accepted",
  "issues": [
    {
      "issue_number": 1,
      "description": "Is defendant No. 1 an unnecessary party to the case and that it was essential to strike off his name from the list of defendants?",
      "onus": "Defendants 4 and 5"
    },
    {
      "issue_number": 2,
      "description": "Is defendant No. 4 a sleeping partner who had no knowledge of the facts stated in the plaint, and what effect these facts had on the suit?",
      "onus": "Defendants 4 and 5"
    },
    {
      "issue_number": 3,
      "description": "Did defendant No. 2 take a loan of Rs. 40,000 from the plaintiff in his individual capacity and the other partners, namely, defendants Nos. 3 and 5, were not liable for this amount, the liability being solely of defendant No. 2?",
      "onus": "Defendants 4 and 5"
    },
    {
      "issue_number": 4,
      "description": "Did defendant No. 5 obstruct in good faith the removal of 76 bales of cotton?",
      "onus": "Defendant No. 5"
    },
    {
      "issue_number": 5,
      "description": "Was the obstruction by defendant No. 5 in his individual capacity and any loss suffered by the firm on that account was an individual responsibility of the defendant No. 5 as owner?",
      "onus": "Defendants 2 and 3"
    },
    {
      "issue_number": 6,
      "description": "Were 100 bales of cotton despatched to Karachi for sale on the 16th of December 1952, with the consent of all the partners?",
      "onus": "Plaintiff"
    },
    {
      "issue_number": 7,
      "description": "Was there a regular market for the sale of cotton at Bahawalnagar?",
      "onus": "Defendants 2 and 3"
    },
    {
      "issue_number": 8,
      "description": "Has the plaintiff caused loss to the defendant-firm by his failure to sell 24 bales of cotton in time?",
      "onus": "Defendants"
    },
    {
      "issue_number": 9,
      "description": "Have the ninety-eight bales of cotton been sold for less than the market-price?",
      "onus": "Defendants 4 and 5"
    },
    {
      "issue_number": 10,
      "description": "Is the plaintiff entitled to claim interest at the rate of 7.5% per annum of the loan?",
      "onus": "Plaintiff"
    },
    {
      "issue_number": 11,
      "description": "To what relief is the plaintiff entitled?",
      "onus": "Plaintiff"
    }
  ],
  "key_findings": {
    "relationship": "The relationship between the plaintiff and the defendant was that of pawner and pawnee.",
    "contractual_obligations": "The plaintiff failed to produce the documents embodying the terms of the contract, raising a presumption against him.",
    "interest_claim": "Interest was disallowed due to the absence of contractual evidence supporting its inclusion."
  },
  "legal_points": {
    "contract_act_sections": [
      "148",
      "149",
      "161",
      "176"
    ],
    "partnership_act_sections": [
      "9",
      "11",
      "12",
      "19",
      "22",
      "25",
      "26"
    ]
  },
  "final_decision": {
    "appeal_result": "Allowed to the extent of disallowing interest; otherwise dismissed.",
    "cross_objections": "Dismissed.",
    "costs": "Parties to bear their own costs."
  }
}