{
  "case_title": "SOHNA vs ALLAH DAD AND Another",
  "case_number": "Regular Second Appeal No. 11 of 1958",
  "judgment_date": "1962-04-06",
  "court_name": "Baghdad-ul-Jadid",
  "judges": [
    "Bashir Ahmad",
    "Jamil Hussain Rizvi"
  ],
  "reported_as": "P L D 1962 Baghdad-ul-Jadid 17",
  "appellant": "SOHNA",
  "respondents": [
    "ALLAH DAD",
    "Waryam"
  ],
  "result": "Appeal Allowed",
  "issues": [
    {
      "issue_number": 1,
      "description": "Has the pre-emption decree in favour of Waryam defendant become final as the plaintiff Sohna took no steps to have it set aside?"
    },
    {
      "issue_number": 2,
      "description": "Has the judgment passed in the pre-emption suit become res judicata and the present case cannot proceed?"
    },
    {
      "issue_number": 3,
      "description": "Has the plaintiff waived his right in the pre-emption suit and is, therefore, not competent to file the present suit?"
    },
    {
      "issue_number": 4,
      "description": "Is section 54, Transfer of Property Act, applicable to the facts of this case according to which proprietary rights of the plaintiff in the suit property have not been transferred to Waryam?"
    },
    {
      "issue_number": 5,
      "description": "Has Waryam defendant spent Rs. 200 on the improvement of the land and is he entitled to the amount?"
    },
    {
      "issue_number": 6,
      "description": "In the presence of mutation No. 65 of the land in suit in favour of Allah Dad defendant, is the plaintiff estopped from claiming the property as his own and from denying the proprietary rights thereof as having been transferred in favour of Waryam defendant?"
    }
  ],
  "key_findings": [
    "Neither the vendee nor the pre-emptor acquired any title in the land under the oral contract of sale.",
    "Section 54 of the Transfer of Property Act requires a registered deed for transferring immovable property of value Rs. 100 or more.",
    "The principle of part performance under section 53-A of the Transfer of Property Act is not applicable in the absence of a written contract."
  ],
  "judgment_summary": "The appeal was allowed, and the claim of the appellant Sohna was decreed. The sale was avoided due to the lack of formalities required by law. Both parties were ordered to bear their own costs throughout.",
  "legal_references": [
    {
      "statute": "Transfer of Property Act",
      "sections": [
        "Section 54",
        "Section 53-A"
      ]
    },
    {
      "case_law": [
        "Maddison v. Alderson (1863) 8 A C 467",
        "Mahomed Musa v. Aghore Kumar Ganguli (42 I A 1)",
        "Arif v. Jadunath (I L F 55 Cal. 1090)",
        "Mian Fir Bakhsh v. Sardar Mahomed Tahir (61 I A 388)"
      ]
    }
  ],
  "recommendations": "The judgment suggests legislative action to address issues arising from oral sales of land and the statutory limitations under section 53-A of the Transfer of Property Act.",
  "notifications": [
    {
      "date": "1931-05-28",
      "description": "Section 54 of the Transfer of Property Act applied to Bahawalpur territory."
    },
    {
      "date": "1939-12-14",
      "description": "Section 53-A of the Transfer of Property Act made applicable in Bahawalpur territory."
    }
  ]
}