{
  "case_title": "SOUDAMINI ROY MALAKAR vs NARENDRA CHANDRA BARMAN And Another",
  "case_number": "Appeal from Original Decree No. 104 of 1943",
  "judgment_date": "1952-08-31",
  "court_name": "Dacca",
  "judges": [
    "Muhammad Shahabuddin",
    "Faiyaz Ali"
  ],
  "reported_as": "P L D 1952 Dacca 425",
  "result": "Appeal partly allowed",
  "appellant": "SOUDAMINI ROY MALAKAR",
  "respondents": [
    "NARENDRA CHANDRA BARMAN",
    "Another"
  ],
  "case_summary": {
    "property_involved": "C. S. Plots 1933 and 1934 of the town of Mymensingh with buildings and structures",
    "original_owner": "Kula Chandra Chakrabarty",
    "plaintiff_claim": "3 annas, 6 gandas, 2 karas, 2 krantis share based on Exh. 4 (deed of sale dated 1940-09-12)",
    "dispute_summary": "Partition dispute among heirs and transferees of the property."
  },
  "key_arguments": {
    "appellant_arguments": [
      "Presumption of correctness of record-of-rights entry not given due weight.",
      "Exh. C-1 executed by Hemlata is void due to fraud and lack of legal authority.",
      "Hemlata lost her rights to property and guardianship after remarriage."
    ],
    "respondent_arguments": [
      "Family settlement evidence rightly disbelieved.",
      "Exh. C-1 was validly executed with proper advice.",
      "Hemlata retained property rights due to caste custom allowing remarriage."
    ]
  },
  "court_findings": {
    "exh_a1": "Voluntarily executed by Kumudini in favor of Lakshikanta.",
    "exh_c1": "Valid conveyance executed by Hemlata with proper advice and consideration.",
    "record_of_rights": "Entry showing Satish's share as 3 annas and odd is presumed correct.",
    "hindu_widows_remarriage_act": "Hemlata forfeited her rights to Satish's property upon remarriage but retained guardianship of Kamala."
  },
  "judgment_details": {
    "partition_decree": "Preliminary decree for partition granted for 3 annas and odd share minus 8 gandas and odd share conveyed under Exh. C-1.",
    "commissioner_appointment": "Commissioner to effect partition by metes and bounds.",
    "costs": "Contestant respondents to pay proportionate costs to appellant."
  }
}