{
  "case_title": "TANVIR AHMED KHAN vs HAMID MUKHTAR & 3 others",
  "case_number": "R.P. Nil 474 of 2004 in ROR No. 1693 of 2003",
  "judgment_date": "2009-12-02",
  "court": "Board of Revenue",
  "judges": [
    "Nadeem Ashraf",
    "Azhar Hussain Shamim",
    "Nazir Saeed"
  ],
  "appellant": "Tanvir Ahmed Khan",
  "respondent": "Hamid Mukhtar & 3 others",
  "result": "Petition accepted",
  "reported_as": "PLJ 2010 Tr.C. (Revenue) 100",
  "facts": {
    "death_of_lambardar": "Lambardar of Chak No. 294/GB, Tehsil Toba Tek Singh passed away.",
    "initial_appointment": "District Officer (Revenue), Toba Tek Singh appointed Tanvir Ahmed Khan as Lambardar on 14.04.2003.",
    "appeal": "Hamid Mukhtar appealed against the appointment, which was accepted by Executive District Officer (Revenue), Toba Tek Singh on 02.09.2003.",
    "revision_petition": "Tanvir Ahmed Khan's revision petition was dismissed by Member (Judicial-V), Board of Revenue, Punjab on 19.06.2004."
  },
  "arguments": {
    "appellant": {
      "claims": [
        "Impugned orders were against the law and facts.",
        "Appellant was more suitable due to sound physique, higher education (F.Sc.), and ownership of 76-Kanals, 14-Marlas of land.",
        "Respondent owned only 8-Kanals and had primary education.",
        "Appointment of Lambardar is an administrative matter, and the District Collector's choice should prevail."
      ],
      "prayer": "Review petition should be accepted."
    },
    "respondent": {
      "claims": [
        "Supreme Court prohibited Board of Revenue from reopening Lambardari cases.",
        "Adjudication of the review petition violated Supreme Court orders in PLD 1965 SC 393."
      ],
      "prayer": "Review petition should be dismissed."
    }
  },
  "judgment": {
    "analysis": [
      "Supreme Court ruling in PLD 1965 SC 393 is not applicable due to supersession of rules by West Pakistan Land Revenue Rules, 1968.",
      "Under Section 8 of Board of Revenue Act, 1957, review by Full Board is permissible.",
      "Petitioner has resigned from government service and is prepared to serve as Lambardar.",
      "Petitioner has more land, better education, and is younger, making him more suitable for the role."
    ],
    "decision": "Review petition accepted. Orders dated 02.09.2003 and 19.06.2004 are set aside. Order dated 14.04.2003 by District Officer (Revenue), Toba Tek Singh is upheld."
  }
}