{
  "case_title": "THE RAJSHAHI CO-OPERATIVE TOWN BANK. LTD. vs MOHINI MOHAN SANYAL And Others",
  "case_number": "Letters Patent Appeal No. 1 of 1949",
  "judgment_date": "1952-07-22",
  "court": "Dacca",
  "judges": [
    "Muhammad Shahabuddin",
    "Akbar"
  ],
  "appellant": "THE RAJSHAHI CO-OPERATIVE TOWN BANK. LTD.",
  "respondent": "MOHINI MOHAN SANYAL And Others",
  "result": "Appeal allowed",
  "reported_as": "P L D 1954 Dacca 37",
  "facts": {
    "loan_details": "The second respondent borrowed money from the appellant bank, with respondents 1, 3, and 4 as sureties on a bond.",
    "award_date": "1933-06-26",
    "execution_cases": [
      {
        "year": 1936,
        "status": "Dismissed"
      },
      {
        "year": 1939,
        "status": "Dismissed"
      },
      {
        "year": 1942,
        "case_number": "Execution Case No. 31/42",
        "status": "Stayed under Bengal Agricultural Debtors Act"
      },
      {
        "year": 1945,
        "case_number": "Execution Case No. 84/45",
        "status": "Dismissed by Munsif"
      }
    ]
  },
  "issues": [
    "Whether the execution petition of 1942 was valid against all four respondents.",
    "Whether the execution petition of 1945 was barred due to the stay order on the 1942 petition.",
    "Whether the omission in column 11 of the 1942 petition invalidated it for respondents 1 to 3."
  ],
  "arguments": {
    "appellant": {
      "contention": "The 1942 application was only against respondent 4 as column 11 specified the mode of execution only for respondent 4.",
      "legal_basis": "Order XXI, Rule 11 and Rule 17 of the Civil Procedure Code."
    },
    "respondent": {
      "contention": "The 1942 application was against all four respondents as their names were listed in column 9 and notices were issued under Order XXI, Rule 22."
    }
  },
  "decision": {
    "district_judge": "Held that the 1942 application was only against respondent 4 and allowed the 1945 petition for respondents 1 to 3.",
    "ormond_j": "Reversed the District Judge's decision, holding that the 1942 application was against all four respondents.",
    "final_decision": "The appellate court restored the District Judge's decision, holding that the 1942 application was valid only against respondent 4."
  },
  "legal_references": [
    "Order XXI, Rule 11, Civil Procedure Code",
    "Order XXI, Rule 22, Civil Procedure Code",
    "Order XXI, Rule 17, Civil Procedure Code",
    "Section 34, Bengal Agricultural Debtors Act"
  ],
  "key_points": [
    "The omission in column 11 of the 1942 application was a serious defect.",
    "The stay order applied only to respondent 4 and not to respondents 1 to 3.",
    "The 1945 application was valid for respondents 1 to 3 as the 1942 application was not properly filed against them."
  ],
  "advocates": {
    "appellant": "Mr. Bhattacharjee",
    "respondent": "Mr. Birendra Kumar Dey (reported no instructions)"
  },
  "citation_references": [
    "Abu Taher Bazlul Rashid and others v. Chandra Moni Saha and others (43 C W N 318)"
  ]
}