{
  "case_title": "ZIA-UD-DIN ABDUL HAMID vs AZAD JAMMU AND KASHMIR GOVERNMENT through Secretary Education and 95 others",
  "case_number": "Service Appeal No. 363",
  "judgment_date": "1992-01-27",
  "court_name": "Azad Jammu and Kashmir Service Tribunal",
  "judges": [
    "Sardar Muhammad Sajawal Khan",
    "Raja Muhammad Ashraf Kayani",
    "Zaidullah Khan"
  ],
  "appellant": "ZIA-UD-DIN ABDUL HAMID",
  "respondent": "AZAD JAMMU AND KASHMIR GOVERNMENT through Secretary Education and 95 others",
  "result": "Appeal allowed",
  "key_issues": {
    "seniority_dispute": "Appellant challenged his placement at serial No. 160 in the seniority list dated 28-4-1986.",
    "grievance": "Appellant argued he was senior to respondents based on stepping into National Pay Scale No. 14 w.e.f. 5-6-1976.",
    "respondent_arguments": [
      "Appeal is premature as the seniority list is not final.",
      "Appeal is time-barred.",
      "Appeal is not maintainable as it lacks specific orders against respondent No. 2.",
      "Appellant failed to submit objections to the seniority list in time."
    ]
  },
  "tribunal_decision": {
    "majority_opinion": "Appellant's seniority should be reckoned from 5-6-1976, the date he was placed in regular pay scale No. 14.",
    "minority_opinion": "Appeal is not maintainable due to unchallenged orders promoting respondents and procedural limitations."
  },
  "legal_basis": {
    "article_84_ksr": "Provides that teachers clearing compartment exams are considered to have passed within prescribed time.",
    "rule_10_education_department": "Seniority determined by merit assigned by appointing authority.",
    "rule_8_civil_servants_rules_1977": "Seniority fixed based on continuous appointment date in the grade."
  },
  "key_findings": {
    "seniority_date": "Appellant's seniority fixed from 5-6-1976, aligning with the date increments were released.",
    "compartment_exam": "Clearing compartment does not disadvantage seniority under Article 84 of KSR.",
    "procedural_irregularities": "Impugned seniority list lacked legal force as it was unsigned by the appointing authority."
  },
  "order": {
    "appeal_status": "Allowed",
    "seniority_revised": "Appellant's seniority fixed w.e.f. 5-6-1976.",
    "costs": "No order as to costs."
  }
}